{"https://www.qa-financial.com/articles/french-treasury-pioneers-new-open-source-data-management-platform": "More than 100 experts from financial firms met in Canary Wharf, London, on October 18th for the QA Financial Forum London. Among the expert speakers were Mohamed Mehdi Ben Aissa (pictured), and Sinh Chung Nguyen, data architects at the Direction Générale des Finances Publiques (DGFiP) - the treasury department of the French state - who explained their role in the creation of a new open source data management platform.\r\n\r\nOver the past 18 months, DGFiP and  Électricité de France, the French energy provider, have developed the Trunk Data Platform (TDP) -  a free and open source Apache-based distribution platform, with its source code readily available on GitHub.  \r\n\r\nThe decision to create this new platform followed the acquisition of the open-source Hortonworks data platform by Cloudera in early 2019. This - according to the DGFiP -  fundamentally changed the dynamics of the data management marketplace, and it decided to move to its own new platform,\r\n\r\nPreviously using HDP 3.1.4, DGFiP found the need to move away from the platform when it was acquired by Cloudera in early 2019, as it became deprecated for Cloudera’s own offerings. Wanting to avoid vendor lock-in, and with a strong open-source philosophy at the treasury, DGFiP and other French public and private bodies, including EDF, discussed alternative approaches to open source data management.\r\n\r\nAt the QA Financial Forum Ben Aissa described the key uses for data management: for fraud detection, electronic invoicing, and also the Foncier Innovant, a scheme which includes a series of innovative technologies, which  has recently been used, for example, to find untaxed swimming pools with an AI cross-referencing satellite data.\r\n\r\nBy adopting what the DGFiP architects describe as a ‘data stewardship model’, the platform is intended to make sharing data easier, while improving the quality of the data and cutting down on duplicate work. Now they are seeking to develop the user interface of the platform, introduce Kubernetes integration, alongside monitoring and log management, and deepen its machine learning integrations.", "https://www.qa-financial.com/articles/introducing-the-qa-financial-100": "The QA Financial 100 is a complete and detailed directory of the industry leaders in test automation and other DevOps technologies and will be a key resource for heads of software engineering and QA.\r\nIn this 40-page guide - available as a downloadable PDF - we have produced comprehensive profiles on the 100 leading vendors of software quality management services, detailing the tools they offer and their core business focus, along with details of recent corporate activity, including M&A activity, ownership changes and major new PE and VC investments. Each profile is linked to the relevant company website.\r\nQA Financial has comprehensively researched information on a wide group of vendors, consultants and system integrators, including those with a special focus on providing software quality services to the financial services community.\r\nWe’ve based our selection of the 100 worldwide on conversations with leaders in software development and quality management at leading banks, insurance companies, asset managers, fintechs and other financial services firms. We’ve also added a section on seven ‘rising’ star firms - all relatively new, with one founded as recently as 2020 - and which we believe will be worth watching for progress over the coming year,\r\nThe QA Financial will be reviewed and published annually.\r\nThe QA Financial 100 vendors are broken down into five key categories, the largest of which is composed of firms that specialise in providing automated software testing and QA tools. We explain what these tools do. We also have categories for larger software firms that offer QA services; for systems integrators and consultants that offer QA and testing services, for code software companies with test automation tools and QA services, accessibility specialists; for specialists in code quality management, test data management and accessibility testing.\r\nWhile the QA Financial 100 directory comprises the bulk of the guide, we also provide 11 pages of our authoritative editorial insight in detailed chapters covering:\r\nThe compliance drivers for digital change and new standards for software management at financial firms. One focus here is the European Union’s Digital Operational Resilience Act (DORA),which is likely to come into force in 2024.\r\nA review of five key technology trends that we believe will be critical for software quality assurance and DevOps for financial firms in 2023. For example: the technology behind low-code development and visual testing.\r\nOur overview of the vendor market, evaluating the key trends in M&A over the past 12 months, and the impact of consolidation of tooling by financial firms.\r\nThe QA Financial is offered at £300 (inclusive of VAT) for the first 100 buyers.", "https://www.qa-financial.com/articles/join-us-as-an-expert-speaker-at-the-qa-financial-forums": "Since 2016, more than 180 different speakers and more than 2,000 delegates have joined us at our QA Financial Forum events, in New York, Chicago, London, Paris, Milan and Singapore. \r\n\r\n\r\n\r\nOur agendas focus on how financial firms are managing software quality. We are looking for speakers from financial firms who are happy to share their experience and insights on a range of topics such as:\r\n\r\nEnterprise management of software quality, for efficiency, risk management and compliance\r\nNew technologies in DevOps and automation, such as virtualization, visual testing and chaos engineering\r\nSoftware development and data management in the Cloud Code quality management and benchmarking\r\n\r\n\r\nSpeaker FAQ\r\n\r\n\r\n1.) Why should I speak at the QA Financial Forum?\r\n\r\nThere is a real value to discussing how your firm and your team are addressing the challenge of managing software quality in its digital transformation. You’ll be discussing and networking with peers from other financial firms who are interested in what you are doing, and sharing their experiences with you. \r\n\r\n\r\n\r\nIncreasingly, financial firms are sharing information on software management as regulators and supervisors seek to establish industry standards for digital resilience.\r\n\r\n\r\n\r\nAnd, finally, why not celebrate your achievements and the challenges you have overcome?\r\n\r\n\r\n\r\n\r\n\r\n2.) How do we agree on a topic?\r\n\r\nWe will discuss that with you and - based on that discussion - provide you with a draft description for your approval. We aim to minimise the amount of work you have to do on this, and guide you on the information points that your audience will be most interested in. \r\n\r\n\r\n\r\nWe know you have an interesting story to tell, and we’ll help you tell it.\r\n\r\n\r\n\r\n\r\n\r\n3. ) Who are the delegates at your Forum events?\r\n\r\nAll our delegates are invited. They are senior IT professionals at banks, insurers, asset managers and capital market firms. Typically, we have around 100 delegates at our events, and we leave plenty of time for coffee and lunch breaks for networking.\r\n\r\n\r\n\r\n4.) Where do the Forums take place?\r\n\r\nWe use venues at the heart of financial centers that are easy for delegates and speakers to access, such as the Harvard Club of New York on W44th St in NYC. Our venues always offer high levels of audio-visual equipment and catering service.\r\n\r\n\r\n\r\n5.) How do I address my firm’s internal compliance process?\r\n\r\nWe find that compliance and communications departments typically ask the same key questions. And here are the answers:\r\n\r\n\r\n\r\nThe producer of the QA Financial Forum series is QA Media, an independent, privately-owned, information business based in London.\r\n\r\nQA Media has an information focus on technologies for software quality assurance and our website is www.qa-financial.com\r\n\r\nThe audience at the Forum events are invited delegates from financial and E-commerce firms.\r\n\r\nThe speakers are prominent software QA and IT risk managers.\r\n\r\nThe Forums run in London, NYC, Chicago, Stockholm, Milan, Paris and Singapore.\r\n\r\nThe events are \"Chatham House Rule\" and treated as background only by delegates as a condition of invitation.\r\n\r\nNo media are in attendance.\r\n\r\nAround 100 delegates attend the events.\r\n\r\n\r\n\r\n​\r\n\r\n6.) Do you have any useful guidelines for speakers?\r\n\r\nYes. Our presentations all last 30 minutes, including some time for audience questions. That time flies by, so above all focus your session on a topic of clear relevance, including examples of best practice where possible.\r\n\r\nNot all our presentations are simply PowerPoint presentations. They can take the form of panel sessions, or Q&A sessions. But slides that illustrate key points are always useful.\r\n\r\n\r\n\r\nBut if you are - like most speakers - presenting on your own, then typically 10-12 slides is an optimum number. We suggest a font size of no less than 14 for the text, and clear fonts, such as Sans Serifs. Remember please that small charts or graphs that cannot be read by delegates will be frustrating for them. \r\n\r\n\r\n\r\nWe’ll ask you to supply the presentation in advance so we can load it onto the AV system and the conference room will be equipped with a laptop, slide-changer etc.\r\n\r\n\r\n\r\n7.) Who do I get in touch with?\r\n\r\nIf you are interested in discussing the idea of speaking at one of our events, please drop a line to Karine Hetherington, our conference producer, at karine@qa-financial.com. We’ll be happy to tell you more.", "https://www.qa-financial.com/articles/lambdatest-launches-testing-cloud": "LambdaTest, the San Francisco-headquartered Cloud Automation Testing Platform provider, has added a “Digital Experience Testing Cloud” to its platform. The aim is to offer a unified testing environment, enabling enterprises to optimise users’ digital experience.\r\n \r\nFounded in 2017, LambdaTest claims over two million users for its range of testing platforms, which support all major programming languages and test automation frameworks.\r\n\r\nLambdaTest’s Digital Experience Testing Cloud is designed to allow customers to perform cross browser testing, real device testing, continuous testing, and visual regression testing and will provide detailed analytics and insights to facilitate data-driven decision-making, the company says.  \r\n\r\nLambdaTest was recently name-checked by Microsoft chairman and CEO Satya Nadella (pictured), who earlier this year told a Microsoft conference in Bengaluru that: “LambdaTest is doing for test automation what Kubernetes did for container orchestration - creating that next level of efficiency around test automation so that people can actually focus on testing versus test orchestration”.", "https://www.qa-financial.com/articles/m-a-in-software-testing-outpaces-broader-it-sector": "It’s been a busy year for merger activity among quality assurance and testing firms. According to research by Capstone Partners, a private equity firm, the number of mergers among software development firms in the first half of 2022 was up 27% on the number in 2021 - faster growth than in the broader technology sector. Deals are being driven by the need to keep pace with demand for upgrading legacy systems and migration to the Cloud. Demand for containerization, AI, and security technologies is likely to underpin this trend into 2023, according to Capstone.\r\nThe largest acquisition of the year among testing specialists is almost certain to be OpenText’s $6bn bid for Micro Focus, announced in August. Founded in 1976, Micro Focus has a long history in software test automation, although its share price was under significant pressure prior to bid, having falled by 37% since the start of the year. The share price doubled on the news of the agreed offer..\r\nIn February, Tricentis, the test automation firm that has competed most directly with Micro Focus over recent years, acquired Testim, a AI-based platform for UI testing. \r\nMay saw three acquisitions: Hexawise, the low-code software test automation tool was acquired by Idera, a leading software company headquartered in Texas; Perforce, parent company of test automation platform Perfecto, completed its acquisition of Puppet, the provider of cloud infrastructure automation, and Planview, a Texan portfolio management company, acquired Tasktop, the Canadian value stream management platform.\r\nIn August Level Access, the digital accessibility testing company completed its merger with eSSENTIAL Accessibility, which offers accessibility as a service, and Qualitest acquired Indian software testing company ZenQ, adding over 600 quality engineers to its team. \r\n\r\nMore detail on the activities of vendors in 2022 can be found in the QA Financial 100.\r\nMost recently, Planit, the Australia-based test automation specialist, announced in early November that it will acquire Shift Left Group, a quality assurance management company based in the UK, following its strategy to become the largest specialist quality engineering service provider worldwide by 2030 through a combination of organic growth and acquisitions across the UK, Europe, and Asia. Planit also acquired New Zealand-based QA integration company Qual IT in July.", "https://www.qa-financial.com/articles/tricentis-launches-cloud-based-no-code-testing": "Tricentis, the Austria-based test automation specialist, has released Tricentis Test Automation (TTA),  a cloud-based no-code test automation solution. The platform includes test creation, orchestration, and scalable test execution for web-based applications and business processes.\r\n\r\n“While organisations are building their businesses and deploying applications on the cloud, most teams are constrained by legacy processes which are creating slow, error-prone and costly challenges due to the lack of a viable cloud-based testing solution,” said Suhail Ansari, CTO of Tricentis (pictured). “Tricentis Test Automation enables organisations to automate end-to-end quality for their integrated cloud-based solutions with faster speeds, no-code, and reduced test maintenance costs.”\r\n\r\nTricentis described the SaaS-based solution as “the next iteration of model-based testing”, built specifically for enterprise applications where use cases or business processes span multiple applications. TTA builds on the processes used in Tosca, Tricentis’ flagship offering, which also provides model-based no-code test automation tools, but is specialised for cloud-based applications, enabling teams to verify quality across their integrated platforms. \r\n\r\nFrom functional UI to API/microservices testing, by way of a no-code interface, the solution allows anyone to quickly assemble scalable automated tests without coding or prior test automation knowledge, Tricentis said.\r\n\r\nTTA’s key features include end-to-end process testing, suitable for cloud-based SaaS services, utilising the elastic execution grid (E2G) to test at scale by running multiple tests in parallel across distributed infrastructures and virtual machines.\r\n\r\nThrough model-based UI test automation, the underlying application is kept separate, which Tricentis says allows for flexible and resilient testing. By simulating microservices that are out of a team’s control, costly, or unavailable, applications can be tested earlier and more completely. Virtual services and contract tests are created from recorded traffic and deployed as needed in the DevOps process.\r\n\r\n\r\n\r\n[Image source: Tricentis]", "https://www.qa-financial.com/articles/skandia-trials-new-data-test-management-platform": "Skandia, the leading Swedish-based insurance company, is trialling a new test-data management platform launched in 2020.\r\n\r\nSkandia is using X-AutoMate’s new framework for data quality management and test automation for its solvency reporting application.\r\n\r\n“The possibility to follow up on test approaches instead of test cases increase the possibility to communicate with stakeholders on what QA improvements are needed, for example what is covered on what test level,” said an employee at Skandia.\r\n\r\nFounded in Sweden in 2020, X-AutoMate launched its testing platform in 2021. The platform includes a library of 35 methodologies for analysing data flows. Based on open-source tools, the platform is technology agnostic, X-AutoMate claims, and is able to connect to data lakes on-prem, in the cloud, via VM or Kubernetes container. The platform includes two modules, offering test automation for data sources alongside simple data quality management.\r\n\r\nBy analysing the metadata of the sources, the testing framework defines test cases without observing data directly. This helps to minimise the security concerns and scalability issues involved with large data sets. \r\n\r\nKnow-your-customer (KYC) requirements at financial firms require high quality data, which can be difficult to acquire when environments become complex. Outcomes at one data source must be echoed throughout the data warehouse. By completing checks on data across the warehouse, X-AutoMate limits siloing and pushes the errors found in the warehouse left in the development cycle.\r\n\r\nWhile most data quality management tools observe production data, X-AutoMate’s testing tool monitors the development pipeline and halts deployment before issues enter production, avoiding the slow and expensive process of patching large amounts of live data.\r\n\r\nThe tooling for test data compliance often lags behind other QA and development environments at financial firms. With the ability to verify and catalogue the complete data flow, including the semantic layers, X-AutoMate will replace more limited reporting tools, claims its head of product development, Bernes Maksumic (pictured).\r\n\r\nSo, for example, Skandia’s use of X-AutoMate for its Solvency reporting application, a complex system that took inputs from many ledgers, helps to meet the demand from regulators for strict standards for calculations and transformations made across multiple layers of data, so that  outputs can be validated.", "https://www.qa-financial.com/articles/ransomware-attacks-on-financial-firms-increase-300-": "Research by California-based  IT security specialist Barracuda has revealed that financial firms have seen ransomware attacks this year rise to a level as much as three times higher than they were 12 months previously. The increase in working-from-home is one key reason for the increase, Barracuda says in a research report.\r\n\r\nThe research  also noted a rise in the number of attacks on IT and business service providers. These attacks are especially dangerous as they can offer unique access to clients’ systems, and outages can have dramatic knock-on effects across a number of clients.\r\n\r\nBased on data gathered on its clients via its  security operations centre,  Barracuda detected a peak of 1.2 million attempts for the month of June. The key channels of attack were through the use of phishing links and gaining access to less secure VPNs, a method which has gained in popularity as a result of remote working, according to Barracuda. Although firms have had time to improve their authentication methods since the start of the Covid pandemic, it remains to be seen if the upward trend will continue.\r\n\r\n“As ransomware and other cyberthreats continue to evolve, the need for adequate security solutions has never been greater,” said Fleming Shi, CTO at Barracuda. “Sophisticated security technologies should be available as services, so that businesses of all sizes can protect themselves against these ever-changing threats.”\r\n\r\nOf the 106 highly-publicised ransomware attacks since August 2021, the financial sector accounted for 6% of attacks.The most targeted industries were education (15%), municipalities (12%) and healthcare (12%). Attacks on critical infrastructure, such as energy and water companies, saw the highest relative increase in the same period. \r\n\r\nThe Barracuda report underlines that most successful attacks are not publicly disclosed. However, what has been disclosed suggests that fewer victims paid ransoms, which the report suggests is likely the result of improved defences.", "https://www.qa-financial.com/articles/banyan-software-acquires-element34": "Banyan Software, the US private equity firm specialising in software deals, has acquired Swiss mobile testing expert, Element34, as it focuses on acquisitions in the UK and Europe.\r\n\r\nFounded in 2015, Element34’s flagship product, SBOX, allows security and data privacy-minded enterprises to utilise secure on-premises Selenium testing for their web and mobile applications across multiple browsers and mobile devices. Acting within company networks to avoid the use of VPNs, SBOX is able to be run on physical servers or via cloud services for testing at scale.\r\n\r\nElement34 customers are primarily European banks and insurance companies, but include government organisations and global brand owners.\r\n\r\nThe Element34 acquisition follows Banyan’s recent acquisition of Clockwork IT, the UK based provider of remote working tools, bringing the Banyan UK and European headcount to around 100 full-time employees.\r\n\r\n“It was clear to us that there is a wealth of opportunity to partner with leading B2B software businesses in the UK and Europe, which led Banyan to invest in a dedicated team on the ground earlier this year,” said Graham Carney (pictured), UK and European M&A director at Banyan Software. “Now, having closed two acquisitions within weeks of each other, this is a testament to the value that our locally based investment team can bring. We’re delighted to welcome Element34 and Clockwork IT to the Banyan group, and we’re excited to build on our acquisition strategy in 2023.”\r\n\t\r\nHeadquartered in Atlanta, Banyan ranked 10th in Deloitte’s 2021 Technology Fast 500 and describes itself as a ‘long-term software investor’, serving specialised vertical markets with annual revenues between $2m and $30m.", "https://www.qa-financial.com/articles/white-paper-selecting-a-selenium-grid-in-an-enterprise": "This white paper is intended to give guidance for determining a suitable Selenium Grid Infrastructure solution for your enterprise.\r\n\r\nSelenium Grid is the common approach for a cross browser and mobile testing infrastructure. Selenium Grid allows you to run tests on multiple browser / device / OS combinations in parallel and helps to reduce test suite execution times significantly.  \r\n\r\nThere are three main options for setting up a Selenium Grid infrastructure in the market today:\r\n\r\nOn-premises homegrown\r\nSaaS / Cloud\r\nOn-premises vendor managed\r\nThis white paper is intended to give guidance for determining a suitable Selenium Grid Infrastructure solution for your enterprise organization. We will look at the currently available Selenium Grid solutions in the market and compare pros and cons.", "https://www.qa-financial.com/articles/nomura-backed-planit-buys-shift-left-group": "Planit, the Australian-based test automation specialist, has acquired UK-based Shift Left Group, increasing its UK headcount by more than 50% to over 300.\r\n\r\nGoing forward, Shift Left Group will continue to use its own brand, providing  managed QA services, including test automation, cloud acceleration, and DevOps adoption. \r\n\r\n“Through this acquisition, we can leverage Shift Left's suite of services and strong customer base to expand our offerings throughout the UK and into Europe, which is key to executing our Vision 2030 strategy,” said Mike Weale, CEO of Planit (pictured).\r\n\r\nBacked by its parent company - Japan’s Nomura Research Institute - Planit aims to become the largest specialist quality engineering service provider worldwide by 2030, with a focus on growth into the UK and northern Europe through mergers and organically before moving to establish a foothold in Asia. In recent months, Planit also acquired Qual IT, a New Zealand based QA integration company.\r\n\r\nWith a presence in the UK since 2014, Planit holds offices in Reading and London, and had a headcount of 195 before the acquisition of Yorkshire-based Shift Left Group.", "https://www.qa-financial.com/articles/tricentis-partners-with-qualitykiosk": "Tricentis, the Austin-headquartered software test automation specialist, has announced a strategic partnership with QualityKiosk, the Mumbai-headquartered digital quality engineering company. \r\n\r\nFounded in 2000 QualityKiosk offers quality assurance services across a broad range of industries including banking, financial services and insurance, and counts Citibank, Kotak Mahindra Bank and ICICI Bank amongst its clients.\r\n\r\nThe partnership will see QualityKiosk integrate Tricentis automation solutions into its existing line-up of quality assurance and engineering offerings. Commenting on the deal, QualityKiosk founder and CEO, Maneesh Jhawar [pictured], said: \"Our partnership with Tricentis is unique because it combines the best of both worlds: our deep domain expertise in quality engineering and Tricentis' AI-driven automation, no code, script-less solutions. The partnership will help us deliver more value to our clients and achieve their digital transformation goals.\"\r\n\r\n[Image Source: QualityKiosk]", "https://www.qa-financial.com/articles/software-risk-management-regulation-round-up-": "Around the world, regulators and financial markets supervisors are increasing the scrutiny of how firms manage software risk and enterprise digital risk. \r\n\r\nThe European Union, for example, is readying its Digital Operational resilience Act (DORA), which will require firms to put a formal technology governance framework in place and  impose fines on firms whose software fails for avoidable reasons. (You can read a white paper on DORA and its impact - published by leading software testing services vendor Expleo, with research by QA Financial - here.)\r\n\r\nWe’ll be watching and reporting on further developments in the implementation of DORA, which was formally adopted as legislation by the European Council last November.\r\n\r\nMeanwhile, here’s our round-up of important regulatory news announcements in February relating to software risk management - as we’ll describe it for convenience - at financial firms.\r\n\r\nUS Treasury’s Shambaugh praises DORA\r\n\r\nDuring a February conference speech at the seventh annual Afore Consulting FinTech and regulation conference, Jay Shambaugh, the US Treasury under secretary for international affairs (pictured) spoke about the need to address challenges surrounding cybersecurity and operational resilience for the financial sector.\r\n\r\nShambaugh praised the EU digital operational resilience act (DORA), claiming it “overhauls the EU’s cybersecurity framework to meet the challenges of the modern era”. He went on to highlight the importance of collaboration with private sector institutions. “Securing the financial sector must be done in partnership with companies, who operate most of the financial sector’s critical infrastructure,” he said. ”It has been our priority to improve information sharing between the public and private sector over the last year”.\r\n\r\nHe concluded this section of the speech by outlining the need for international cooperation when dealing with the challenges posed.  “We are committed to working with the private sector to address these challenges. And because cloud is a global technology, we should avoid international regulatory fragmentation that could make cloud services less secure and resilient. We’ve started initial conversations with our likeminded counterparts, including our friends in the EU, and hope to progress further in the coming months and years.”.\r\n\r\nFull text available here.\r\n\r\nUS Treasury highlights cloud technology risks\r\n\r\nThe US Department of the Treasury released a report outlining its views on the benefits and challenges associated with the adoption of cloud technologies by financial sector institutions. \r\n\r\nThe report found that cloud services could improve the resilience and security of financial institutions, and identified a  number of significant challenges:\r\n\r\nLack of transparency concerning the details of incidents impacting their systems hinders due diligence and monitoring by financial institutions.\r\nWorkforce talent shortages may hinder the adoption of cloud services by financial institutions.\r\nIncreased exposure to incidents originating from a cloud service provider\r\nPotential broad-market impacts of the highly concentrated cloud service provider marketplace\r\nThe highly concentrated nature of the cloud service marketplace may increase the difficulty of negotiation for financial firms\r\nThe complexity of the global regulatory landscape for cloud technology may provide difficulty in scaling up cloud-integrated offerings\r\n\r\nThe full report proposes recommendations for the secure and responsible adoption of cloud technologies by financial institutions.\r\n\r\nThe full US Treasury report is available here\r\n\r\nNIST launches AI risk management framework playbook\r\n\r\nThe US National Institute of Standards and Technology (NIST) has launched a GitHub hosted playbook which suggests ways to utilise the recently released AI risk management framework version 1.0 (AI RMF 1.0), which provides guidance for organisations on best practices to design and manage trustworthy and reliable artificial intelligence systems. NIST has announced that it will continue to take comments on the playbook, reviewing and integrating these semi-annually. \r\n\r\nThe hope is that this iterative approach will enable the framework to continue to adapt to the ongoing changes in technology and understanding, NIST said.\r\n\r\nLink to the playbook available here\r\n\r\nBank of England publishes outsourcing policy\r\n\r\nThe Bank of England has published its policy on outsourcing and third-party risk management for financial market infrastructures. The new policy takes the form of a series of supervisory statements and an addition to its Code of Practice. \r\n\r\nThe new policy aims to outline the bank's requirements in relation to outsourcing and third-party risk management and build upon the Bank of England’s response to the future of finance report, by helping to facilitate the adoption of cloud and other technologies.\r\n\r\nFull policy details available here \r\n\r\nUK government calls for views on software resilience and security\r\n\r\nThe UK government has called for views on software resilience and security from relevant organisations to begin to understand how best to address software-associated risks and create a more resilient digital environment, it claims.\r\n\r\nThis could signal a continuation of the trend towards increased regulatory oversight for the sector.\r\n\r\nFull publication available here\r\n\r\nEU regulators set new deadline for Broadcom bid for VMware\r\n\r\nEU antitrust regulators have set a deadline of June 7th to make a final decision on whether to clear or block the deal for San Jose headquartered technology company Broadcom’s $61bn bid for cloud computing provider VMware. The announcement follows the resumption of the EU’s  investigation, which was temporarily postponed on January 31st.", "https://www.qa-financial.com/articles/northern-trust-keynotes-at-our-chicago-2023-forum": "QA Financial's Forum event returns to the Metropolitan Club in Chicago on April 5th 2023, and delegates will be hearing how Northern Trust has built a new policy-driven framework for managing the transition to DevOps.\r\nOur keynote co-presenters will be Basivi Junna (pictured) and Sean Ghassemi, respectively VP and principal solutions architect and SVP and chief architect at the bank, one of the world's leading banking and asset management providers.\r\nAs Northern Trust has moved its on-prem software development toolchain to the Cloud, it has created a new system for DevOps platform management and adopted new metrics and for software quality benchmarking. \r\nThe key objective has been to lower the rates of incidents related to change, improve productivity and speed to market. Northern Trust is doing this with a standardized suite of cloud-based tools, processes and reusable templatized CI/CD pipelines for application, database, and infrastructure changes. \r\nBasivi and Sean will explain how one of the world's largest banking and asset management organizations has performed across its many internal development teams and how new initiatives to free up those teams - zero touch deployments, instant change authorization, shift left testing, and SCA, SAST & DAST scanning - have been balanced with data-driven automated policy checks against changes that enforce best practices across the enterprise. \r\nThey will also be discussing how Northern Trust worked with its external vendor partners to put new standards of non-functional requirements, quality assurance, code coverage and validation of DevOps into practice, and how improved observability of software delivery feeds into compliance and auditing at Northern Trust.\r\nFor more information about the QA Financial Forum Chicago, including how you can register to attend, click here.", "https://www.qa-financial.com/articles/baas-firm-griffin-wins-uk-banking-licence": "Test sandbox offered to new users\r\n\r\nGriffin, a London-based financial services firm serving fintechs and start-ups has been authorised by the UK's Prudential Regulation Authority to operate as a bank, with some restrictions.\r\nGriffin offers access to its suite of BaaS products via its sandbox - which it describes as a free, comprehensive test environment. The sandbox allows users to experiment with Griffin's API, build prototypes of financial products and test drive new features, it said.\r\n“Becoming a bank is testament to the determination of our team, who have been tirelessly building a modern core banking system, a resilient operational backbone and a robust compliance framework, said David Jarvis, CEO and co-founder of Griffin (pictured on the right alongside CTO Allen Rohner). \"This will enable us to deliver an exceptional banking platform for the UK fintech community.”\r\n\r\nNow it is registered as a bank, Griffin can hold a limited amount of deposits and carry out a limited amount of payment services. Griffin said it will continue to work closely with the regulators in building an API-first bank and will also further develop its systems and controls.\r\n\r\nGriffin will begin working with a select group of customers - including Liberis, an embedded finance platform, who will receive early access to its BaaS products and provide valuable feedback as the bank prepares for general availability.", "https://www.qa-financial.com/articles/cloud-businesses-sentia-and-inspirage-acquired-by-accenture": "Sentia, the cloud consultancy with delivery services for hybrid and multi cloud services, including transformation and cloud migration, has sold its Dutch, Belgian, and Bulgarian arms to Accenture. The sales will see 300 of Sentia’s cloud specialists moving to Accenture's ‘Cloud First’ services group.\r\n\r\nRoy Ikink, lead for Accenture Cloud First Netherlands, said, “The acquisition of Sentia’s business in the Netherlands, Belgium and Bulgaria enhances our capabilities in Europe, particularly around hybrid cloud and sovereign cloud. The Sentia team’s experience in this area will be invaluable in helping clients to address regional data privacy regulations.”\r\n\r\nAccenture has also recently announced plans to acquire Inspirage, another company providing cloud services. Focusing on Oracle technology, Inspirage provides tools for supply chain transformation and its in2Cloud service combines a series of tools, including enterprise data management, implementation tools and test automation for Oracle’s ERP/SCM Cloud. Accenture said the acquisition will bolster its Oracle Cloud capabilities.\r\n\r\nThese acquisitions have come in a time of high energy, with Accenture completing three other acquisitions since the start of September, matching its monthly average for acquisitions in just over a week.\r\n\r\nDate\r\n\tCompany\r\n\tShort Description\r\n\tAcquisition type\r\n08/09\r\n\tThe Beacon Group\r\n\tGrowth strategy consultancy\r\n\tComplete\r\n06/09\r\n\tInspirage\r\n\tOracle Cloud supply chain specialist\r\n\tAnnounced\r\n02/09\r\n\tSentia\r\n\tCloud transformation and migration\r\n\tComplete\r\n01/09\r\n\tMacGregor Partners\r\n\tDigital supply chain consultancy\r\n\tComplete\r\n01/09\r\n\tCarbon Intelligence\r\n\tClimate change strategy\r\n\tComplete", "https://www.qa-financial.com/articles/smartbear-releases-visualtest-for-image-based-testing": "SmartBear, the Massachusetts-based test automation specialist, has released VisualTest, its AI-powered automated regression testing tool for visual defects.\r\n\r\nUsing an AI-based comparison engine to highlight inconsistencies, VisualTest delivers component-level visibility alongside automation processes for CI/CD, providing developers and testers with visual accuracy and scalable test automation. \r\nSmarBear claims that VisualTest ‘essentially replicates the human eye’ and is able to ignore false positives while highlighting key differences not always detected through traditional functional or end-to-end testing. This is achieved through its AI engine which tracks several types of visual changes, allowing developers to focus only on important differences.\r\nTouting compatibility with Cypress, Selenium Python, and Selenium Java, VisualTest also integrates with SmartBear’s mobile and web application testing solution, BitBar, to reduce context switching between visual, web, and real-device testing. Bitbar includes access to a device cloud for testing across multiple devices and platforms.\r\n“Customer experience is critical for online businesses, especially now in a fiercely competitive environment. With frequent software updates common for SaaS and e-commerce companies, visual changes happen often and errors can frustrate users,” said Joanna Schloss (pictured), Senior VP Product Marketing at SmartBear. “SmartBear is excited to launch our AI-powered VisualTest solution [...], enabling developers to automate visual regression tests and correct problems before they get to the end user.”", "https://www.qa-financial.com/articles/quality-engineering-for-finance-a-1-trillion-market-": "Quality engineering for finance: a $1 trillion market", "https://www.qa-financial.com/articles/tech-mahindra-launches-remote-testing-platform": "Indian headquartered technology provider Tech Mahindra has showcased SANDSTORM, a recently launched real-time remote testing platform, at the Mobile World Congress 2023 in Barcelona. The company says that the platform will allow customers to remotely test and deploy applications and devices, enabling them to understand how apps interact globally in real-time.\r\n\r\nAt the launch, global head of digital engineering services at Tech Mahindra Rohit Madhok (pictured) said “SANDSTORM's intuitive design interface and easy-to-use tools, will enable our customers to quickly set up, run applications and gain valuable insights that were previously unattainable remotely and in real-time”.", "https://www.qa-financial.com/articles/australia-to-digitise-regulatory-framework": "The Australian Prudential Regulation Authority (APRA) has published an information paper describing the modernisation of its prudential architecture through a series of key initiatives. The modernisation programme, which began last year, is intended to increase regulatory stability around emerging technologies over the coming years.\r\n\r\nThe key initiatives set out include improving regulation, ensuring guidance is more streamlined and easier to implement, a ‘digital first’ approach that will explore how to apply supervisory technology (suptech) and regulatory technology (regtech) to support regulation, and a new approach to regulating new risks and business models resulting from emerging technologies.\r\n\r\nIntroducing the paper, Wayne Byres, who chairs APRA, said: “Our end-goal is a digital framework that will be easier for industry to understand and comply with, and for APRA to supervise and maintain – and ultimately to better protect Australians’ financial interests.” \r\n\r\nPointing to the increased adoption of regtech, such as compliance automation through machine readable regulation, the ‘digital first’ approach aims to ease the navigability and accessibility of the prudential framework for programmers through the use of a standard that supports regtech and governance, risk and compliance (GRC) systems.\r\n\r\nTo diminish the risks presented by emerging technologies, such as crypto-assets and blockchain technology, alongside new business models on the perimeter of prudential regulations like banking-as-a-service, the APRA intends to develop an integrated approach to regulation, enhancing existing regulations as opposed to creating new ones.\r\n\r\nThe need for digitisation arises from the complexity of the APRA’s existing architecture, which has expanded since its genesis in 1998. “With 140 prudential standards and prudential practice guides now covering the five APRA-regulated industries – as well as letters, information papers and FAQs – the framework has become more complex, and in turn more challenging for entities to follow,” Byres said. “We need to ensure the framework is clear, simple and adaptable, to continue to be effective in setting minimum standards for banks, insurers and superannuation funds as technology, business models and community expectations change.”\r\n\r\nMeanwhile, the Monetary Authority of Singapore (MAS) has also released a map outlining plans for transformation through to 2025, though with a focus on digitising financial infrastructure, rather than its own architecture.\r\n\r\nThe release and related speech discuss plans to promote the development of digital infrastructure and platforms, namely the creation of a central funds settlement utility which would centralise data flows for subscription, redemption, and general record-keeping, and facilitate reconciliation of fund data flows with the goal of reducing settlement time and improving efficiency. The release also outlined plans to deepen industry capabilities in Web 3.0, artificial intelligence, and green FinTech.\r\n\r\n[Photo credit: Australian Prudential Regulation Authority]", "https://www.qa-financial.com/articles/sustainableit-org-release-esg-impact-standards": "SustainableIT.org, the nonprofit organisation focussed on advancing sustainability through technology leadership, has announced the release of its IT standards for environmental, social and governance sustainability. \r\n\r\nSustainable IT is backed by executives from financial firms including Paribas, Morgan Stanley and Allstate, as well as technology vendors such as Delphix, the DevOps data management specialist. The new standards are designed to cover around 100 different impacts of IT, including metrics for data centre energy consumption, hybrid workforce enablement, cloud-hosted working, technology accessibility and inclusivity, sustainability training and AI bias reduction\r\n\r\nIn the press release of their standards, SustainableIT.org claimed that IT’s share of carbon emissions had increased 2.5x since 2007, and that the training of a single AI model emits as much carbon as five average cars over their total lifetime.\r\n\r\nAmong recent software testing initiatives designed to help firms benchmark ESG impacts; Paris-headquartered company CAST Software launched its Green Software Insights platform earlier this year. The platform analyses code repositories and identifies inefficiencies which cause excessive energy consumption and have scope for optimisation. CAST claims that this results in: “Lower energy expenditure and greenhouse gas emission with more economical, resilient, and efficient software.”\r\n\r\nMeanwhile, at the QA Financial Forum New York in May, Aaron Jensen, senior manager solutions engineering and DevOps advisor at Delphix, outlined a case-study example in which a Delphix client had been able to generate additional development, testing and QA environments with the Delphix platform without the need for increased storage. The result was equivalent to a reduction of the requirement for cloud storage of 7296 Tb, which in turn equated to a carbon saving of 276 tonnes of CO2 equivalent.\r\n\r\n[Image Source: SustainableIT.org]", "https://www.qa-financial.com/articles/nexi-mandates-ibm-for-transformation": "Nexi, the specialist Italian ‘paytech’ bank, announced plans to use IBM to modernise its core payments processing system in a five year agreement that includes the adoption of hybrid cloud infrastructure.\r\n\r\nNexi’s client base includes more than 1,000 financial institutions and more than two million merchants.\r\n\r\nCiting the increase in customer demand for digital banking services, alongside regulatory and\r\ncompliance requirements, Nexi’s business strategy is to evolve its technology platform to a hybrid cloud architecture. \r\n\r\n\"The agreement with IBM is part of our infrastructure modernisation plan and allows us to improve operational efficiency and drive innovation while offering higher levels of resilience and security to respond even more effectively to the ever-increasing needs of customers,\" said Giuseppe Dallona, CIO of Nexi Group (pictured).\r\n\r\nThe modernization will focus on transforming Nexi's core technology infrastructure that sits at the heart of its business as the foundation for operations and digital payment services, upgrading mainframes to IBM’s z16 system. With the resulting increase in transaction speed and general improvements, Nexi claims it may see a reduction in infrastructure energy consumption by 25% and heat dispersion by another 25%.\r\n\r\nIBM claims its z16 mainframes used in this transformation are a ‘quantum-safe’ system, utilising specialist cryptography in their underlying processors to protect data against future threats that could evolve with advances in quantum computing alongside existing threats. \r\n\r\nUnder the agreement, IBM will work closely with Nexi to provide the technologies and to add its expertise needed to support improved efficiency of the group's digital payments services and growth of its workloads.", "https://www.qa-financial.com/articles/regulation-round-up-march": "Here is our regulatory round-up for March:\r\n\r\nEU prepares technical standards for DORA\r\n\r\nAt a Rome conference organised by CONSOB - the Italian securities market regulator, European Securities and Markets Authority chair Verena Ross provided an update on the progress of the EU Digital Operational Resilience Act (DORA).\r\n\r\nSupervisory authorities of EU member nations are jointly drafting technical standards which will bring “the technical precision needed for the new rules to operate as effectively as possible” she said.\r\n\r\nRoss added “DORA sets stretching deadlines for the ESAs [European Supervisory Authorities]  to issue these technical standards, which is why we are working so intensively from the outset. A still greater challenge will be to implement DORA once it enters into application, to make the EU financial sector more secure and resilient”.\r\n\r\n“The industry and we as their supervisors will have to adapt to many new practices and rules, and we will have to integrate DORA oversight into the existing supervisory processes. In addition, given the fast-changing nature of digital innovation, we will continually need to ensure we have the right supervisory skills for the job”.\r\n\r\nThe EU Digital Operational Resilience Act came into force on January 16th this year and will apply from January 17th, 2025.\r\n\r\nThe full speech from the CONSOB conference is available here.\r\n\r\n\r\n\r\nDigitalisation monitoring survey launched\r\n\r\nThe European Insurance and Occupational Pensions Authority (EIOPA) has launched a Digitalisation Market Monitoring Survey which it says is intended to: “Monitor the development of European insurers’ digital transformation strategies and better understand how undertakings use or plan to use innovative business models and technologies”.\r\n\r\nEIOPA says it hopes to gain insight on the use and level of deployment of technological innovation in the European insurance sector, as well as the governance measures that insurers are adopting around them.\r\n\r\nThe survey is open until June 30th, 2023 and is available here.\r\n\r\nEuropean Risk Board encourages cyber testing\r\nIn a recent report titled Advancing Macroprudential Tools for Cyber Resilience, the European Systemic Risk Board (ESRB) has encouraged member states to adopt its cyber resilience scenario testing (CyRST) tool which it claims can help assess the degree to which: “The financial system can swiftly and efficiently respond to and recover from a severe but plausible cyber scenario that causes significant disruption and could affect financial and operational stability”.\r\n\r\nThe ESRB claims that the new CyRST tool bridges a gap in the current analytical toolkit that can be used to assess operational resilience in the face of a cyber scenario. It says that CyRST can provide such insight by: “Designing a hypothetical cyber scenario and asking participating firms to document the scenario’s impact, how they would respond to and recover from it, and the extent to which key economic functions could continue to operate under the scenario”.\r\n\r\n“The test is used to evaluate the overall impact of the scenario on financial and operational stability and to identify areas where further work is required to mitigate risks”.\r\n\r\nFull report available here.\r\n\r\n\r\nReserve Bank of India suggests self-regulation for FinTechs\r\n\r\nShri M K Jain, Deputy Governor of the Reserve Bank of India has has suggested Indian FinTechs create a self-regulatory organisation.\r\n\r\nIn a recent speech he warned against both a regulatory regime that was too “hands-off” in its approach to FinTechs, as well as one in which: “Fintech product and services are regulated in the same way as the traditional financial product or service”. Instead, he proposed that the Indian FinTech sector should: “Attempt to organise itself under a self-regulatory organisation which in turn can monitor the conduct of member FinTech entities”.\r\n\r\nThis body should stick to three key principles to ensure customer protection, Jain added:\r\n\r\nDesign customer-centric products that avoid passing fintech induced losses on to customers.\r\nEnsure customer suitability and appropriateness, by refraining from mis-selling or imprudent lending.\r\nAddress any inherent biases present in models in a fair manner.\r\n\r\nThe full speech is available here.", "https://www.qa-financial.com/articles/regulation-round-up-april": "FCA offers regulation overview, launches resilience survey\r\n\r\n\r\nJessica Rusu, chief data, information and intelligence officer at the UK financial services regulator, the Financial Conduct Authority (pictured) outlined the FCA’s  views on the impact of recent technology developments on the UK financial sector. \r\n\r\n\r\nIn a speech last month, she said the key questions firms are asking of the FCA are: how it is reducing the burden of compliance and how it is aligning the UK with other international regulatory regimes, and how the FCA is using its database. \r\n\r\n\r\nRusu said: “As a tech leader, I am convinced more than ever before that the answers to these questions rest with innovation, AI and digitally enabled regulation.  She highlighted the FCA's new digital sandbox which will support businesses in the development of proofs of concept for products and services and its provision of a “single point of entry” for firms to engage with its Innovation Services team. Full speech available here.\r\n\r\n\r\nThe FCA has also announced the launch of an operational resilience survey designed to help to identify third parties that are critical to the UK financial sector, and evaluate the benefits and risks involved for financial firms.\r\nThe survey, launched in conjunction with the Bank of England, is part of a larger project focussed on operational resilience and the role of third parties in the UK financial sector, and follows a discussion paper published in July 2022 (available here).\r\n\r\n\r\nFull article available here.\r\nEuropean Systemic Risk Board publishes cyber report\r\nThe European Systemic Risk Board (ESRB), which is responsible for the macroprudential oversight of the EU financial system, has published a report on the development of tools for cyber resilience. \r\n\r\nThe report identifies cyber incidents as a risk to financial stability and it proposes the following measures:\r\n\r\nThe EU-wide adoption of the ESRB’s cyber resilience scenario testing tool (CyRST)\r\nDevelopment of systemic impact tolerance objectives (SITO) to assess the amount of disruption that the EU financial system can absorb\r\nImprovement of the effectiveness of existing financial crisis management tools\r\n\r\nFull report available here.\r\n\r\nPrashant Bhardwaj to head OCC’s new Office of Financial Technology\r\n\r\nThe US Department of the Treasury bureau that supervises the banking sector, The Office of the Comptroller of the Currency (OCC), has appointed Prashant Bhardwaj to lead its Office of Financial Technology.\r\n\r\n\r\nThe creation of the Office of Financial Technology was announced in October 2022 as an expansion of the existing Office of Innovation, which the OCC claims will: “Bolster the agency’s expertise and ability to adapt to the rapid pace of technological changes in the banking industry”.  \r\n\r\n\r\nFull article available here.\r\nMAS hosts financial sector cloud forum\r\nThe Monetary Authority of Singapore (MAS) hosted its inaugural Financial Sector Cloud Resilience Forum for Cloud Service Providers earlier this month, providing a platform for discussion on cloud risk management practices for the financial sector. The Forum was attended by senior financial regulatory authority figures, as well as representatives from Amazon Web Services (AWS), Google Cloud and Microsoft Azure.\r\n\r\nMAS published three key takeaways from the forum:\r\n\r\nAdoption of public cloud services by financial institutions is increasing.\r\nFinancial Institutions require assistance from cloud service providers to achieve operational resilience.\r\nThe sharing of information between financial firms and cloud service providers is critical.", "https://www.qa-financial.com/articles/prashant-bhardwaj-to-head-occ-s-new-office-of-financial-technology": "The US Department of the Treasury bureau that supervises the banking sector, The Office of the Comptroller of the Currency (OCC), has appointed Prashant Bhardwaj to lead its Office of Financial Technology.\r\n\r\nThe creation of the Office of Financial Technology was announced in October 2022 as an expansion of the existing Office of Innovation, which the OCC claims will: “Bolster the agency’s expertise and ability to adapt to the rapid pace of technological changes in the banking industry”.  \r\n\r\nBhardwaj will lead the office, taking on the roles of Deputy Comptroller and Chief Financial Technology Officer, after almost 30 years working across the financial sector. He will be responsible for overseeing the analysis and evaluation of trends in financial technology, potential risks and the implications for OCC supervision.\r\n\r\n[Image Source: Wall Street Journal]", "https://www.qa-financial.com/articles/the-qa-financial-100-": "The QA Financial 100 is a complete and detailed directory of the industry leaders in test automation and other DevOps technologies and will be a key resource for heads of software engineering and QA.\r\nIn this 40-page guide - available as a downloadable PDF - we have produced comprehensive profiles on the 100 leading vendors of software quality management services, detailing: \r\nThe tools they offer and their core business focus\r\nThe details of recent corporate activity, including M&A activity, ownership changes and major new PE and VC investments. \r\nHow will the QA Financial 100 help my business?\r\nThis is a go to guide of 100 vendors which will help you compare and save you time whilst looking for test automation and other DevOps technology partners. \r\nWhile the QA Financial 100 directory comprises the bulk of the guide, we also provide 11 pages of our authoritative editorial insight in detailed chapters covering:\r\nThe compliance drivers for digital change and new standards for software management at financial firms. One focus here is the European Union’s Digital Operational Resilience Act (DORA),which is likely to come into force in 2024.\r\nA review of five key technology trends that we believe will be critical for software quality assurance and DevOps for financial firms in 2023. For example: the technology behind low-code development and visual testing.\r\nOur overview of the vendor market, evaluating the key trends in M&A over the past 12 months, and the impact of consolidation of tooling by financial firms.\r\nHow are the 100 vendors chosen?\r\nWe’ve based our selection of the 100 worldwide on conversations with leaders in software development and quality management at leading banks, insurance companies, asset managers, fintechs and other financial services firms. We’ve also added a section on seven ‘rising’ star firms - all relatively new, with one founded as recently as 2020 - and which we believe will be worth watching for progress over the coming year.\r\nThe QA Financial 100 will be reviewed and published annually. Information is right up-to-date for 2023.\r\nWhat are the QA Financial 100 vendor categories?\r\nThe QA Financial 100 vendors are broken down into five key categories, the largest of which is composed of firms that specialise in providing automated software testing and QA tools. We explain what these tools do. We also have categories for larger software firms that offer QA services; for systems integrators and consultants that offer QA and testing services, for code software companies with test automation tools and QA services, accessibility specialists; for specialists in code quality management, test data management and accessibility testing.\r\nHow much does the QA Financial cost?\r\nThe QA Financial 100 is offered at £300 (inclusive of VAT) for the first 100 buyers. ", "https://www.qa-financial.com/articles/european-rules-on-digital-resilience-for-2024": "The European Commission's draft Digital Operational Resilience Act (DORA) is likely to come into force in 2024. DORA's sanctions for firms whose digital services are disrupted are expected to include fines of 1% of annual turnover for firms whose software fails avoidably - including software supplied by third-party vendors. \r\n\r\nBut according to new research published by Expleo, the leading IT services vendor and software testing specialist, employing QA Financial as its research partner, awareness of DORA among financial firms is low. \r\n\r\nAccording to the report - titled \" Digital Operational Resilience - The New Heart of Operational Risk\" - just 53% of firms surveyed recognise digital operational resilience as a distinct risk category and only 20% were aware of DORA and its likely provisions.\r\n\r\n\"Complacency around regulatory compliance [with DORA] will be the single biggest self-inflicted wound for enterprises,\" concludes the report.\r\nOne key conclusion is that financial firms should ensure they are setting uniform  software quality standards for their third-party vendors, rather than allowing them to self-certify.\r\n\r\nThe report also found that financial firms that have technology specialists on their board have far higher levels of awareness of the challenges of digital resilience.", "https://www.qa-financial.com/articles/fca-launches-synthetic-data-expert-group": "The Financial Conduct Authority is recruiting members for its new Synthetic Data Expert Group, a sub-group of its recently launched Innovation Advisory Group. The group will work to clarify issues and develop best practice relating to the use of synthetic data in UK financial markets.\r\n\r\nThe FCA says its motivation to investigate the use of synthetic data and its potential to enable the sharing of data while respecting privacy requirements was one result of its experience running its previous Digital Sandbox pilots and TechSprint programmes. That experience highlighted the difficulties that financial firms faced relating to the access and sharing of data. \r\n\r\nThat initiative led to a March 2022 call for input from financial firms on the benefits and limitations of synthetic data, followed by the launch of the Synthetic Data Expert Group and a joint industry-academic roundtable in partnership with the Information Commissioner's office and the Alan Turing Institute. The roundtable discussion focused on the challenges of validating synthetic data, which will result in the publication of a paper detailing any findings.", "https://www.qa-financial.com/articles/tricentis-releases-testim-mobile": "Tricentis, the test automation specialist, has expanded its UI testing solution to include mobile testing capabilities.\r\n\r\nTestim is Tricentis’ AI-based SaaS platform for UI testing for web applications, supporting codeless test authoring, device management and emulation, and cloud-based application testing. Testim was acquired by Tricentis in February 2022 and has since become a key tool alongside their flagship test automation platform, Tosca.\r\n\r\n“Ever-changing consumer expectations require organisations to frequently evolve their mobile applications, risking challenges due to a variety of operating systems, unstable network connections, geo-location capabilities, and more,” said Suhail Ansari, CTO at Tricentis (pictured). “As more mobile-first companies enter the market, organisations must ensure high performance, functionality, and usability for their apps to be successful.”\r\n\r\nThis update brings native mobile application testing to the platform, easing the creation of mobile tests, particularly iOS testing from windows devices, Tricentis claims.", "https://www.qa-financial.com/articles/tsb-fined-48-65m-fine-for-resilience-failings": "TSB has agreed to pay a £48.65m fine from the Financial Conduct Authority (FCA) and the Prudential Regulation Authority (PRA) for operational risk management and governance failures, including management of outsourcing risks, relating to the bank’s IT upgrade programme in 2018.\r\n\r\nIn April 2018, TSB underwent a migration of its core IT platform for corporate and customer services - covering critical banking functions and data - to match that of its Spanish owner Sabadell Bank. While the data itself migrated successfully, the platform immediately experienced technical failures. \r\n\r\nThis resulted in significant disruption to the continuity of TSB’s banking services, including branch, telephone, online and mobile banking, which only stabilised after eight months, in December of the same year. The initial disruption affected all branches of the bank and ‘a significant proportion’ of its then 5.2 million customers, the FCA reported. TSB has already paid out £32.7m in redress to customers who suffered detriment.\r\n\r\nAn IBM report released two months after the migration found the management's lack of understanding of the containerization technologies it was trying to implement as partly to blame.\r\n\r\nRegulators have since found that TSB failed to organise and control the IT migration programme adequately, and it failed to manage the operational risks arising from its IT outsourcing arrangements with its critical third-party supplier. \r\n\r\n“The failings in this case were widespread and serious which had a real impact on the day-to-day lives of a significant proportion of TSB’s customers, including those who were vulnerable,” said Mark Steward, executive director of enforcement and market oversight at the FCA  (pictured). “The firm failed to plan for the IT migration properly, the governance of the project was insufficiently robust and the firm failed to take reasonable care to organise and control its affairs responsibly and effectively, with adequate risk management systems.”\r\n\r\nSam Woods, CEO of the PRA, said: “The PRA expects firms to manage their operational resilience as well as their financial resilience. The disruption to continuity of service experienced by TSB during its IT migration fell below the standard we expect banks to meet.”\r\n\r\nTSB was issued a total fine of £69,500,000, however, as it agreed to resolve the matter with the FCA and PRA, a 30% discount in the overall penalty imposed by both regulators was applied, reducing the fine to £29,750,000 by the FCA and £18,900,000 by the PRA.", "https://www.qa-financial.com/articles/-new-kid-testing-firms-in-vc-funding": "It’s been a busy few weeks for emerging players in the software testing marketplace. This review captures some of the most interesting recent venture capital funding rounds - including completed deals for accessibility testing specialist Evinced, mobile app tester Mobot and low-code platform Retool.\r\n\r\nAccessibility testing has become increasingly important because of the requirement under the US Americans with Disabilities Act that websites are treated as public spaces, and therefore must not discriminate against customers with disabilities.\r\n\r\nMeanwhile, the World Wide Web Consortium (W3C), an industry organisation, is close to announcing version 2.2 of its international Web Content Accessibility Guidelines (WCAG). WCAG 2.2 is expected to become a “Candidate Recommendation” by September 2022, according to the W3C, meaning it has met consensus and satisfies technical requirements for full adoption for adoption later this year. The largest change from 2.1 includes adding accessible authentication steps around multi factor authentication and the explicit allowance for mechanisms like password managers.\r\n\r\nAccessibility specialist Evinced raised $38m in a series B funding in June, led by Insight Venture Partners. Evinced was founded in 2018 by Navin R. Thadani and Gal Moav, two former Oracle executives based in Palo Alto and Israel respectively. Evinced launched its web and mobile accessibility testing solutions in 2021. The platforms scan user flows to identify problems for screen readers and keyboard-reliant users (those who cannot use mice alongside their keyboard) through the use of a system of advanced code analysis, which Evinced claims can catch problems overlooked by static syntax checks.\r\n\r\nAnother accessibility testing firm, Stark has recently secured a $6m seed led by Uncork Capita and yet another, Assistiv Labs, raised a $1m pre-seed led by Zenda Capital.\r\n\r\nMobile app testing firms have seen demand boosted by the Covd pandemic. New York-based Mobot claims to be unique in its testing process, using robots to physically test applications on real mobile devices. Mobot says its platform can enable the automation of tests that cannot be completed by emulators. In August, Mobot completed its series A funding round of $12.5m, led by Cota Capital.\r\n\r\nSofy, a no-code mobile test automation platform, received $7.75 in seed funding, led by Voyager Capital. Founded in 2016 and headquartered in Washington state, Sofy enables manual and no-code automated testing of mobile apps and websites.\r\n\r\nTwo firms specialising in low-code development tools have also raised funding.One is Retool, which uses a base of 90 development components to allow for the quick construction of internal applications. CEO and co-founder David Hsu described this process as being able to cut coding down to: “the last 20% or 30%” of the work on any project.\r\n\r\n“Retool sits at the intersection of two major trends: the rise of the developer and the increasing importance of operational excellence after a pandemic that compressed a decade of digital transformation into two years,” said Bryan Schreier, a partner at Sequoia Capital, the firm leading the $45m series C investment.\r\n\r\nFounded in 2021, Superblocks provides the building blocks for quickly spinning up internal tools and APIs, utilising a library of popular components to reduce the need for skills in languages such as React, HTML or CSS. Superblocks completed $37m in funding from Kleiner Perkins, Greenoaks, Spark and Meritech in mid-August.\r\n\r\nOther recent investments include Cloud optimiser, Sync Computing, landing $12m in funding led by Costanoa Ventures, and Massdriver, a cloud architecture platform for DevOps receiving a $4m seed from Y Combinator.\r\n\r\nFirm\tRound\tAmount\tDate\tFirm Type\r\nMassdriver\tSeed\t$4m\t19 August\tCloud architecture for DevOps\r\nSofy\tSeed\t$7.75\t17 August\tNo-code mobile test automation\r\nSync Computing\t -\t$15.5m\t16 August\tCloud optimisation\r\nMobot \tSeries A\t$12.5m\t15 August\tMobile testing\r\nSuperblocks\t -\t$37m\t11 August\tLow-code internal tools\r\nStark\tSeed\t$6m\t10 August\tAccessibility testing\r\nRetool Inc \tSeries C\t$45m\t28 July\tLow-code internal tools\r\nAssistiv Labs\tPreseed\t$1m\t13 July\tAccessibility testing\r\nEvinced\tSeries B\t$38m\t23 June\tAccessibility testing", "https://www.qa-financial.com/articles/exactpro-testing-smooths-wealthos-release": "WealthOS, a cloud-native SaaS platform for digital wealth management operating systems, has been released as a freely available sandbox environment. The release follows comprehensive testing by Exactpro, the test automation specialist for complex financial markets.\r\n\r\nUsing th2, Exactpro’s core testing framework for transaction processing systems, the two firms have developed a model-based test library covering end-to-end scenarios, conducted functional touch testing of the platform features, and developed third-party simulators.\r\n\r\nAlexey Zverev, co-CEO and co-founder of Exactpro, said: “The variety of the platform's features and integrations gives room to apply different testing solutions. We have been able to match the complexity of the platform's cloud-native architecture with a cloud-native test framework and a bespoke set of industry-proven test method capabilities. This has ensured swift test execution and extensive test coverage.\"\r\n\r\nThe platform is being released as a modular sandbox, allowing for firms of any size to experiment with ideas for a range of wealth management applications, such as digital investment platforms. While the sandbox environment supports free development and testing of ideas, WealthOS offers paid plans for full projects which include access to single-client cloud environments and custom integration support.\r\n\r\nThe environment contains a range of features,including order management, payments, KYC/AML and portfolio management and rebalancing components along with the tools to design and test solutions. There is also a range of APIs for integration into payment systems and data providers.\r\n\r\nAnton Padmasiri, CEO and founder of WealthOS (pictured), said: “Our sandbox significantly reduces entry barriers by allowing users to create and test fully-functioning prototypes ahead of seeking internal approvals or external funding. Moreover, users, from large enterprises to startups, can rest assured that they’ll be experimenting with a reliable and safe platform that has met robust testing by Exactpro.”", "https://www.qa-financial.com/articles/how-virtualization-accelerates-software-delivery": "Our research shows development shortened by 40% with virtualization technology\r\n\r\n\r\n\r\n\r\nA research report produced by QA Financial’s research team and based on results from Bank of America and ING benchmarked against a broader set of data provided by financial firms, has found that test virtualization technology can reduce software development times by up to 40%.\r\n\r\n\r\n\r\nThe research was based on a study conducted with the DevOps teams at Bank of America and ING, and was produced in partnership with Parasoft, the California-based, automation vendor whose product suite includes Parasoft Virtualize.\r\n\r\n\r\n\r\nThe white paper describing the research can be downloaded free here.\r\n\r\n\r\n\r\nWhile the technology of test virtualization - replicating or emulating software, systems and data in order to test more quickly and consistently - is well-established, even some of the largest international banks have yet to establish its true value in terms of the RoI it delivers against up-front costs and longer-term maintenance costs.\r\n\r\n\r\n\r\nWe believe the report is a significant step forward in describing the benefits of virtualization, as financial firms seek to increase software release velocity and subsequent speed to market. Our research found that three elements are critical to success: test service virtualization, test data preparation, and an effective integration between micro-services and components. \r\n\r\n\r\n\r\nBut while achieving these goals is one challenge; proving their benefits with clear benchmarks is another. For this, our research drew on data compiled by QA Vector Analytics from 20 leading financial firms, which benchmarks the effectiveness of those firms’ software quality management processes. (You can read more about QA Vector Analytics here.) \r\n\r\n\r\n\r\nWe then took a deep-dive with Bank of America and ING into some of the specific quality assurance challenges they are facing as they continue their transition to continuous integration and deployment (CI/CD), and why they are looking to service virtualization and Parasoft to accelerate that transformation.\r\n\r\n\r\n\r\nProviding on-demand test environments for complex interfaces between services was previously a bottleneck for ING, for example. Simplifying the service environment with the support of Parasoft Virtualize allowed ING to create credible test environments for its teams and containerized versions for vendors whenever required, said Raymond Smit, IT Chapter Lead at ING.\r\n\r\n\r\n\r\n“It was always very difficult to do your tests on time. We simulated the test environments in a simple way, but it’s not the live situation. We came to Virtualize so we could record the behavior of each interface and have a stable test environment” said Smit, in an online interview you can see here.\r\n\r\n\r\n\r\nThe transition from monolithic services to chains of microservices makes test data generation another complex challenge. According to Istiak Ahmed, SVP and Software Quality Assurance Manager, at Bank of America, this requires a deep understanding of upstream data filtration - if data is selected manually. \r\n\r\n\r\n\r\nWhen Bank of America switched to test virtualization, the time spent on test data management was reduced by 50%, said Istiak Ahmed.\r\n\r\n\r\n\r\nOur research paper also covers other bottlenecks common to release management; for example the typical requirements for UI testing, which often force teams to wait until development is complete, creating tests that are volatile and difficult to maintain. Service virtualization allows teams to begin testing on partially built systems, shifting testing left.", "https://www.qa-financial.com/articles/overcoming-software-development-testing-challenges-in-banking-finance": "Overcoming Software Development & Testing Challenges in Banking & Finance", "https://www.qa-financial.com/articles/european-council-adopts-digital-operational-resilience-act": "The Council of the EU has passed its final legislative step in adopting the Digital Operational Resilience Act (DORA). \r\n\r\nDORA creates a regulatory framework on digital operational resilience whereby all firms and their third parties need to make sure they can withstand, respond to and recover from all types of digital disruptions and threats, with a focus on mitigating cyber threats. \r\n\r\nResearch completed on behalf of Expleo by QA Financial has found that only 53% of firms surveyed recognise digital operational resilience as a distinct risk category and only 20% were aware of DORA and its likely provisions.\r\n\r\nThe Commission came forward with the DORA proposal on 24 September 2020. Formal trilogues between the co-legislators started on 25 January 2022 and ended in a provisional agreement on 10 May. This adoption is the final step in the legislative process.\r\n\r\nDORA sets uniform requirements for the security of network and information systems of companies and organisations operating in the financial sector as well as critical third parties which provide IT-related services to them, such as cloud platforms or data analytics services. \r\n\r\n“Banks and other companies which provide financial services in Europe already have plans in place for their IT security, but we need to go one step further,” said Zbyněk Stanjura, minister of finance of the Czech Republic (pictured). “Thanks to the harmonised legal requirements which we adopted today, our financial sector will be better able to continue to function at all times. If a large-scale attack on the European financial sector is launched, we will be prepared for it.”\r\n\r\nSimilar legislation was introduced in UK Parliament in July, setting out proposals to ensure the resilience of critical third parties to the British financial industry. The Financial Services and Markets Bill is expected to be debated in the House of Lords in January after a series of amendments in November.\r\n\r\nNow that the DORA proposal is formally adopted by the European Council, aspects that require national transposition will be passed into law by each EU member state. At the same time, the relevant supervisory authorities, such as the European Banking Authority (EBA), the European Securities and Markets Authority (ESMA) and the European Insurance and Occupational Pensions Authority (EIOPA), will develop technical standards for all financial services institutions to abide by. The respective national competent authorities will take the role of compliance oversight and enforce the regulation as necessary.\r\n\r\n\r\n[Image copyright: European Union]", "https://www.qa-financial.com/articles/micro-focus-share-price-doubles-as-opentext-agrees-to-buy": "Shares in MicroFocus, the UK software company that owns the leading testing and development tools UFT and ALM, have doubled following the announcement of an agreed acquisition bid by Ontario-based software firm OpenText.\r\n\r\nFounded in 1976, Micro Focus was at one stage the clear global leader in software test automation, though it has faced steadily increasing competition from newer players, such as Sauce Labs and Tricentis. \r\n\r\nIts core test automation platform, Unified Functional Testing (UFT), is designed to accelerate delivery via automation of functional and regression testing under a single tool. Micro Focus completed an $8bn billion acquisition of software management assets from Hewlett Packard Enterprise in 2017. But in March 2018, Micro Focus revealed  the merger was 12 months behind its schedule for delivering value and the company’s share price plunged from a 2017 high of close to £29. While it did see a bounce back in 2019, Micro Focus stock had steadily been declining in value  and was trading at around 268p per share on August 25th when OpenTest made its 532p per share offer.\r\n\r\nWith a history of acquiring legacy products, Micro Focus was labelled by some critics as “The place that software goes to die”. But more recently it released tools for robotic process automation (RPA) and in  2020, Micro Focus released a range of AI improvements to the UFT family of testing products.\r\n\r\nOpenText specialises in cloud solutions, offering enterprise-level information management and business process solutions, alongside digital process automation and a low-code development platform. Its EnCase product covers a range of security services.\r\n\r\n“Upon completion of the acquisition, OpenText will be one of the world’s largest software and cloud businesses with a tremendous marquee customer base, global scale and comprehensive go-to-market,” said OpenText CEO and CTO Mark J. Barrenechea. in the press release. \r\n\r\nBarrenechea further added, “Micro Focus brings meaningful revenue and operating scale to OpenText, with a combined total addressable market of $17bn. With this scale, we believe we have significant growth opportunities [...]. Micro Focus will benefit from the OpenText Business System to create stronger operations and significant cash flows, and Micro Focus customers will benefit from the OpenText Private and Public Clouds.”", "https://www.qa-financial.com/articles/smartbear-hires-vps-to-meet-demand-for-developer-visibility-": "Smartbear, the Massachusetts-based test automation specialist, says it is seeking to bolster its developer visibility strategy by hiring two new senior executives:  Jim Wu as VP of AI and data science and Anthony Bryce as VP of product management.\r\n\r\nWhy is this objective of visibility so important for SmartBear? “With the growing complexity of technology, like public cloud infrastructure and the move to microservices-based applications, it has become increasingly difficult for development teams to problem solve when applications go awry for end users,” said Dan Faulkner, chief product officer at SmartBear.\r\n\r\nJim Wu, SmartBear’s new VP of AI and data science, has more than 14 years of experience with Nuance Communications, a firm developing conversational AI for healthcare and customer engagement, most recently as VP for corporate research.\r\n\r\nMeanwhile Anthony Bryce, SmartBear’s new VP of product management, has over 20 years of product leadership experience, with prior experience at Micro Focus and most recently with BMC Software as director of product management.\r\n\r\n\r\n“With modern observability practices, we can collect data from complex landscapes, and with the right tools, provide deeper and more useful insights on how to efficiently fix and optimise a deployed application,” said Bryce. “Our focus is on adding increasing layers of visibility for developers so they can rapidly iterate and deploy software with increasing confidence whilst ensuring great end user experiences for their customers.”\r\n\r\nSmartBear also appointed Veronica Curran as the company’s new chief people and culture officer in July.", "https://www.qa-financial.com/articles/sonatype-moves-supply-chain-management-to-cloud": "Sonatype, the US-based code quality management vendor, has added cloud access to its supply chain management tools ‘Lifecycle’ and ‘Firewall’, adding to existing on-premises and fully disconnected deployment options to become ‘run-anywhere’, it claims.\r\n\r\nThe Sonatype platform assesses elements across the software development lifecycle (SDLC) to identify critical security vulnerabilities and code quality issues through software composition analysis (SCA) and application security testing (AST). \r\n\r\nUtilising a behavioural AI-driven component firewall, the platform can automatically block malicious malware from entering the SDLC, Sonatype claims. New components are scanned, and the AI acts to quarantine known malicious files and pass suspicious components to the Sonatype research team for review before entering the pipeline.\r\n\r\nThe platform also provides security policy automation with instant feedback at all stages of the development process with the intention of allowing developers to correct vulnerabilities early.\r\n\r\nWith cloud deployment, customers can protect their software supply chains without needing to deploy and manage infrastructure, making it suitable for organisations looking to streamline their infrastructure and rapidly scale.\r\n\r\nAlongside the cloud and on-premises solutions, the Nexus Disconnected Environment (NDE) is an open source and dependency management solution available for air-gapped environments, which Sonatype claims makes it ideal for government and affiliated organisations that want to manage their open source software supply chains.\r\n\r\n“As the use of open source software in modern applications continues to increase, so does the risk from malware and other vulnerabilities. Software supply chain attacks have jumped an astonishing 742% per year, on average, over the past three years,” said Mitchell Johnson, chief product development officer at Sonatype (pictured). “There has never been a greater need for the ability to detect code quality and implement security at the point of creation.”\r\n\r\n[Image source: Business Wire]", "https://www.qa-financial.com/articles/exactpro-testing-for-kazakh-repo-market": "Exactpro, the UK-based software testing services provider that specialises in financial markets infrastructures has completed testing for the repurchase agreement (or “repo”) market recently launched by the Astana International Exchange (AIX) in Kazakhstan.\r\nExactpro used th2, its cloud-native Kubernetes-driven microservices test automation framework, to complete functional and non-functional testing, the company said\r\n“The importance of factoring in non-functional testing when it comes to building cloud infrastructures cannot be overestimated,” said Pavel Medvedev, head of non-functional testing at Exactpro. “The complexity of a cloud-native architecture is not easy to match.\"\r\nThe testing spanned functional and non-functional testing (NFT) of the platform, including integration with AIX’s central securities depository. The non-functional testing included capacity and daily life cycle testing, scalability, stress and latency testing for order entry and market data streams.\r\nAstana International Exchange (AIX) was established in 2017 and operates public equity and debt capital markets in Kazakhstan and the Central Asian region. AIX had previously worked with Exactpro to migrate its Nasdaq-sourced matching engine to the Amazon Web Services’ (AWS) cloud.", "https://www.qa-financial.com/articles/atlassian-launches-jira-product-discovery": "Atlassian, the Sydney headquartered software company, has announced the open beta launch of its Jira Product Discovery tool, with general availability expected before the end of the first half of 2023.\r\n\r\nThe platform is designed to help teams prioritise and collaborate on new product ideas and sits within the Jira product ecosystem. Atlassian claims that three-quarters of product managers struggle to determine the true value of their product for their customers and therefore product discovery is becoming an essential part of the software development lifecycle.\r\n\r\n“Most software teams already have really good and efficient processes in place for building code, the delivery stage and the operation stage of software development. And we can really thank the widespread adoption of Agile and DevOps and, of course, the number one software development tool, Jira Software, for that,” said Megan Cook, Atlassian’s head of product for its agile solutions (pictured). “But in the discovery phase, it’s a bit of a mess, it’s a lack of structure, it’s not clear what’s going on”.\r\n \r\nThe Jira Product Discovery tool will help to combat this by enabling all team members to suggest, collaborate, provide insight and vote on potential product ideas, said Atlassian. It will also provide native integrations with external research and feedback tools such as internet browsers and customer research platforms.", "https://www.qa-financial.com/articles/benchmarking-software-quality-the-emersion-of-new-metrics": "The benchmarking and development of metrics for the quantification and management of software quality is an area of growing importance for financial firms, as they look to drive improvements in efficiency and respond to increasing regulatory scrutiny from regulations such as the EU’s Digital Operational Resilience Act and the increasingly prescriptive attitudes of the US banking regulator, the Office of the Comptroller of the Currency, and the Monetary Authority of Singapore.\r\n\r\nWe at QA Financial have been monitoring this trend and are looking to survey software quality assurance and testing leads at financial firms to find out more.\r\n\r\nWe invite you to participate in our brief survey and we'll send you a copy of the report based on the results.\r\n\r\nSurvey link: https://survey.zohopublic.eu/zs/8vDHhE", "https://www.qa-financial.com/articles/eu-financial-supervisors-consult-on-dora": "The European Supervisory Authorities (ESAs) - the combined agencies covering the banking, insurance, pensions and securities markets across the EU - have launched a public consultation on the first batch of draft technical standards for the EU’s Digital Operational Resilience Act (DORA). \r\n\r\nThe act, which entered into force on January 16th  2023, aims to enhance the digital resilience of entities across the EU financial sector and will apply from 17 January 2025. The ESAs, which are composed of the European Banking Authority (EBA), the European Insurance and Occupational Pensions Authority (EIOPA) and the European Securities and Markets Authority (ESMA), were tasked with jointly developing 13 policy documents that will form the framework for DORA. \r\n\r\nThe four draft technical standards which have now been released are:\r\n\r\nRegulatory technical standards on ICT risk management frameworks and simplified ICT risk management frameworks, which cover a broad range of concerns including: security, governance, ICT risk management, ICT change management, incident detection and response and outage continuity policies (full document available here).\r\nRegulatory technical standards on the criteria for the classification of ICT-related incidents, which focus on incident response procedure, materiality thresholds, approaches to recurring incidents, economic impact of incidents and data losses (full document available here).\r\nRegulatory technical standards to specify the policy on ICT services performed by ICT third-party providers, covering the provision of critical ICT services by third parties, ex-ante risk assessment and contractual issues (full document available here).\r\nImplementing technical standards to establish the templates for the register of information, which outline the requirements for institutions implementing ICT policy (full document available here). \r\n\r\nThe consultation, details of which can be found here, is open to all interested stakeholders and runs until September 11, 2023.", "https://www.qa-financial.com/articles/how-qa-analytics-demonstrates-roi-for-test-teams": "With QA Vector Analytics (QAVA), test and quality assurance teams can independently benchmark the performance of your development and testing environments and uncover the long term trends of business-level changes, such as the introduction of a testing centre of excellence, or the wide scale adoption of a new vendor tool.\r\n\r\nThe core QAVA scores are execution, spend, and efficiency (a proxy for RoI). \r\n\r\nThrough a weighted scorecard of key indicators, including time and money spent in development, test, and remediation (work in production), alongside development overruns and defect escape rates, QAVA scores hundreds of projects from a customer bank, providing independent feedback on the effectiveness of ongoing schemes.\r\n\r\nIn the example picture, a large bank (anonymised for this example) is shown undergoing a transformation programme that begins in mid-2019. \r\n\r\n\r\n\r\nImprovements to overall project health can be seen almost immediately, but the execution score levels off after a year as project teams begin using their own tools and fall back into old ways that lead to project overruns and higher defect escape rates. By recognising this lull, the transformation team are able to respond and the score begins to increase again.\r\n\r\nThe firm continually improves its spending score, with less spent in testing and remediation than ever before. Combined with the increases in execution score, the average efficiency at the bank has doubled by the end of 2022.\r\n\r\nQA Vector Analytics benchmarks testing teams in efficiency against historical and market data. Contact info@qa-financial.com for more information.\r\n\r\nScores shown are synthetic and for demonstration purposes only.", "https://www.qa-financial.com/articles/hybrid-cloud-a-precondition-for-banks-": "The adoption of hybrid Cloud services is identified in a new report by IBM as a precondition for effective digital transformation. The report, based on interviews with 2,000 banking CIOs and CTOs worldwide and published by the IBM Institute for Business Value (IBV) connects the use of hybrid Cloud to six key practices and capabilities it found were shared by healthier financial firms.\r\n\r\nThe practices include the ability to deploy AI factories for products on the Cloud via sandboxes, end-to-end digitalisation across business units and engaging in partner ecosystems between firms and they are best employed when using a hybrid Cloud, according to IBM..\r\n\r\nAnd there’s a huge potential among banks to accelerate end-to-end digitalisation, the report found, with only 23% of respondents stating their workflows were automated or leveraging AI. The report noted a dramatic improvement in revenue growth when AI, IoT, and robotic process automation were used with a Cloud environment.\r\n\r\nDefining health through a combination of a high return on equity and a low cost to income ratio, the IBM research identified a series of practices shared by the healthiest firms, which it deemed essential for accelerating digital transformation through increased flexibility.\r\n\r\nDiscussing healthier firms, Paolo Sironi (pictured), co-author and global research leader for banking and financial market at IBM, said that firms that were further along in their digital transformation, using tools like hybrid cloud, were able to engage more readily with other banks and to maintain their transformation momentum. “Given their higher comfort with digitalization, they engage more with partner ecosystems to accelerate innovation and banking transformation” Sironi said.\r\n\r\nAmong the executives interviewed, the mean percentage of hybrid Cloud workloads is expected to increase by 18% over the next three years to around one third of all environments used by banks; cloud-based or otherwise.", "https://www.qa-financial.com/articles/anz-explores-generative-ai-for-code-testing": "The Australia and New Zealand Banking Group (ANZ), headquartered in Melbourne, has “formally sanctioned” a team to explore the possible use of generative AI for code testing. As part of the investigation, engineers will also explore other potential use cases for the technology.\r\n\r\nGenerative AI, which utilises large language models to generate new and unique content based on patterns found in training data, has become ever-more prevalent in recent months, since the launch of Microsoft artificial intelligence research lab OpenAI’s ChatGPT tool.\r\n\r\nCommenting on the news, ANZ chief technology officer Tim Hogarth [pictured] said: “We’ve formally sanctioned one team in ANZ to explore generative AI for software engineering to improve our testing. Writing test cases – normally also written in code – is an important, if somewhat tiresome, task\". He continued: “Generative AI is really powerful at reading code and proposing the complete test case to properly exercise that code” ... \"This will dramatically improve unit testing and, I think, give us a step change in identifying bugs and errors earlier in the development process.\"\r\n\r\n[Image Source: ANZ Banking Group]", "https://www.qa-financial.com/articles/test-automation-recommended-by-cyber-security-agencies": "A cybersecurity advisory co-authored by the US Cybersecurity and Infrastructure Security Agency (CISA) alongside cybersecurity agencies from Canada, the UK and Australia, has described the need for at-scale security testing against known vectors of attack, including the Log4j vulnerability identified last December. The CISA has identified Iran as a primary source of recent attacks.\r\n\r\n“The authoring agencies recommend continually testing your security program, at scale, in a production environment to ensure optimal performance against the MITRE ATT&CK techniques identified in this advisory,” the advisory reads.\r\n\r\nMITRE ATT&CK (Adversarial Tactics, Techniques, and Common Knowledge) was launched in 2015 as not-for-profit-led framework outlining known vulnerabilities and attack vectors, and describes the specific techniques used by bad actors that security teams can emulate. The advisory sets out threat vectors, mapped to this framework, from which it recommends evaluating current security coverage.\r\n\r\nIn a discussion with Bloomberg, a CISA official described attacks using threats up to 10 years old. Static application security testing tools can be readily automated to cover many such vulnerabilities. These tools integrate into development pipelines and are able to quickly identify existing vulnerabilities. Feedback from tests in a CI/CD pipeline can help to improve security coverage more permanently.\r\n\r\nCyber security specialist firms like Mandiant - which was acquired by Google this week - offer security and ransomware validation services, where attacks are replicated through repurposed forms of malware in current use. Research by California-based IT security specialist Barracuda found attacks on financial firms had increased by 200% in the last 12 months.\r\n\r\nA recent report by AttackIQ found that the standard endpoint detection tools in its customers’ environments only stopped the top seven adversary techniques 39% of the time, even when fully effective in a lab environment. The cause was found to be insufficient testing, where misconfigurations and infrastructure changes left gaps in defences that could have been caught by a continuous testing method.\r\n\r\nThe advisory, titled - ‘Iranian Islamic Revolutionary Guard Corps-Affiliated Cyber Actors Exploiting Vulnerabilities for Data Extortion and Disk Encryption for Ransom Operations’ -  is a response to attacks linked to the Islamic Revolutionary Guards, which the CISA describes as ‘a driving force behind Iranian state-sponsored cyberattacks’. It details the techniques used in attacks, highlighting VMware Horizon Log4j vulnerabilities for initial access and ongoing use of known Fortinet and Microsoft Exchange vulnerabilities. \r\n\r\n“After gaining access to a network, these actors likely determine a course of action based on their perceived value of the data, including data encryption or exfiltration for ransom operations,” the advisory reads.\r\n\r\nIranian state-linked actors were condemned last week for a series of attacks against Albanian government infrastructure in July, leading to the destruction of data and disruption of government functions. Three Iranian nationals were also recently charged with hacking hundreds of companies in the US, accused of ransomware attacks on infrastructure since October 2020.", "https://www.qa-financial.com/articles/ai-banks-should-take-it-steady-advises-occ": "Banks should innovate with AI with caution, and should involve risk professionals in their innovation planning, said the head of the Office of the Comptroller of the Currency (OCC) at a recent risk and compliance conference in Seattle, hosted by the American Bankers Association.\r\n\r\nActing comptroller of the currency Michael J. Hsu [pictured] began by identifying AI and tokenization as: “Two innovations that are evolving quickly and have the potential to be highly impactful on banking”, before going on to highlight risks involved. Aligning AI systems with their design goals is a core challenge, he said.\r\n\r\n “AI systems, which are generally based on neural networks, are not programmed explicitly like most software. They require training, and their outputs are not predictable. While this is part of their magic, it also creates a fundamental problem: since AI systems are built to ‘learn’, they may or may not do what we want or behave consistent with our values. This alignment problem is inherent to all AI systems and is the focus of intense research.”\r\n\r\nHsu went on to outline key regulatory principles for regulating AI innovation:\r\n\r\nInnovate in stages: “Innovating in stages requires discipline. The concept is simple: start with what can be controlled, expand only when ready, monitor carefully, adjust, and repeat.”\r\n\r\nBuild the brakes while building the engine: “Risk and compliance professionals need to be at the innovation table and have their voices heard. In the technology space, speed to market is an important factor in innovation. Slowing things down is seen as anti-innovative. Structurally and culturally, this casts the risk and compliance functions as barriers to innovation.”\r\n\r\nEngage regulators early and often. Hsu said this can be achieved by: “Giving risk and compliance professionals a seat at the innovation table from the get-go and heeding their input. Empowering them to identify risks and risk mitigants will help ensure that the products and services that result will be safe, sound, fair, and trusted”. \r\n\r\nIn conclusion, Hsu referenced the OCC’s new Office of Financial Technology. “Regulators, of course, must be responsive, knowledgeable, and agile. This is why we recently expanded and upgraded our Office of Innovation to the Office of Financial Technology and hired a Chief Financial Technology Officer. Building a bigger and stronger team fluent in both financial technology and bank supervision will allow us to keep up with developments more easily, to engage banks and fintechs more actively, to educate examiners and policy staff more effectively, and to collaborate with peer agencies more regularly.”\r\n\r\n\r\n[Image Source: Office of the Comptroller of the Currency]", "https://www.qa-financial.com/articles/alten-group-acquires-qa-consultants": "Alten Group, the France-based Engineering and IT services company, has acquired Toronto-headquartered software quality engineering services company QA consultants. \r\n\r\nSpeaking about the deal, Alten Group chairman and CEO Simon Azoulay(pictured)  said: “QA Consultants has established itself as a leader in software quality engineering, and this acquisition allows us to enhance our service offering across all industries and sectors with even more robust end-to-end software development services”.\r\n\r\nThe deal, in which Alten Group will acquire all of the assets of QA Consultants for an undisclosed sum, will see QA Consultants continue business as usual and operate as an independent subsidiary.\r\n\r\n[Image Source: Alten Group]", "https://www.qa-financial.com/articles/attacks-highlight-software-supply-chain-risks": "A report published by Synopsys, the US-based code quality management vendor, indicates a growing awareness of software supply chain risks among firms. Firms are increasingly using software bills of materials (SBOMs), which describe the components of software, to mitigate those risks, the survey found. SBOMs make it easier to find and avoid vulnerable components, and are especially relevant to the management of open-source software, the report says. \r\n\r\nIncreasing automated software testing and DevSecOps practices are also identified as key trends in software security management in Synopys’s Building Security in Maturity Model (BSIMM) report, which has been published annually since 2008. \r\n\r\nAccording to the BSIMM report there has been a 30% increase in the building and maintaining SBOMs to catalogue the components within deployed software over the past 12 months and  a 51% increase in activities associated with controlling open source risks.\r\n\r\n\"The BSIMM13 findings suggest that with the attention placed on software supply chains, most enterprise organisations are taking a risk-based approach to application security,” said Jason Schmitt, general manager of the Synopsys Software Integrity Group. “Such an approach recognizes that security isn't limited to the codebase; it includes the process of software development where security reviews and testing 'shift everywhere' to continuously improve security outcomes.\" \r\n\r\n\"The findings also demonstrate that BSIMM member organisations' software security initiatives are maturing, and they're now looking for ways to drive the scalability, efficiency and overall effectiveness of their programs,\" Schmitt said.\r\n\r\nHowever, some analysts say SBOMs do not protect against common attacks, such as Log4j, which capitalise on the perceived security of an SBOM-based approach. For example, OX Security, the Israeli end-to-end software supply chain security platform for DevSecOps,  aims to address this problem with a new standard: the ‘pipeline bill of materials’; designed to dynamically map attack surfaces, from source code to containers and pipelines. Last week OX Security announced completion of a $34m seed financing round.\r\n\r\nRegulators are looking more closely at the issue of security for software supply chains. They recently highlighted the risk and recommended test automation to cover vulnerabilities. \r\n\r\nAnd while the Synopsys report on supply chain risk highlights improvements, not all research is so optimistic. A survey of C-suite executives in the US and Euriope released by CloudBees, the California-based DevOps platform, revealed a drop in confidence for perceived software supply chain security as firms get to grips with the true size of the challenge. While 88% of executives say their software supply chain is secure or very secure, that is a decline from 95% in 2021.\r\n\r\n“The fall in confidence for perceived security levels reflects that executives are starting to accept the reality of the depth and breadth of security and compliance challenges that their companies are facing,” said Prakash Sethuraman, chief information security officer of CloudBees (pictured). “There seems to be more of an understanding that supply chain security is a challenge that needs to be taken seriously and is perhaps far more complex than was originally understood by senior management.”\r\n\r\nThe CloudBees survey found 59% of executives believe their software supply chain is almost or completely automated, dropping 16% from 2021, while 78% say their software supply chain is mostly or completely compliant, dropping from 90% from the previous year. \r\n\r\nIn countries that reported lower levels of software supply chain and compliance automation, shifting security and compliance left was seen as a help to development teams, while in countries like the USA, UK, and Australia - where automation is high - shifting security and compliance left was seen as a burden, increasing time spent auditing. Three quarters of executives say that compliance and security challenges are hindering innovation.\r\n\r\n“While shift left is a popular talking point, it is not yielding the desired results. Instead, it is further burdening development teams and taking their attention away from value-added work”, Sethuraman said. “What’s needed is a new mindset and a fresh approach, one in which security and compliance are continuous and actually speed innovation.”\r\n\r\nAt the end of September, Cloudbees announced the acquisition of ReleaseIQ - the Californian DevSecOps platform - to expand its own CI/CD and DevSecOps offerings.", "https://www.qa-financial.com/articles/whitepaper-banking-finance-": "WhitePaper: Banking & Finance", "https://www.qa-financial.com/articles/esprow-launches-fix-api-solution": "Esprow, the test and compliance automation specialist,has launched a new API management tool as part of its Enterprise Testing Platform (ETP) for the Financial Information eXchange (FIX) trading system.\r\n\r\n\r\nBased on the new FIX Orchestra technology standard defined by the FIX Trading community, S-Box is designed to act as a central repository for creating, browsing, managing, sharing, and exporting specifications for both FIX and non-FIX protocols.\r\n\r\n“API management is becoming increasingly important as more organisations rely on APIs to drive their digital transformation efforts,” said Francesco Lo Conte, CEO of Esprow (pictured). “With ETP S-Box, we’re making it easier for companies to manage their FIX APIs, so they can focus on delivering value to their customers.”\r\n\r\nS-Box features include: the ability to create and manage APIs, support for a variety of exchange protocols such as FIX, text, and binary, exporting and editing for dictionaries and documentation, and the generation of API specifications from production log files. \r\n\r\nAdditionally, ETP S-Box offers a REST API for exporting XML-based message specifications programmatically into other systems, including FIX engines and exchange line handlers. \r\n\r\nETP S-Box also integrates within FIX trading gateways and CI/CD pipelines and offers role-based access control for added security.\r\n\r\nIntegrating with Esprow’s ETP Studio and ETP C-Box for automated testing and onboarding, S-Box can be deployed on-premises or to the Cloud. The ETP Markets platform also includes complex global exchange and market simulation for robust API testing.\r\n\r\nEsprow claims S-Box is not only suitable for FIX-based API, but can be used to centralise the overall management of FIX and non-FIX message protocols specifications, such as Swift or proprietary protocols.", "https://www.qa-financial.com/articles/applitools-sold-to-pe-tricentis-buys-neotys": "Applitools sold to PE, Tricentis buys Neotys", "https://www.qa-financial.com/articles/codenotary-automates-sboms-for-cloud-apps": "Codenotary, the Texas-based software supply chain security specialists, has launched a self-updating Software Bill of Materials (SBOM) tool - TrueSBOM - for serverless applications.TrueSBOM is designed for use on Cloud-based applications running on AWS Lambda, Google Cloud Functions, or Microsoft Azure Functions. \r\n\r\nSBOM refers to the lists of components of applications when they are created. Compiling an SBOM for a cloud-native application can be arduous as these apps are created and updated ‘on-the-fly’ each time they are invoked, standard methods would require the SBOM to be maintained every time an update is made. \r\n\r\nWith TrueSBOM, applications self-report their components so that the SBOM always remains up-to-date, Codenotary said. This is critical for modern applications like serverless that self-update, where relying on an external SBOM generation at build-time would not pick up the new updates.\r\n\r\n “The real-time update capability of our TrueSBOM technology makes it possible to generate an SBOM for serverless apps, which previously was almost impossible leaving organisations with a gaping security hole,” said Dennis Zimmer, co-founder and CTO of Codenotary (pictured). “Now, with TrueSBOM it’s possible to generate the list of ingredients that make up the application in real-time adding a new level of security to serverless applications.”\r\n\r\nThe new TrueSBOM for Severless helps enterprises comply with President Biden’s Executive Order on Improving the Nation’s Cybersecurity, which includes maintaining a Software Bill of Materials (SBOM), as well as the SLSA security framework, launched by a group of US federal agencies in recognition of the risks to the software supply chain in September.\r\n\r\nIn addition, TrueSBOM includes vulnerability scanner results or trust and integrity information for the application. TrueSBOM can be added to an application through one line in its source code, Codenotary claims.", "https://www.qa-financial.com/articles/deutsche-bank-joins-investors-in-30m-funding-for-sealights": "Deutsche Bank joins investors in $30m funding for SeaLights", "https://www.qa-financial.com/articles/iais-spotlights-outsourcing-risk-for-insurers": "The International Association of Insurance Supervisors (IAIS) has issued a paper outlining third-party IT service outsourcing as one of three significant risks to operational resilience in the insurance sector.\r\n\r\nWith members in 200 different jurisdictions, the IAIS was set up in 1994 to help create a consistent global regulatory framework for the insurance industry. \r\n\r\nDiscussing third-party risks, the IAIS paper points out that while existing frameworks already include requirements to manage risk associated with outsourcing business functions, they do not properly consider the concentration risks associated with critical IT services. It also remarks on how such risks can occur at different levels, either at an individual institution, or across larger groups, with multiple entities dependent on the same few service providers.\r\n\r\n\"While the concept of operational resilience is not new to insurers, there is an increasing recognition of the importance of adapting supervisory regimes to account for the growing resilience of insurers on digital systems, new technologies and third-party providers,\" said Jonathan Dixon, IAIS Secretary General.\r\n\r\nAs an example, the paper describes the use of Cloud-based services: “May present concentration risks at the individual entity, sector and global level,” because a disruption at a single provider could result in broad disruption across the industry.\r\n\r\nThe benefits offered by third party services such as scalability and improved resilience must be weighed against the risks presented not just to users, but to the stability of the wider market, the paper says.\r\n\r\nThe increased use of non-regulated third-parties and the emergence of subcontracting to ‘fourth parties’ as software supply chains grow in complexity are also noted as areas that require increased regulatory interest. \r\n\r\nBecause there is the potential for systemic risk among multinational service providers, the IAIS recommends a coordinated approach between the insurers, third-party providers, and supervisors from multiple countries.\r\n\r\nThe paper, which is open to feedback until January 6th, 2023, also discusses cyber resilience and business continuity management as areas of interest for operational resilience.", "https://www.qa-financial.com/articles/co-op-bank-uses-luxoft-to-migrate-to-finastra-s-kondor": "Luxoft and Finastra, the financial software applications provider, have announced their work in migrating UK-based Co-operative Bank’s treasury infrastructure onto Finastra’s cloud-based solution.\r\n\r\nLuxoft, the Swiss subsidiary of IT services company DXC Technology, is partnered with Finastra to manage the end-to-end implementation and services of Finastra Kondor in the cloud. \r\n\r\nBased on Microsoft Azure, Finastra’s Fusion Kondor solution offers risk analytics, trade processing, position management, and real-time risk coverage for treasury systems.\r\n\"Moving from an on-premises model to a cloud-based managed service is a big part of our operational strategy for treasury activity,\" said Gary McDermott, Treasurer at The Co-operative Bank. \"With Finastra's solution and the speed and flexibility offered by the cloud, we can continue to meet business requirements whilst ensuring regulatory compliance.\"\r\nThe bank’s migration follows a transformation in the banking industry. An Accenture survey released last April revealed that 80% of banks are already migrating, or have plans to migrate their mainframes to cloud systems.\r\n\"By moving to the cloud, The Co-operative Bank can pursue continued growth and innovation in the UK market,\" said Wissam Khoury, EVP Treasury and Capital Markets at Finastra.\r\nLuxoft also recently announced its involvement in the implementation of an upgraded Temenos core banking platform for Maltese Bank FCM.", "https://www.qa-financial.com/articles/microsoft-buys-4-of-london-stock-exchange": "Microsoft, the computer software and cloud platform provider, announced a 10-year strategic partnership with the London Stock Exchange Group (LSEG), the world-leading financial markets infrastructure and data provider. Microsoft will also purchase a 4% stake in LSEG through the acquisition of shares from the Blackstone/Thomson Reuters Consortium.\r\n\r\nMicrosoft estimates this partnership, and broader market opportunities, could generate an additional $5 billion in revenue for the company over the next 10 years, including the $2.8 billion minimum spend commitments from LSEG for cloud services and support.\r\n\r\nThe key to the partnership will be the digital transformation of LSEG’s technology infrastructure and data and analytics platforms onto the Microsoft Cloud, Microsoft said This will include the LSEG’s Refinitiv platforms that power over 40,000 financial institutions in 190 countries with data, analytics and insights across millions of active time series databases, daily evaluations, exchange trades and derivatives, equity quotes and significant research on public and private companies.\r\n\r\nFollowing LSEG’s acquisition of the Refinitiv data analytics services platform in 2021 for $27 billion, LSEG has sought to differentiate itself in the market with an end-to-end proposition across trading, execution, data and analytics solutions.\r\n\r\n“This strategic partnership is a significant milestone on LSEG’s journey towards becoming the leading global financial markets infrastructure and data business and will transform the experience for our customers,” said David Schwimmer, CEO of London Stock Exchange Group.\r\n\r\nThose customers across the capital markets value chain face an increasingly complex operating environment with stricter regulatory controls, while their ability to deliver good customer experience is limited by legacy platforms, siloed information, and limits on scale, the LSEG said. This requires a digital transformation approach underpinned by modern cloud and AI technology.\r\n\r\nWith their partnership, Microsoft and LSEG say they plan to co-create an open, centralised, financial data platform for data democratisation, collaboration and new monetisation opportunities across the financial services ecosystem.\r\n\r\nMicrosoft says it also has plans to explore the development of digital market infrastructure based on cloud technology, with a goal to transform how market participants interact with capital markets across a broad range of asset classes.\r\n\r\nChairman and CEO of Microsoft (pictured), Satya Nadella, said: “Advances in the cloud and AI will fundamentally transform how financial institutions research, interact, and transact across asset classes, and adapt to changing market conditions.\r\n\r\nThe two organisations also announced their plans to co-create the next generation of cloud-based analytics and modelling solutions, utilising LSEG’s analytics and modelling capabilities to enable powerful model construction, validation, diagnostics and deployment using Microsoft Azure AI, Synapse, Power BI, Excel and Teams applications.\r\n\r\nBuilt on top of Azure Synapse, Azure Machine Learning and Microsoft Purview, the new cloud-based analytics and modelling solutions will enable users to expose, share and collaborate across proprietary and third-party data securely and confidently, they said.", "https://www.qa-financial.com/articles/ai-based-testing-for-customer-apps-the-future-is-faster": "AI-based testing for customer apps: The future is faster\r\n\r\nJoin our online seminar with Applitools founder Gil Sever (pictured)\r\n\r\n\r\n\r\nJoin us online on June 29th at 4.00 pm EST (11.00am BST) for our interview with Gil Sever, co-founder and CEO of Applitools.\r\n\r\nIt's always interesting to hear the insights and predictions of innovators in software development, but especially so in Gil's case. Applitools core technology is based on AI-based algorithms that  emulate the human eye and brain to test application pages, breaking down images of those pages to automatically detect differences and faults. Applitools says that its platform can speed up testing by a factor of 20x, and the company was named by Deloitte in 2021 as the fastest growing software testing company in North America.\r\n\r\nApplitools has been winning new customers from financial firms in large part because of the demand created by open banking and increasing competition retail brokerage for a \"flawless\" customer experience, says Sever.\r\n\r\nCompliance requirements are another driver of demand. \"The challenge of compliance is that every screen and every item of print, every document and PDF form,  has to be checked,\" says Sever. \"That is where the acceleration of testing times becomes so important.\"\r\n\r\n\"AI simply catches more bugs, so when you release you release with more confidence. You have tested your software from your user's point of view. Applitools mimics your customers' eyes.\"\r\n\r\nWhile many leading banks and insurance companies are trying to scale back on the number of external vendors they use for software development, and reduce their dependence on large-scale infrastructure, Gil Sever says, that plays to Applitools strength as a platform that can sit alongside existing tools, says Sever.  \"Our interface can add visual testing to existing test platforms and we are compatible with growing security requirements because we do not require a reverse VPN [virtual private network, for data].\"\r\n\r\nIn our Q&A session with Gil, we'll be deeper into the topic of how financial firms large and small can accelerate their DevOps journeys, with Cloud-based AI and containerization technologies especially. And how they can extract the maximum RoI from new testing technologies and deliver better software, faster.  \r\n\r\nAnd we'll be leaving plenty of time for your questions, which Gill will be answering live in our webcast.\r\n\r\nMake sure you don't miss our Q&A with Gil Sever. Register your delegate place now, and into your diary. Our simple registration form is here.", "https://www.qa-financial.com/articles/itiviti-partners-with-imandra-to-speed-fix-onboarding": "Itiviti, the trading technology provider, has announced a partnership with automation and AI specialist Imandra", "https://www.qa-financial.com/articles/micro-focus-launches-cloud-cost-management-platform": "Micro Focus, the UK-based software company and owner of UFT and ALM testing and development tools, has announced the release of a new tool, Hybrid Cloud Management X (HCMX) FinOps Express, designed for financial management of cloud investments.\r\n\r\nHCMX FinOps Express helps organisations to reduce the number of “surprise” bills, improve transparency across their cloud architecture, unifying AWS, Azure, and Google Cloud into a single catalogue and excluding costly or non-compliant options, according to Micro Focus.\r\n\r\n“Among many reasons that organisations move workloads to the cloud is to reduce data centre costs, but many organisations do not realise the full potential of savings due to inefficient management of cloud operations,\" said Travis Greene, senior director of IT operations management product marketing at Micro Focus (pictured). “HCMX FinOps Express provides CIOs the ability to optimise and operate their cloud in an agile and controlled manner, while involving all the necessary stakeholders.”\r\n\r\nConsolidating offerings from major cloud vendors and mapping cloud spend to projects, business units, and cost centres, in-built budgeting tools provide an additional layer of financial responsibility across engineering and other teams. FinOps Express can implement spending limits in the case of memory leaks or other over-active programs. \r\n\r\nReporting features are able to identify spending spikes and inefficiencies from idle, oversized, or over-provisioned resources, and auto-generate recommendations for reservation planning that Micro Focus claims can help lower cloud rates and save as much as 72% on management costs\r\n\r\nHCMX FinOps Express is a part of Micro Focus’s larger cloud management product, HCMX, which also includes capabilities for multi-cloud design and provisioning, policy-based compliance, and lifecycle hybrid cloud service orchestration.", "https://www.qa-financial.com/articles/progress-acquires-data-firm-marklogic": "MarkLogic, the Californian data management platform, is to be acquired by Boston-based software development company Progress.\r\n\r\nMarkLogic offers a proprietary multi-model NoSQL database, along with robust semantic metadata management and AI capabilities, complementing the larger Progress product portfolio. MarkLogic’s database is designed to store and search large amounts of data, supporting test data management, alongside regulatory and customer experience data.\r\nIts no-code metadata management tool, Semaphore allows for deeper analysis of data, including auto-classification and natural language processing to extract additional information.\r\n\r\nA global company with more than 2,000 employees in over 20 countries, Progress is publicly traded and headquartered in Massachusetts with a revenue of around $600m. It offers products in data connectivity, application development, digital experience and infrastructure management. Progress’ DevOps service, Chef, is built on open source tools and supports DevOps and infrastructure automation and compliance management.\r\n\r\n“The key to the success of any business is its ability to tackle complex data challenges through informed decision making. To do this effectively, users must turn data into actionable insights—and that is what MarkLogic delivers,” said Yogesh Gupta, CEO of Progress (pictured).\r\n\r\nThe deal will close in early 2023, subject to obtaining regulatory approvals and satisfaction of other customary closing conditions. Once complete, MarkLogic products will complement the Progress portfolio, especially Progress DataDirect, which currently offers cloud and on-premises data connectivity solutions across relational, NoSQL, Big Data and SaaS data sources.", "https://www.qa-financial.com/articles/smartbear-buys-aspecto": "SmartBear, the Massachusetts-based provider of software development tools, has acquired Tel Aviv-headquartered Aspecto. Details of the deal have not been disclosed, however the move will see the integration of OpenTelemetry monitoring with SmartBear’s BugSnag platform which they claim will enable developers to rapidly identify and correct bugs in distributed environments.\r\n\r\nOpenTelemetry is an open source project orchestrated by an arm of the non-profit Linux Foundation. It is concerned with providing Application Programming Interfaces (APIs) and Software Development Kits (SDKs) to collect telemetry data from cloud-native applications, which can then be used by developers to solve software issues as they arise. Aspecto, founded in 2019, utilises OpenTelemetry via its observability platform which the firm claims can provide end-to-end distributed tracing at scale.\r\n\r\nCommenting on the acquisition, Anthony Bryce VP of Product Management at SmartBear said “Today, BugSnag provides developers visibility into their end users’ experiences of their app, whether it’s unforeseen errors, crashes, or performance issues. With the addition of Aspecto, we are extending these capabilities to provide a broader, developer-focused, OTel-compliant observability platform. This means developers can both identify production issues and rapidly troubleshoot to resolve those issues”.", "https://www.qa-financial.com/articles/taiwanese-bank-signs-up-with-tata": "CTBC, one of the largest private banks in Taiwan, has signed up to use the Tata Consulting Services’ (TCS) core banking software, BaNCS, to transform its digital banking and wealth environments.\r\n\r\nCTBC aims to use BaNCS to provide specialised financial services across retail, wealth and corporate banking, including money trusts, as well as trade finance and international remittance. \r\n\r\nHeadquartered in India, TCS provides IT services and digital transformation solutions for a range of industries, including banking, markets, and insurance. BaNCS Cloud is a microservices based SaaS global banking platform that aims to accelerate transformation within financial firms through an extended ecosystem of cloud-based tools. \r\n\r\nThe new core banking system will offer solutions for loans, deposits, international and domestic remittances, payments/collection, facility limits and collaterals across both consumer and corporate banking businesses. \r\n\r\n“We selected TCS BaNCS for our digital transformation initiatives and to help differentiate our offerings by providing contextual, innovative solutions across banking and wealth management.” said Titan Chia, CTO of CTBC Bank. “TCS BaNCS’ cloud native solutions will help simplify our IT landscape, spanning consumer, corporate banking, and trade finance in alignment with our vision for a tiered architecture through front-end agile delivery, and mid-platform shareable modules backed by an intelligent digital core.”\r\n\r\nThe upgrade is hoped to support the bank’s growth aspirations over the next decade, CTBC said", "https://www.qa-financial.com/articles/-full-test-automation-has-surged-since-2020-says-gitlab-report": "GitLab, the DevOps management platform, has released its 2022 Global DevSecOps survey, which reveals that 47% of DevOps teams across all industries now have full test automation. That’s an increase of 25% in 2021 and four times the number in 2020, according to the report. And the accelerating shift to CI/CD is highlighted by the fact that 53% of respondents said their testing is happening as code is being written, up from 32% last year.\r\n\r\nBecause of  this increase, 27% of teams that contributed to the survey are now able to deploy continuously, while 14% deploy once a day, and 29% deploy every few days. 60% of teams report they are releasing faster than ever before.\r\n\r\nTesting was the single most significant bottleneck reported in the three previous years’ survey. Now it is only one of five equally likely factors causing release delays, alongside code development, code review, security analysis, and test data management.\r\n\r\n\r\nThe survey found 31% of teams are using AI/ML for code review before being viewed by a human, almost double the 16% reported last year. ModelOps - an evolution of MLOps to include continuous retraining of the models developed in MLOps - is reported to be used by 62% of respondents. Only 5% said they had no plans to institute AI/ML in their DevOps practices.\r\n\r\nOn tools and services, there was a dramatic jump in the number using a low/no-code tool in their DevOps, jumping from 25% to 66% of respondents. \r\n\r\nNearly three quarters of DevOps teams are using a DevOps platform or plan to this year, with another 21% to follow within three years. Their reasoning for using a platform included improved security, cost and time savings, and easier automation.\r\n\r\nHowever, an overreliance on tools was highlighted as a risk by survey respondents with 44% saying that they use between two and five tools, and another 41% use between six and ten. In a response to that increase in tools used, 69% of respondents said they want to consolidate their toolchains because of issues with monitoring, development delays, or simply unhappy developers. And 37% complained that toolchain maintenance distracts resources away from other work, including compliance\r\n\r\nIn terms of security, 53% of developers run static application security testing (SAST) scans and 55% employ dynamic application security testing (DAST) scans, up from 44%. Security is now seen as a shared responsibility, with 53% of security teams saying they were mainly responsible, but as part of a bigger team, increasing 25% since 2021.\r\n\r\nLooking forward, across development, security, and operations teams, the top areas of investment are AI and MLOps, security, and cloud computing.\r\n\r\nThe survey, completed in May, received 5,001 responses globally, with 75% coming from the United States. GitLab is a California-based DevOps platform, founded in Ukraine in 2011. Its platform features tools for enabling CI/CD and software compliance.", "https://www.qa-financial.com/articles/qualitest-buys-testing-firm-zenq": "Qualitest, the test automation specialist, has acquired India-based ZenQ, including more than 600 quality engineers and its leadership team. \r\n\r\nWhile the details of the acquisition were not disclosed, it continues a trend of growth for Qualitest. \r\n\r\n\r\n“The acquisition of ZenQ represents yet another milestone in our journey to become the world’s preferred Quality Engineering firm,” said Anbu Muppidathi, Qualitest CEO.\r\n\r\nIn July, Qualitest announced it would be hiring 3,000 engineers across multiple regions and a range of verticalities, including banking and financial services and specialised fields such as  Blockchain and IoT. This would dramatically increase the firm’s size, from around 6,500 employees currently.\r\n\r\n“Qualitest and ZenQ share a common vision to provide the most advanced and customer-centric quality engineering capabilities available in the world. By joining forces, we will leverage our varied expertise to assure the quality of our clients’ deployments and their overall operational readiness.” said Murali Bollu, CEO of ZenQ.\r\n\r\nQualitest offers AI-powered quality engineering solutions, with a range of systems for software testing analytics, automation and coded frameworks, designed to mitigate the business risk associated with digital adoption.  \r\n\r\nIts flagship product, Qualisense combines test automation with text consolidation AI, removing repeated code, and quality assessment processes to identify and improve existing quality operations.", "https://www.qa-financial.com/articles/opentext-acquires-micro-focus": "OpenText, the Ontario-based software company, has formally cleared its acquisition of Micro-Focus the UK-based provider of testing and development tools. The move will see OpenText provide expanded offerings to support its customers' growing needs to digitise and work smarter, it said.\r\n\r\nThe reported total purchase price of approximately $5.8bn is inclusive of Micro Focus’ cash and debt, pricing the deal at 2.3x Micro Focus’ trailing 12-month revenues and 6.7x its trailing 12-month adjusted EBITDA. \r\n\r\nCost synergies of $400mn are expected through an approximate 8% reduction in the workforce, the acquiring company reports.", "https://www.qa-financial.com/articles/uk-market-organises-major-op-resilience-exercise": "The Bank of England (BoE),in partnership with the Financial Conduct Authority (FCA) and the British Treasury, has completed a two-day simulation exercise with firms, designed to assess the financial sector’s resilience against a ‘major operational disruption’.\r\nThe exercise - dubbed SIMEX 22 - was developed by the Cross Market Operational Resilience Group (CMORG),a joint initiative between the financial authorities and financial industry bodies. \r\nSIMEX 22 involved 50 regulated firms as well as core financial authorities, including the BoE, FCA, UK Finance, and the Prudential Regulation Authority (PRA) with the intention of helping both financial firms and their supervisors by identifying weak points in collective response capabilities, and improving the resilience of the financial sector as a whole.\r\nThe simulation followed on from the success of SIMEX 2018, which tested ‘a prolonged and broad cyber attack’ and the impact of a protracted operational outage of a Global Systemically Important Bank (GSIB).\r\nSam Woods, deputy governor of prudential regulation and CEO of the PRA (pictured),said: “It is important to prepare our response to any widespread incident. The financial authorities and industry working together to rehearse our response is a vital part of this.”\r\nThe details of SIMEX 22 have not yet been released, but areas of operational resilience that could have been tested include man-made threats such as physical and cyber attacks, IT system outages and third-party supplier failure - a recent focus at the BoE - alongside natural hazards such as fire, flood, severe weather and pandemic.\r\nCMORG will consider the findings over the coming months, and ensure that collective capabilities are developed to mitigate any risks that are identified.", "https://www.qa-financial.com/articles/delivering-quality-across-complex-workflows": "Delivering quality across complex workflows", "https://www.qa-financial.com/articles/ecb-highlights-lack-of-kpis-for-digital-transformations": "The European Central Bank has highlighted six key areas of focus for banks in their digital transformation journeys. The list is the result of the ECB’s consultation with banks, industry bodies and national supervisors in 2022, together with a survey of 105 banks across the EU.\r\n\r\nIn a February newsletter article, the ECB said “Banks still find it difficult to isolate and quantify the cost and revenue impacts of their digital transformation strategies and processes.” \r\n\r\nThe full list of six challenges listed by the ECB was:\r\n\r\nLack of KPIs to monitor digital progress, quantify the impact of digital transformation and track the effectiveness of implementation.\r\nKeeping track of digital customers and sales.\r\nLack of dedicated digitalisation budgets.\r\nEnsuring that there is sufficient IT experience in the board and in decision making roles to ensure adequate internal governance.\r\nContinued integration of innovative technologies.\r\nRisks associated with increased reliance on third party technology vendors.\r\n\r\nThe ECB said it plans to build on this preliminary analysis with investigations, on-site inspections and reviews of banks and shape future supervisory guidance.\r\n\r\n[Image Source: Corporate Finance Institute]", "https://www.qa-financial.com/articles/trientis-survey-ai-rated-as-high-impact-on-devops": "A survey of 2,670 software engineering professionals conducted by Tricentis, the test automation specialist, has found overwhelming support for the idea that AI technologies will transform DevOps over the next few years,\r\n\r\nNearly 90% of respondents said they were aware of significant potential benefits of AI-augmented DevOps, and nearly 70% rated the potential of AI-augmented testing as “extremely valuable” or “very valuable”.\r\n\r\nThe challenge in test automation is managing the massive amounts of complex data and the frequent changes to test-cases required, the survey authors say. These changes often break most automation cases, introducing extensive maintenance without the assistance of self-healing tools. \r\n\r\nTypically, DevOps engineers use AI-augmented testing in the form of self healing test cases (cited by 49% of survey respondents who said they were using AI) and also to identify or focus on high risk testing projects (cited by 44%). Functional testing was cited by 65% as especially well-suited to AI-augmented DevOps, followed by UI and performance testing. \r\n\r\nImproved customer experience and the reduction of the “DevOps skills gap” - making it easier for less-experienced engineers to automate testing - were seen as the two key business benefits of investment in AI-augmentation for DevOps. Whereas the key challenge firms believed held them back from AI-augmentation was the lack of data and AI skills, cited by 44%, followed by 25% lacking sufficient budget.\r\n\r\nThe survey reveals just how far many firms have yet to travel on the road to successful automation, irrelevant of the maturity of their DevOps environment. According to one DevOps leader at a US financial services firm, quoted in the survey report: “Most organisations today, including mine, still depend heavily on manual testing; mainly because traditional automated test scripts require too much time to maintain and quickly become unreliable.”\r\n\r\n“AI-augmented DevOps is well-suited for automating specific types of testing including unit testing, functional testing, UI testing and performance testing. The big advantage is the time saved – thanks in part to the ability to create automated tests without the need for code, which saves valuable time for all teams involved.”\r\n\r\nThe Tricentis research covered 60 countries and 20 industries, where financial services accounted for 15% of respondents. 55% of respondents to the survey said they are either using or expect to use either a vendor solution or a hybrid of internally driven and vendor-driven solutions to inject AI into their DevOps platform.", "https://www.qa-financial.com/articles/mas-hosts-financial-sector-cloud-forum": "The Monetary Authority of Singapore (MAS) hosted its inaugural Financial Sector Cloud Resilience Forum for Cloud Service Providers earlier this month, providing a platform for discussion on cloud risk management practices for the financial sector. The Forum was attended by senior financial regulatory authority figures, as well as representatives from Amazon Web Services (AWS), Google Cloud and Microsoft Azure.\r\n\r\nMAS published three key takeaways from the forum:\r\n- Adoption of public cloud services by financial institutions is increasing.\r\n- Financial Institutions require assistance from cloud service providers to achieve operational resilience.\r\n- The sharing of information between financial firms and cloud service providers is critical.\r\n\r\n[Image Source: Singapore Business Review]", "https://www.qa-financial.com/articles/qualitest-announces-acquisition-of-q-analysts": "Qualitest, the New Jersey-headquartered quality assurance vendor, has announced the acquisition of Q Analysts, a testing firm based in California. Details of the deal have not been disclosed, however this is the sixth Qualitest acquisition in the past two years.\r\n\r\nThe takeover will see Qualitest enhance its presence in the US, UK, Madagascar, Switzerland and India as the Q Analysts engineering team is merged. The key objective, Qualitest said, is to improve its expertise in augmented reality, virtual reality and “mixed reality” quality assurance and testing.\r\n\r\nCommenting on the acquisition, Qualitest CEO Anbu Muppidathi [pictured] said: \"This acquisition ensures that our combined solutions will continue to unlock value and drive measurable success for our existing customers, as well as allow us to expand our expertise in a wider variety of technologies and adjacent industries”.", "https://www.qa-financial.com/articles/software-risk-and-compliance-round-up-may": "Monetary Authority of Singapore imposes additional capital requirements on DBS after repeated disruption to its digital banking services\r\n\r\nThe Monetary Authority of Singapore (MAS) has imposed additional capital requirements on DBS - Singapore’s largest bank ranked by assets - following disruptions to its digital banking services in recent months, which saw their digital banking services widely unavailable on March 29th, and disruptions to digital banking and ATM services on May 5th.\r\n\r\nCommenting on the announcement, Ho Hern Shin, deputy managing director at MAS said: “The additional capital requirement imposed at this time underscores the seriousness with which MAS treats this matter,” she said. “DBS Bank must spare no effort in dealing with the underlying issues leading to these disruptions.”\r\n\r\nDBS Group CEO, Piyush Gupta responded saying: “the bank convened a special board Committee to oversee a full review of our technology resiliency with an independent external expert” ... “We will complete the review as a matter of utmost priority and implement all recommendations expeditiously”.\r\n\r\n\r\nCAST joins the Green Software Foundation\r\n\r\nCAST, the Paris-headquartered software company, has announced that it has joined the Green Software Foundation (GSF), an industry organisation which it claims will bring “software intelligence to help partners and clients make their software more sustainable”. \r\n\r\nThe GSF was launched in 2021 by GitHub, Accenture, Microsoft, ThoughtWorks and the Linux Foundation and is a non-profit organisation that aims to develop standards, tooling and practices for building green software, and foster shared commitment to sustainability.\r\n\r\nCommenting on the announcement, CAST vice president Greg Rivera said that joining the organisation: “Couldn’t be timelier given the increased demand for enterprise sustainability in modernization and digital transformation initiatives”.  \r\n\r\n“We see green software becoming a standard practice for more and more organisations and their development teams when devising new applications”. \r\n\r\nThe move follows the launch earlier this year of CAST’s “Green Software Insights” platform, which analyses code repositories and identifies inefficiencies which cause excessive energy consumption and have scope for optimisation. They claim that this results in “lower energy expenditure and greenhouse gas emission with more economical, resilient, and efficient software.”\r\nMore information available here\r\n\r\n\r\nECB: Digital transformation requires strong governance\r\n\r\nThe European Central Bank (ECB) has outlined its views on regulatory requirements for the digital transformation of financial institutions. In an article, the ECB stated “Digital transformation requires strong governance and steering”, builds upon a 2022 survey of the digital transformation efforts of banks and a series of on-site inspections conducted by the ECB.\r\n\r\nIn the report, five key observations were highlighted:\r\n\r\nEuropean banks lack the indicators necessary to assess the impact of their digital initiatives. They claim that this inability to assess financial impacts puts banks at risk of sub-optimally allocating resources.\r\nDecisions on launching new digital products or services made by banks could be better supported by comprehensive analyses.\r\nDigitalisation strategies and policies often lack “appropriate approvals and progress reports” to ensure effective steering. However the report commended the up-skilling of management bodies, better equipping them to oversee digital transformation.\r\nMost banks use Agile project management in their digital transformation projects.\r\nThere is a disconnect between projected financial cost savings per digital initiative, which are based on the on-time and within budget delivery of project milestones, and the agile project management strategies adopted which are inherently flexible, allowing room for delays, overruns and replanning. The report claims that this disconnect is widening overtime and that there is “no lessons learned process to feed back into future financial plans.”\r\n\r\nFull news release available here\r\n\r\nG7 to hold first meeting on AI regulation\r\n\r\nGroup of Seven (G7), the intergovernmental political forum consisting of Canada, France, Germany, Italy, Japan, the United Kingdom and the United States, has announced that it will meet to consider problems posed by generative AI tools, such as artificial intelligence research lab OpenAI’s ChatGPT.\r\n\r\nIn recent months generative AI, which utilises large language models to generate new and unique content based on patterns in training data, has become increasingly prevalent and has integrated into a broad range of software product offerings.\r\n\r\nLeaders of the G7, also agreed to the creation of an intergovernmental forum, which is called the Hiroshima AI Process, to debate AI-related issues.\r\n\r\nFull article available here\r\n\r\nEU steps closer to world’s first rules on Artificial Intelligence\r\n\r\nThe European Internal Market Committee, which is responsible for the legislative oversight and scrutiny of EU rules on the single market, and the EU’s Civil Liberties Committee, which is responsible for protecting civil liberties and human rights, have adopted a draft negotiating mandate on the world’s first ever Artificial Intelligence rules. The draft aims to ensure that AI systems are: “Overseen by people, are safe, transparent, traceable, non-discriminatory, and environmentally friendly”. \r\n\r\nA vote of the entire European Parliament on the outlined proposals is expected during the 12-15th June parliamentary session.\r\n\r\nMore details available here\r\n\r\nUK competition watchdog to investigate AI\r\n\r\nThe Competition and Markets Authority, the UK’s competition regulator, has launched an initial review of AI models. The investigation, which will focus primarily on large language models and generative AI (the technologies underpinning tools such as Open AI’s Chat GPT), comes in response to the UK governments request for regulators to consider “how the innovative development and deployment of AI can be supported against five overarching principles: safety, security and robustness; appropriate transparency and explainability; fairness; accountability and governance; and contestability and redress.”\r\n\r\nThis initial review aims to:\r\n\r\nExamine how the competitive markets for foundation models and their use could evolve\r\nExplore what opportunities and risks these scenarios could bring for competition and consumer protection\r\nProduce guiding principles to support competition and protect consumers as AI foundation models develop\r\n\r\nFull details available here\r\n\r\n[Image Source: DBS Bank]", "https://www.qa-financial.com/articles/accelerating-continuos-delivery-with-an-enterprise-view-of-software-quality-diagnostics-and-validation": "Subhadeep Bhattacharjee is Senior Vice President at Northern Trust and heads up the Chicago-based banking giant's global enterprise quality assurance efforts. He believes that the key to improving software quality is a new blend of centralised services and federated development. Battachargee explains his strategy in this video of his session at the recent QA Financial Digital Forum USA where he discusses with QA Financial's Matthew Crabbe exactly what QA functions should be centralised, and how firms can ensure they have the right quality gates for apps in the DevOps era. Subhadeep also took a deeper dive into two technical topics that are high on the agenda at many leading financial firms: the integration and risk management of open source tools and also the roll-out of microservices technologies.", "https://www.qa-financial.com/articles/applitools-acquires-low-code-preflight": "Applitools, the AI-focused automated testing firm based in California and Israel, has acquired Preflight, a company that specialises in low-code automated testing. Terms of the deal have not been disclosed, but are reported to have been in the region of $10m-$15m.\r\n\r\nPreflight's low-code testing solution is designed to enable anyone, regardless of their technical capabilities, to create automated tests quickly and at a low cost. \"Preflight’s user-friendly web recorder captures every element accurately and includes a data generator to simulate even the most complex test cases,\" said Applitools in its online company blog. \"This is a game-changer for manual testers, QA engineers, and product teams as it empowers them to automate test scenarios regardless of their skillset, effectively multiplying their QA abilities instantly.\"\r\n\r\nApplitools' Visual AI - the platform for which the company is best known - is designed to mimic the human eye and brain to avoid undetected functional and visual bugs, minimising false  alerts that waste developers' and testers' time.\r\n\r\nApplitools was acquired by private equity firm Thoma Bravo for $250m in March 2021.", "https://www.qa-financial.com/articles/qualitest-buys-india-s-qa-infotech": "Qualitest, which describes itself as \"the world’s largest pure-play software testing and quality assurance company\", has acquired QA InfoTech, an Indian business which employs around 1,000 testers.\r\n\r\nQualitest said that the acquisition will enhance Qualitest's ability to deliver automation services, and almost triple its capacity for offshore delivery. .QA InfoTech operates two QA Centers of Excellence; one located in the Indian IT hub of Noida, India and another in Detroit, Michigan.\r\n\r\n“QA InfoTech team’s automation expertise will augment our existing offerings to increase our clients’ deployment velocity, whilst increasing our testing accuracy,\" said Norm Merritt, Qualitest's CEO. \"Together, we can collectively leverage our core competencies to deliver the most innovative, practical and flexible automation solutions available.”\r\n\r\nQualitest is majority-owned by international private equity group Bridgepoint, which acquired the company in October 2019, and has has operations in the United States, UK, Israel, India and Romania.", "https://www.qa-financial.com/articles/tricentis-acquires-mobile-testing-platform-waldo": "Tricentis, the Texas-headquartered continuous testing and quality engineering firm, has acquired New York-based Waldo, a no-code mobile test automation platform. Details of the acquisition have not been disclosed.\r\n\r\nWaldo's platform will extend Tricentis' mobile testing offering with new native, hybrid and web mobile test automation capabilities, Tricentis said. Testing teams will now be able to generate automated tests from within a browser window, Tricentis claims.\r\n\r\nCommenting on the announcement, Tricentis chairman and CEO, Kevin Thompson [pictured] said: “We believe the combination of what Waldo brings from a depth-of-knowledge and technology perspective combined with what Tricentis offers in our breadth-of-test automation expertise will allow us to deliver higher-quality mobile applications at the speed and scale businesses require.”\r\n\r\n[Image Source: Tricentis]", "https://www.qa-financial.com/articles/usability-testing-lags-in-automation": "While levels of test automation have generally increased over the past year user acceptance tests (UATs) and usability tests remain largely manual, according to SmartBear’s “State of Software Quality and Testing 2022 survey.\r\n\r\nThe test automation specialist had 1,542 respondents for its survey, 15% of which were in the financial sector. \r\n\r\nAfter recovering from a dip in test automation levels in 2021, the survey found an increase of almost 10% in the number of respondents reporting test automation levels of 51% and above. And 89% of testers reported using test automation processes; most commonly, those belonging to larger firms.\r\n\r\nWeb applications and APIs remain the focus of most testing efforts, with 79% and 70% of teams reporting spending time testing these. Testing across all types of application was seen to increase, with native mobile application testing reaching 30%.\r\n\r\nHowever, the survey found that usability and user accessibility tests - covering the basic functionality of an application and the processes needed to complete actions - were completed fully manually 56% of the time, and only fully automated 14% of the time.\r\n\r\nThe UI testing market was seen to be very fragmented, with respondents reporting 24 different tools in use, where 9 tools were each in use by at least 10% of respondents. Selenium remained the most used tool at 49%, it was also found to be the most popular test automation framework.\r\n\r\nIn 2021, respondents reported that learning testing tools was the most time consuming task, but in 2022 they reported that performing manual and exploratory tests was now the most time-consuming. The overall lack of time for testing was reported to be the greatest challenge for 37% of respondents, alongside general organisational priorities.", "https://www.qa-financial.com/articles/demand-for-accessibility-monitoring-surges": "The adoption of monitoring tools and testing tools for accessibility has doubled since 2021 according to a survey conducted by two specialist vendors in that market space: Level Access and eSSENTIAL Accessibility, which merged earlier this year.\r\n\r\nSurveying more than 1,000 accessibility professionals in 35 industries, the survey found that 91% of those respondents are using free accessibility tools in their DevOps process, primarily employing browser extensions and page testers. Meanwhile, 77.3% are using monitoring tools, a proportion which has increased significantly from 33% in 2021. \r\n\r\n“This year's results show accessibility is becoming a mainstream priority. Governance is maturing. Funding is formalising. And more organisations are incorporating accessibility earlier in their development and creation processes,\" said Tim Springer, CEO of eSSENTIAL Accessibility and Level Access (pictured).\r\n\r\n\"We're moving away from a strictly compliance-focused 'we have to do this' conversation, to an inspired commitment to making a positive impact in the lives of digital users. Such a shift signals maturity in the way organisations are thinking about, adopting, and incorporating digital accessibility,\" Springer added.\r\n\r\nThere’s room for growth in the accessibility testing marketplace with 36.5% of respondents in QA roles rating their organisation’s accessibility testing practices as \"in progress\" and only  22.1% rating their practices as “mature”.\r\n\r\nThe biggest challenge firms face is: “Incorporating accessibility earlier in the development lifecycle” with a growing number of respondents citing this as a key challenge.\r\n\r\nWhile 37.3% of organisations are not undertaking testing with people with disabilities, the number is down significantly from 47.2% in the 2021 survey.\r\n\r\nThe survey was released in collaboration with the Global Initiative for Inclusive ICTs (G3ict) and the International Association of Accessibility Professionals (IAAP), which work to promote awareness of accessibility and advocate for benchmarking and certification.", "https://www.qa-financial.com/articles/fca-comments-on-ai-and-big-tech-regulation": "Chief Executive of the Financial Conduct Authority (FCA), Nikhil Rathi [pictured], has outlined the UK's emerging regulatory approach to Big Tech and Artificial Intelligence at an industry conference .\"We welcome the government’s call for the UK to be the global hub of AI regulation and will open our AI sandbox to firms wanting to test the latest innovations,\" Rathi said.\r\n\r\nRathii said that the FCA is scrutinising the role of Big Tech companies as gatekeepers of data in financial services: \"Today [July 12th], we published our feedback statement on Big Tech in Financial Services,” he said: ”We have announced a call for further input on the role of Big Tech firms as gatekeepers of data and the implications of the ensuing data-sharing asymmetry between Big Tech firms and financial services firms.\"\r\n\r\nThe FCA is also planning to regulate firms designated as critical third parties, Rathi explained: \"Together with the Bank of England and PRA (Prudential Regulation Authority), we will therefore be regulating these critical third parties - setting standards for their services – including AI services - to the UK financial sector. That also means making sure they meet those standards and ensuring resilience.\"\r\n\r\nRathi also commented on the FCA’s approach to the use of AI across the financial sector: \"Our outcomes-based approach not only serves to protect but also to encourage beneficial innovation,” he said. “International and industry collaboration is key on this issue, and we stand ready to lead and help make the UK the global home of AI regulation and safety.\"\r\n\r\nFull speech available here.\r\n\r\n[Image Source: Financial Conduct Authority]", "https://www.qa-financial.com/articles/gitlab-launches-cloud-seed-app-with-google-cloud": "GitLab, the DevOps management platform, has collaborated with Google Cloud to release Cloud Seed, an open-source cloud migration application. \r\n\r\nIntegrating into Gitlab’s ‘One DevOps Platform’ - a single solution for CI/CD, containerisation, value stream management, security testing, monitoring, and governance - Cloud Seed brings access to cloud computing with tools to generate service accounts and automatically deploy containers directly to Google Cloud Run, further expanding the reach of GitLab’s all-in-one platform and consolidating the tools required by developers.\r\n\r\n“Our 2022 DevSecOps Survey found that DevOps and cloud adoption are two key priorities within the industry” said Ashley Kramer, acting CTO at GitLab (pictured). \r\n\r\nThe report, released in September, found 69% of respondents were looking to consolidate their toolchains after 41% said they were using between six and ten tools.\r\n\r\n“Through our work with hyperscalers, like Google Cloud, we’ve noticed that the organisations we onboard to GitLab’s single platform also tend to shift to the cloud in tandem. This capability will enable organisations to accelerate their cloud adoption while still ensuring they can work within the One DevOps Platform,”  Kramer said.", "https://www.qa-financial.com/articles/imf-discusses-fintech-regulation-new-rules-should-be-part-of-the-mainstream-": "The International Monetary Fund (IMF), a financial agency of the United Nations, with 190 member countries, has published a discussion paper on the monitoring of new developments in fintech. The IMF said it believes monitoring will provide data which regulators around the world can use to inform future policy.\r\n\r\nThe paper outlines the different regulatory approaches to fintech which the IMF believes regulatory authorities can follow. These range from a “wait and see” approach that allows some development of fintech-driven products and services outside of the regulatory perimeter to outright bans or restrictions on certain activities or technologies. \r\n\r\nThe IMF paper outlines four key areas of focus for improving the monitories of fintechs and the effectiveness of these different approaches:\r\nExpand and utilise existing regulatory structures.\r\nUse of innovation hubs.\r\nSandboxes for technological testing and innovation.\r\nTechSprints to tackle key issues.\r\n\r\nFull details are available here.\r\n\r\n[Image Source: International Monetary Fund]", "https://www.qa-financial.com/articles/luxoft-implements-temenos-for-maltese-bank-fcb": "Luxoft, the Swiss subsidiary of DXC, the IT services company, has announced a deal to replace Maltese bank FCM’s legacy core banking system. The upgrade is designed to meet FCM’s expansion plans, the bank said. \"We are also launching a new internet banking system that is up-to-date, intuitive and easy to use,\" said Marcel Homolka, CEO at FCM Bank.\r\n\r\nLuxoft offers services for test automation, legacy modernisation and cloud solutions, while Temenos, also based in Switzerland, now provides banking platforms to more than 3,000 financial institutions. \r\n\r\nFCM’s new system, rolled out in June, will see a range of new functionalities and benefits, it said, including faster time-to-market for services, improved cyber security, financial crime mitigation, and general efficiency improvements.\r\n\r\n\"We are delighted to see FCM Bank complete its core banking modernization, moving from legacy systems to a modern, agile, open platform for composable banking,\" said Philip Barnett, president of strategic growth at Temenos. \"This successful go-live is a major milestone in the bank's digital transformation\"\r\n\r\nTaiwan’s Shanghai Commercial & Savings Bank (SCSB) is also upgrading its Temenos systems. IBM is partnering with Temenos for the planning of the work, with specialist firm Nagarro/Techmill for the execution. Techmill provides firms with packaged software implementations and it merged with Munich-based Nagarro in January.\r\n\r\n“We are constantly looking to innovate and improve to stay ahead of the times and our customers’ needs. With disruptive technologies, the pace of change is faster than ever, and a legacy core was holding us back,“ said Alex Lin, president of SCSB. “The new platform will drive scalable efficiency and ensure SCSB is poised to seize new opportunities in a rapidly changing world.”\r\n\r\nANZ Bank New Zealand is meanwhile set to upgrade its current FIS-based core banking system to FIS’s new ‘Modern Banking Platform’, a cloud-native banking platform on Azure. It should be the first bank outside of the United States to use the new system.", "https://www.qa-financial.com/articles/xebia-buys-low-code-specialist-nds": "Xebia, the Netherlands-based software development and digital transformation consultancy, has acquired Netlink Digital Solutions Group (NDS) from Netlink Software Group America (Netlink),an IT services consultancy. \r\nNDS is a leading provider of low-code digital transformation services primarily for OutSystems, the low-code development platform for mobile and web applications, providing end-to-end digital transformation services centred on DevOps, quality assurance, and managed services. \r\nXebia cited the 10 years of experience NDS has in delivering services on the OutSystems platform as a key driver of its offer - NDS says it has trained and certified over 700 OutSystems professionals globally.\r\nAlongside OutSystems, NDS has experience with a range of low-code platforms, including Temenos Quantum, HCLVoltMX, and Neutrinos. NDS offers services for application development, managed services for DevOps and quality assurance implementation, and general IT consulting.\r\nAnand Sahay (pictured),global CEO of Xebia, said: “Netlink Digital is an authority in the OutSystems space and has delivered transformative solutions for enterprises worldwide. Partnering with Netlink Digital will allow us to do what we do best; provide innovative solutions to our current and prospective OutSystems customer base.”\r\nSandeep Makwana, President at Netlink Digital Solutions added: “We are super excited to join forces with Xebia and the potential this partnership unlocks for us. Together with Xebia, we will be stronger and more agile in building and delivering cutting-edge Low Code solutions while driving value for our current customers. This strategic partnership greatly expands our ability to expand and deliver Low Code expertise closer to our customers locations worldwide.”", "https://www.qa-financial.com/articles/shieldpay-hires-cto-from-zopa": "Shieldpay, the UK-based secure digital payments service, has announced the appointment of Andrew Hawkins (pictured), formerly of HSBC and Zopa, as chief technology and product officer.\r\n\r\nWith over ten years of payments industry experience - including three years as the global CTO of digital channels and mobile at HSBC, and two as CTO of Zopa, the British challenger bank - Hawkins will lead Shieldpay’s product and technology functions.\r\n\r\n“As Shieldpay evolves its distribution model both in the UK and abroad, we are very confident that we have the right leader in Andrew to oversee our core technology platform and product offering,” said Peter Janes, CEO and founder of Shieldpay.\r\n\r\nMeanwhile, US-based Bankjoy has announced the appointment of Michael Carrol as its new CTO, and iBanFirst filled five C-level positions.\r\n\r\nFounded in 2015, US-based and Y-Combinator backed Bankjoy recently hired Michael Carroll, who has over a decade of technology experience and history as VP of engineering at Teladoc Health and RubiconMD, both virtual medical care platforms. \r\n\r\niBanFirst, the French fintech company focusing on international payments, has hired Alain Lagabrielle as CTO, among four other new hires. Founder and CEO of iBanFirst, Pierre-Antoine Dusoulier said: “This series of appointments comes at a time of strong growth for iBanFirst, which has seen its turnover increase by more than 100% each year for several years.” \r\n\r\nLagabrielle previously worked at French investment bank Société Générale, implementing DevSecOps and infrastructure as code.", "https://www.qa-financial.com/articles/software-risk-and-compliance-round-up-june": "Here’s our regular review of new initiatives in compliance and regulation that affect the management of software at financial firms.\r\n\r\nFinancial Stability Board consults on toolkit for third-party risk management at financial firms\r\n\r\nThe Financial Stability Board (FSB), the international body that monitors and makes recommendations about the global financial system, has published a public consultation on its toolkit for third–party risk management at financial firms. The FSB said the toolkit has been developed: “Against a backdrop of digitalisation of the financial services sector and growing reliance of financial institutions on third-party service providers for a range of services, some of which support their critical operations.”\r\n\r\n“These dependencies can bring many benefits to financial institutions including flexibility, innovation and improved operational resilience. However, if not properly managed, disruption to critical services or service providers could pose risks to financial institutions and, in some cases, financial stability.”\r\n\r\nThe key aims for the toolkit, according to the FSB, are to: \r\n\r\nReduce fragmentation in regulatory and supervisory approaches to financial institutions’ third-party risk management across jurisdictions and different areas of the financial services sector.\r\nStrengthen the ability of financial institutions to manage third-party risks.\r\nFacilitate coordination among relevant stakeholders.\r\n\r\nFull details available here\r\n\r\nESMA announces EU data strategy\r\n\r\nThe European Securities and Markets Authority (ESMA), the EU financial markets regulator, has announced a five-year data strategy designed to facilitate the use of new data-related technologies, reduce reporting compliance costs and make data more broadly available. \r\n\r\nThe key ESMA strategy objectives are:\r\n\r\nBecome an enhanced data hub\r\nEnsure access to data of public interest\r\nPromote data-driven supervision\r\nIncrease data collaboration\r\nIncrease the efficiency of data policy\r\nFacilitate data use\r\n\r\nFull article available here\r\n\r\nEU financial supervisors consult on DORA\r\n\r\n\r\nThe European Supervisory Authorities (ESAs) - the combined agencies covering the banking, insurance, pensions and securities markets across the EU - have launched a public consultation on the first batch of draft technical standards for the EU’s Digital Operational Resilience Act (DORA). \r\n\r\n\r\nThe act, which entered into force on January 16th  2023, aims to enhance the digital resilience of entities across the EU financial sector and will apply from 17 January 2025. The ESAs, which are composed of the European Banking Authority (EBA), the European Insurance and Occupational Pensions Authority (EIOPA) and the European Securities and Markets Authority (ESMA), were tasked with jointly developing 13 policy documents that will form the framework for DORA.\r\n\r\n\r\nFull article available here\r\nThe consultation, details of which can be found here, is open to all interested stakeholders and runs until September 11, 2023.\r\nAI: Banks should “Take it steady” advises OCC\r\n\r\nBanks should innovate with AI with caution, and should involve risk professionals in their innovation planning, said the head of the Office of the Comptroller of the Currency (OCC), Michael J. Hsu, at a recent risk and compliance conference in Seattle, hosted by the American Bankers Association.\r\n\r\nHsu went on to outline key regulatory principles for regulating AI innovation:\r\nInnovate in stages: “Innovating in stages requires discipline. The concept is simple: start with what can be controlled, expand only when ready, monitor carefully, adjust, and repeat.”\r\nBuild the brakes while building the engine: “Risk and compliance professionals need to be at the innovation table and have their voices heard. In the technology space, speed to market is an important factor in innovation. Slowing things down is seen as anti-innovative. Structurally and culturally, this casts the risk and compliance functions as barriers to innovation.”\r\nEngage regulators early and often. Hsu said this can be achieved by: “Giving risk and compliance professionals a seat at the innovation table from the get-go and heeding their input. Empowering them to identify risks and risk mitigants will help ensure that the products and services that result will be safe, sound, fair, and trusted.”\r\nFull article available here\r\nSingapore on the use of generative AI in the financial sector\r\n\r\nSpeaking at the recent policy and technology Point Zero Forum in Zurich, the Singaporean deputy prime minister Heng Swee Keat commented on the use of generative AI in the financial sector. He outlined three core principles of his government's strategy: “Achieve the safe and responsible deployment of GenAI in FinTech”. These are:\r\n\r\nMobilise collective action to build a safe and responsible AI ecosystem: “Back in 2018, the Monetary Authority of Singapore (MAS) developed the Fairness, Ethics, Accountability, Transparency (or FEAT for short) principles with the financial industry, to provide guidance on the responsible use of AI by financial institutions. This work was continued through the Veritas Consortium, involving 31 industry players, to translate and operationalise these principles. With the benefit of iterations and road-testing over the past few years, the consortium will now release a Veritas Toolkit 2.0, to support financial institutions in integrating the FEAT principles into their internal risk governance.” \r\n(full article on Veritas Toolkit 2.0 available here)\r\n\r\nExamining the risks and opportunities of GenAI for the financial sector, under the new Project MindForge: “This project will bring the data resources and domain expertise of the banking sector, together with the top AI companies’ state-of-the-art technologies and advanced algorithms. We will take an action-oriented approach of use case studies, prototyping and pilots to aid in the learning and translation process.”\r\n\r\nThe launch of an AI resource platform for the financial sector, jointly developed by MAS and Google Cloud, to upskill workers in the financial sector: “The one-stop resource platform will consolidate comprehensive resources, including datasets and use cases, to accelerate AI development for the financial industry. By adopting a spirit of open-source sharing and creation, we hope that this platform can enable: Individuals to tap on available data to demonstrate their skills and solutions, and land a role within the financial sector; Smaller enterprises to level up their capabilities and gain confidence to explore new possibilities; and FinTechs and financial institutions to showcase their market-ready solutions to clinch business opportunities and funding.”\r\n\r\nFull details available here\r\n\r\nUK to host first global AI summit\r\n\r\nThe British government has announced that it will host the first global AI summit this autumn. The summit, which will bring together leading technology companies, academic experts and representatives from various countries, aims to agree safety measures to evaluate and monitor the most significant risks from AI.\r\n\r\nCommenting on the announcement, UK prime minister Rishi Sunak said: “No one country can do this alone. This is going to take a global effort. But with our vast expertise and commitment to an open, democratic international system, the UK will stand together with our allies to lead the way.”\r\n\r\nFull details available here\r\n\r\nFrance sees AI regulation before the end of the year\r\n\r\nFrench digital minister, Jean-Noel Barrot, claims that principles “for the regulation of AI in G7 countries and like minded countries” will begin to emerge before the end of the year. His comments come after French President Emmanuel Macron called for AI regulation, saying: “From my point of view I think we do need a regulation and all the players, even the U.S. players, agree with that. I think we need a global regulation.”\r\n\r\nBarrot also went on to say that he thought that the EU legal stance around AI was too strong: “My worry is that in the recent past few weeks, the EU Parliament has taken a very sort of strong stance on AI regulation, using in some sense this AI act as a way to try and solve too many problems at once.”\r\n\r\n[Image Source: Financial Stability Board]", "https://www.qa-financial.com/articles/google-acquires-mandiant-for-5-4bn": "Mandiant, the cyber security firm behind the discovery of the SolarWinds Orion super-hack in 2020, has been acquired by Google for $5.4bn. Google has outlined plans to roll Mandiant’s security tools into Google Cloud’s ‘shared fate’ model. \r\n\r\nThe shared fate model describes a system where the cloud provider takes a guiding role in the security of a customer’s cloud environment, with secure blueprints and a secure-by-default configuration. In older ‘shared responsibility’ models, customers were expected to have full understanding and control over some areas, leading to grey areas of threat detection.\r\n\r\n“Together, Google Cloud and Mandiant will help reinvent how organisations protect themselves, as well as detect and respond to threats,” said Thomas Kurian, CEO of Google Cloud (pictured), in a press release announcing the deal.\r\n\r\nFollowing one of the largest recorded cyber attacks on Bangladesh Bank, the central bank of Bangladesh, in February  2016, made via the SWIFT global interbank payments network, Mandiant was hired to assist in the subsequent investigation. Its security teams identified and advised on responses to the active malware which was affecting 96 systems across the bank.\r\n\r\nAttackers had used compromised credentials to target the bank’s account with the Federal Reserve Bank of New York, attempting to steal $951m through the authorisation of around 30 fraudulent transactions to accounts in Sri Lanka and the Philippines.\r\n\r\nA spokesperson for the Mandiant incident response team noted: “The attackers had utilised encryption, anti-forensics, and other sophisticated techniques to permit their malware to operate in a manner that evaded detection by the bank’s security infrastructure.”\r\n\r\nWithin days of the response service starting, the bank was able to deploy measures to block the attackers’ access. Mandiant reported a further attack was made two weeks later and the bank was able to immediately halt the access.\r\n\r\nAmong its other financial services customers, Mandiant has also provided an automated data assessment tool for cloud treasury management vendor Kyriba, screening out non-critical events and freeing up security resources.\r\n\r\nIn a blogpost on the Google acquisition, Kevin Mandia, CEO of Mandiant wrote, “We are building a “security brain” that scales our team to address the expertise shortage,” describing automation in Mandiant’s extended detection response platform. Mandia went on to express support for Google Cloud’s shared fate model and the ‘reinvention’ of threat detection, “This will benefit not only a growing base of customers and partners, but the security community at large.”\r\n\r\nFounded in 2004 and headquartered in Virginia, Mandiant was previously acquired in 2013 for $1bn by FireEye (now known as Trellix), and was sold off in 2021 for $1.2bn in a deal led by PE firm Symphony Technology Group. Mandiant is Google Cloud’s second security acquisition of the year, following Siemplify, a security orchestration, automation and response (SOAR) provider, in January.", "https://www.qa-financial.com/articles/natwest-markets-looks-to-containerization-with-kubernetes": "NatWest Markets, the UK investment bank, has said that the next stage of its integration with Google Cloud will be the integration of Kubernetes containerisation technology with its risk management app development.\r\n\r\nKubernetes Engine is Google’s cluster orchestration system, built on the open-source Kubernetes container management system originally developed by Google in 2014. \r\n\r\nNatWest Markets is already using BigQuery, Google’s multi-cloud data warehouse to unify its risk management data into a single source, simplifying reporting to regulators and increasing the speed of its overnight risk calculation algorithms by 60%.\r\n\r\nNatWest Markets decided to migrate to the Cloud in 2019, when it was faced with ever-increasing amounts of data and ageing servers for its risk applications. \r\n\r\n\"As the volume of data we need to process continues to increase, the regulators become more demanding, … it became clear that it wasn't enough for us to speed up processes and carry on as usual\", said Chris Conway, Head of Risk and Finance Technology at NatWest Markets.\r\n\r\nNatWest Markets is looking to extend this data simplification to predictive models for customers, Conway added. \"Our goal is to have all risk modelling, surveillance, and supervision powered by machine learning on Google Cloud from 2022 onwards, where we can better connect the dots from different data sources.\"\r\n\r\nThe development testing of algorithm-based apps for risk management and trading has become more complex with the Basel Committe’s Fundamental Review of the Trading Book (FRTB), which describes new rules on how financial firms manage trading risk, and which is due to come into force in 2022.\r\n\r\n\"We aim to speed up our release cycles from 12 months to 2 weeks for the XVA (valuation adjustments required by the FRTB) desks, and we're just touching the surface of what we're able to do with Google Cloud,\" said Conway\r\n\r\nMicroservices and their virtualisation have been seen to dramatically reduce software development times, shown in a recent QA Financial research report completed on behalf of Parasoft.", "https://www.qa-financial.com/articles/past-1-month": "QA Financial | News and research on financial software quality assurance and risk management", "https://www.qa-financial.com/articles/qmetry-launches-codeless-test-automation-platform": "QMetry, the test management and automation platform for DevOps has remodelled its key product - QMetry Automation Studio (QAS) - around codeless test automation practices.\r\n\r\n“We built this in record time to address the gap for codeless test automation that enables testers, developers, and business analysts to deliver test automation with no coding skills required,” said Makarand Teje, QMetry CEO (pictured).\r\n\r\nNo-code test automation is able to reduce the time needed to create and maintain tests, using AI enabled features like self-healing, smart wait, and auto correction. Through the use of chains of pre-configured and swappable components, QAS codeless tests can be run across multiple platforms, supporting web, mobile, and web services / APIs.\r\n\r\nWhile QAS saw its debut in 2012, QMetry describes this release as a ‘completely refreshed product with new architecture’.\r\n\r\nQAS integrates with CI/CD tools and includes test data management tools and its test can be executed without an interface (through the command line), easing automation increasing the speed of tests.", "https://www.qa-financial.com/articles/qualitest-buys-chicago-test-specialist": "Qualitest - the super-acquisitive testing business backed by Bridgepoint Capital - has bought Chicago-based Olenick & Associates.", "https://www.qa-financial.com/articles/headspin-receives-atlassian-investment": "Atlassian, the Sydney-headquartered software company, has announced an investment in Headspin, the California-based AI testing firm. Details of the investment have not been disclosed, but the stated aim is to allow Atlassian customers access to HeadSpin technologies, as well as providing funding to further develop the HeadSpin platform. A portion of the funding has also been earmarked for HeadSpin’s continued investment in synthetic observability tools, which it says will enable customers to simulate user interactions and identify performance problems in a test environment.\r\n\r\nCommenting on the deal, Rajeev Butani, Chief Executive Officer at HeadSpin said: \"HeadSpin will now focus more deeply on helping SRE and DevOps teams use contextual experience data in an easy way to improve the experience of their apps. Atlassian Ventures' investment marks a crucial milestone in accelerating the development of our agile, DevOps, and synthetic observability capabilities\".", "https://www.qa-financial.com/articles/microsoft-launches-accessibility-assistant": "Microsoft has launched a new Accessibility Assistant, which will initially be rolled out to Microsoft 365 insiders (users who voluntarily provide feedback on early access products), before eventually replacing the existing Microsoft accessibility checker across all Microsoft 365 apps.\r\n\r\nThe 2022 WebAIM Million report which investigated accessibility issues posed by the top 1,000,000 home pages across the public web, found that almost 97% of home pages contain issues such as missing image descriptions, videos without captions and difficult-to-read text colours that reduce usefulness and legibility for users with disabilities. \r\nMicrosoft claims that the Accessibility Assistant will help to address issues such as these and will introduce three key innovations: improved defaults to prevent issues from occurring, real-time remediation to correct issues as they arise, and guidance that appears in the flow of work.\r\n\r\n[Image Source: Bloomberg]", "https://www.qa-financial.com/articles/new-relic-adds-ai-to-observability-platform": "New Relic, the San-Francisco headquartered observability software specialist, has partnered with Microsoft’s artificial intelligence research lab Open AI to add generative artificial intelligence - which it has dubbed New Relic Grok - to its New Relic One observability platform. They claim that this addition will enable natural language querying of collected telemetry data and reduce the barrier to entry for use of their software.\r\n\r\nGenerative AI utilises large language models to generate new and unique content based on patterns in data they have been trained on. \r\n\r\nCommenting on the launch, director of developer relations for New Relic Jemiah Sius said: “New Relic Grok will make the New Relic One platform more accessible to a wider range of IT professionals, especially those that haven’t mastered New Relic’s proprietary programming language that enables DevOps teams to identify the root cause of an issue.” But he added that he “doesn’t anticipate that generative AI will eliminate the need for site reliability engineers to use its programming tool to solve more complex problems.”\r\n\r\n[Image Source: OpenAI]", "https://www.qa-financial.com/articles/perforce-buys-blazemeter-from-broadcom": "Perforce buys BlazeMeter From Broadcom", "https://www.qa-financial.com/articles/publicis-sapient-acquires-practia": "Publicis Sapient, the Boston-headquartered digital transformation arm of the Paris based communications company Publicis Groupe, has announced the acquisition of Buenos Aires-based technology company Practia.\r\n\r\nPractia, founded in Buenos Aires in 1995 as a provider of software engineering and digital transformation solutions, has since seen significant expansion with offices now in Argentina, Chile, Mexico, Peru, Brazil, Colombia and Spain, as well as a business presence in Uruguay and the US. They count Banco de Chile, Western Union and Santander amongst their customers.\r\n\r\nDetails of the deal have not been disclosed, but the move is intended to position Publicis Sapient to enter the Latin American market. Commenting on the acquisition, Arthur Sadoun, Chairman and CEO of Publicis Groupe said “In light of the growing demand for digital business transformation, Publicis Groupe is scaling its expertise in Latin America to better serve its clients and help them win in commerce”, “The addition of Practia will enable Publicis Sapient to break into Latin America and further grow its geographic footprint, as well as expand its digital business transformation capabilities and global distributed delivery model.”", "https://www.qa-financial.com/articles/qa-vector-analytics-how-it-works": "A video presentation on our methodology for benchmarking software QA processes, with the Bank of England", "https://www.qa-financial.com/articles/the-impact-and-benefit-of-virtualization-on-quality-performance-benchmarks": "Companies are deploying software quality initiatives with an eye on implementing more efficient processes and approaches. Test automation has moved DevOps teams in the right direction but dealing with the constraints of downstream dependencies presents its own challenges. Virtualisation makes it possible to mimic those dependent services and endpoints within the test environment, eliminating bottlenecks and enabling testing to continue unhindered.\r\n\r\nListen to this webinar on demand to see  how the use of virtualisation—either from a standing start or transitioning vendors—adds efficiency to testing and development processes. Learn from the experiences of Raymond Smit, IT Chapter Lead of ING, and Istiak Ahmed, SVP - Software Quality Assurance Manager of Bank of America. We'll explore key elements that drive improved efficiency as validated by our own objective QA Vector Analytics benchmarks.", "https://www.qa-financial.com/articles/fca-launches-operational-resilience-survey": "UK financial services regulator, the Financial Conduct Authority has announced the launch of an operational resilience survey designed to help to identify third parties that are critical to the UK financial sector, and evaluate the benefits and risks involved for financial firms.\r\n\r\nThe survey, launched in conjunction with the Bank of England, is part of a larger project focussed on operational resilience and the role of third parties in the UK financial sector, and follows a discussion paper published in July 2022 (available here).\r\n\r\nCommenting on the launch of the project, the FCA said: “UK financial services firms are increasingly relying on third-party services to support their operations. But while these bring multiple benefits, this increasing reliance also poses systemic risks to the supervisory authorities’ objectives, including UK financial stability, market integrity and consumer protection. No one firm can manage these potential systemic risks.” \r\n\r\n“The Financial Services and Markets Bill sets out a statutory framework for overseeing the resilience of services third parties provide that many financial firms rely on. We (the supervisory authorities – the FCA, the PRA [Prudential Regulatory Authority] and the Bank [Bank of England]) welcome the proposals in the Bill and are launching this discussion on potential measures for these critical third parties”.\r\n\r\nThe survey is open from 11th April to 17th May 2023 and is available here.\r\n\r\n[Image Source: The Times]", "https://www.qa-financial.com/articles/the-qa-financial-forum-london-2022": "The leading networking and information event on the subject of software quality assurance. Free to attend for delegates from financial firms, our audience will hear from experts and pioneers in new QA technologies from banks, insurance companies, exchanges and trading venues. \r\nFor more information on how to attend as a delegate, be a speaker or sponsor our events please contact info@qa-financial.com", "https://www.qa-financial.com/articles/oney-bank-improved-productivity-of-managing-projects-qa-using-spiratest-from-inflectra-": "Oney Bank Improved Productivity of Managing Projects & QA Using SpiraTest from Inflectra", "https://www.qa-financial.com/articles/uipath-and-planview-partner-on-testing-platform-development": "UiPath, the New York-headquartered automation company, has announced a strategic collaboration with Texa-based software firm, Planview. The partnership will see the combination of the UiPath’s automated testing platform and Planview’s value stream management solution to offer what they describe as an “end-to-end automation platform”. \r\n\r\nLouise Allen, chief product officer at Planview, said: “Rapid and continuous automation testing is no longer a nice-to-have; it’s critical to accelerating digital transformation and fostering the future of connected work. A recent Planview report found that bottlenecks frequently happen at the end of the release process, with 40% of end-to-end delivery time spent on software testing and release activities. This integration will offer visibility and control over the entire software development lifecycle, enabling teams to optimize workflows for better outcomes.”\r\n\r\nThey claim that the new testing platform will offer the integration of more than 40 application lifecycle management tools, enabling development teams to apply test automation on both modern and legacy applications.\r\n\r\nGerd Weishaar, senior vice president of product management at UiPath added: “Together with Planview, CIOs and IT leaders can achieve software testing outcomes faster at a lower cost with our intuitive and scalable testing solutions included in the market’s only end-to-end automation platform”. “Organizations can leave disparate legacy testing tools behind and consolidate on the UiPath platform to modernize how teams manage and execute delivery of their product”.", "https://www.qa-financial.com/articles/app-and-dev-market-m-a-boom-will-continue": "PE firm Capstone reports deal volumes are up 27% in 2022\r\n\r\nThe M&A marketplace for app development and deployment firms - including the testing and QA specialists - is hot. \r\n\r\n\r\nAccording to a report published  by PE firm Capstone Partners, there were 123 merger deals in the first half of 2022, up 26.8% year on year. And with an average sales multiple of 3.7x revenues, values were higher than in the broader technology, media and telecoms sector (3.0x).\r\n\r\n\r\n\r\nRising sector demand, coupled with heightened competition for market share, has resulted in increased consolidation and favorable valuations for sector participants engaging in sell-side transactions, Capstone said.\r\n\r\n\r\nAmong significant recent deals is the planned acquisition, announced in May, by Perforce Software (owner of Perfecto) of Puppet Labs, which provides automation solutions for Cloud infrastructures. Another is TA Associates-backed Planview’s acquisition of Tasktop Technologies, which provides SaaS tools for developers and testers.\r\n\r\n\r\nWhat’s driving deal volumes? According to Capstone, technology vendors increasingly need scale in order to keep pace with the demand for upgrading legacy systems while at the same time modernizing components and Cloud infrastructures (a major challenge especially for large financial firms). Demand for containerization, AI and security technologies in particular is likely to underpin this trend going forward for the remainder of the year, according to Capstone analysts.\r\n\r\n\r\nAnother major deal-driver is  the sheer volume of “dry powder” funding at the disposal of private equity firms. For example, Thoma Bravo, one of the leading US private investors in technology companies reported an increase in assets under management from $76 billion in December 2020 to $114 billion at March 31, 2022.", "https://www.qa-financial.com/articles/atlassian-adds-generative-ai-to-testing": "Atlassian, the Sydney headquartered software company, has collaborated with San-Francisco based artificial intelligence research lab, OpenAI, to announce the launch of its “Atlassian Intelligence'' offering. The move will see the integration of OpenAI’s generative AI technology to its software management and testing platforms.\r\n\r\nGenerative AI, as popularised by Open AI’s Chat GPT platform, utilises large language models to generate new and unique content based on patterns in data they have been trained on. \r\n\r\nAtlassian claims that this addition will enable the automated summarisation of outputs from meeting notes and allow developers to automatically define test plans for product updates based on defects highlighted by its Jira Software platform, which will enable teams to “accelerate their work”. \r\n\r\n[Image Source: Bloomberg]", "https://www.qa-financial.com/articles/bitrise-releases-benchmarks-for-mobile-apps": "Bitrise, the Budapest-based continuous integration and development specialist, has announced the release of standardised benchmarks for mobile app developers. The Mobile DevOps Assessment (MODAS) benchmarks are designed to evaluate performance across key stages of the mobile app development process and allow comparisons against global competitors.\r\n\r\nBitrise also published the results of its MODAS report, which is based on a survey of 1,600 mobile app development teams. Key findings included:\r\n\r\n44% of respondents said that their application testing and release process was largely or entirely manual, with only 9% having it fully automated.\r\nOver 75% of respondents say that their teams take more than two days to address bug fixes.\r\nOnly 21% of responding teams claim to have implemented an application performance monitoring system to keep track of defects.\r\n\r\nCommenting on the state of the industry in conjunction with these releases, Bitrise CEO Barnabas Birmacher said: “Mobile DevOps comes with its own nuances and challenges that traditional DevOps never touches. But even as mobile becomes responsible for a disproportionate share of companies’ overall revenue, mobile teams haven’t had access to their own set of best practices for navigating these challenges”.\r\n\r\n[Image Source: Bitrise]", "https://www.qa-financial.com/articles/embedding-security-and-quality-in-api-architecture-a-guide-to-the-nordea-platform": "Embedding security and quality in API architecture: a guide to the Nordea platform", "https://www.qa-financial.com/articles/generali-insurance-achieves-real-time-quality-visibility-with-spirateam-from-inflectra": "Generali Insurance Achieves Real-Time Quality\r\nVisibility with SpiraTeam from Inflectra", "https://www.qa-financial.com/articles/mabl-launches-performance-testing-tool": "Mabl, the Boston-based low-code automation specialist, has launched a load testing tool for developers. The new platform will be integrated into Mabl’s existing software platform. \r\n\r\nCommenting on the launch, Mabl co-founder Dan Belcher said: \"The primary goal is to help customers test application changes under production load before they release them so that they can detect any new bottlenecks or things that they would have experienced as the changes hit production before release”.\r\n\r\nMabl also says its new tool lowers the barrier to entry to testing, enabling teams that do not have dedicated performance testers or specific performance testing tools to assess how their applications will perform under production loads.\r\n\r\n“Anyone within the software team can use it, so it is not limited to just the software developers or just the performance experts,” Belcher said. “Because we’re low-code and already handling the functional testing, it makes it super easy for the teams to be able to define and execute performance tests on their own without required specialized skills.”\r\n\r\n[Image Source: Mabl]", "https://www.qa-financial.com/articles/parasoft-adds-ai-to-testing-platform": "Parasoft, the California-headquartered software testing specialist, has announced the release of unified code coverage as an upgrade for its AI-powered testing platform. \r\n\r\nThe offering enables the automated testing of application programming interfaces (APIs) across distributed systems, Parasoft said. Unified code coverage reporting is a technique which enables developers to see the proportion of the source code which is exercised during testing.\r\n\r\nCommenting on the launch, Parasoft Chief Product Officer Igor Kirilenko said: “Parasoft has already successfully applied artificial intelligence and machine learning to multiple aspects of software testing to optimize test creation, execution, and maintenance”.\r\n\r\n “We continue to invest in our Continuous Quality Platform to improve usability and increase visibility of code coverage and test reporting in complex end-to-end verification scenarios” he added.\r\n\r\n[Image Source: Parasoft]", "https://www.qa-financial.com/articles/uk-approves-broadcom-acquisition-of-vmware": "Broadcom, the California-headquartered technology giant, has received approval from the UK Competition and Markets Authority (CMA) for its acquisition of California-based cloud computing specialist, VMware. This green light follows recent EU approval of the acquisition, as previously reported here.\r\n\r\nCommenting on the approval, the CMA said: “After examining the evidence gathered from Broadcom, VMware and other interested parties, an independent CMA panel has provisionally found the deal would not substantially reduce competition”.\r\n\r\nBroadcom still needs to win the approval of Chinese and US regulators for the acquisition.\r\n\r\n[Image Source: Broadcom]", "https://www.qa-financial.com/articles/us-federal-agencies-recognise-software-supply-chain-risk": "The Enduring Security Framework (ESF) - a public-private cross-sector working group led by  three US agencies; the National Security Agency (NSA), the Cybersecurity and Infrastructure Security Agency (CISA) and the Office of the Director of National Intelligence (ODNI) - has released guidance for developers for securing software supply chains. \r\n\r\nThe guidance paper is the first in a three part series addressing developers, vendors and software customers and outlines the key areas the ESF sees as in particular need of care, including the risks involved in using third party software. It also details methods recommended for minimising those risks by verifying third-party components, avoiding build chain exploits, and defining and managing secure product criteria. \r\n\r\nThe use of  third-party software - particularly binaries, or opaque files of pre-compiled code -  is identified as an area of high risk because the software involved may no longer be maintained and could have unpatched vulnerabilities, according to the guidance.\r\n\r\nThe ESF advises mitigation measures including  binary scanning and software composition tools that can  detect intrusive files without access to the source code. A software bill of materials (SBOM) is recommended to simplify validation and identify the points of vulnerability when defects are discovered. A variety of SBOM specifications exist, the guidance points out, including NIST software identification tags.\r\n\r\nThrough the creation of a new security framework that it has titled  Supply Chain Levels for Software Artefacts’ (SLSA), the ESF sets out a common-language framework that it says can be used by all stakeholders in the software development lifecycle. \r\n\r\nThe SLSA specifies four levels of assurance for components across the chain, defined from details such as code environment isolation, build method (i.e. using a service like GitHub over building locally on a workstation), and bit-for-bit build reproducibility. While the version put forward by the ESF is preliminary, versions of the SLSA have been in use at Google since 2013.\r\n\r\nFormed in the wake of the infamous hacking of SolarWinds Orion in 2020, the ESF is set to extend the guidance to cover software vendors and their customers.", "https://www.qa-financial.com/articles/accelerating-innovation-at-charles-schwab-with-continuous-testing": "At the QA Financial Digital forum,  Mike Schober Bala Mukund, MD respectively MD and director of technology Charles Schwab described how they had implemented automated testing for the launch of  Schwab's robo investment platform.", "https://www.qa-financial.com/articles/basel-committee-proposes-new-guidelines-for-digital-resilience": "The Basel Committee on Banking Supervision - the supervisory arm of the BIS, the central bank for central banks - has issued a public consultation on proposed revisions to its core principles for effective banking supervision.\r\n\r\nPerhaps the most substantial change proposed by Basel is the broadening of its guidelines on operational risk management, or number 25 of its core principles. The Basel Committee is proposing a widening of principle 25 to include digital resilience alongside operational risk and adds a proposed new requirement that banks should assess: “Tolerance for disruption to their critical operations” to the existing listed operational risks.\r\n\r\nThe core principles, which were originally published in 1997 and last substantively updated in 2012, represent minimum standards for the regulation and supervision of banks and banking systems. They are used by central banks and other supervisory authorities to assess the effectiveness of their regulatory frameworks, as well as by organisations such as the International Monetary Fund and the World Bank to evaluate the effectiveness of national banking regulations.\r\n\r\nThe Basel Committee said: “The proposed amendments have been informed by several thematic topics reflecting regulatory and supervisory developments in: (i) financial risks; (ii) operational resilience; (iii) systemic risk and macroprudential aspects of supervision; (iv) new risks, including climate-related financial risks and the digitalisation of finance; (v) non-bank financial intermediation; and (vi) risk management practices.”\r\nThe proposals were developed by a Task Force comprised of both Committee and non-Committee member jurisdictions, as well as the IMF and World Bank.\r\n\r\nFull details available here.\r\n\r\n[Image Source: Bank for International Settlements]", "https://www.qa-financial.com/articles/past-7-days": "QA Financial | News and research on financial software quality assurance and risk management", "https://www.qa-financial.com/articles/tabnine-adds-generative-ai-": "Tabnine, the Tel Aviv-headquartered code automation specialist, has announced the beta release of its generative AI testing tool named Tabnine Chat. The offering will make it simpler for developers to use its test automation platform, the company said.\r\n\r\nGenerative AI utilises large language models to generate new and unique content based on patterns found in training data. The addition of generative AI to the Tabnine test automation platform will: “Allow developers to interact with Tabnine’s AI models in a flexible free-form way, using natural language”, the company said.\r\n\r\nTabnine claims that the introduction of its Tabnine Chat offering will provide clear benefits to customers using its platform:\r\n\r\nBetter understanding and explanation of existing code.\r\nKnowledge proliferation and increased accessibility of the code base.\r\nMore consistent code and quality assurance.\r\n\r\n[Image Source: Tabnine]", "https://www.qa-financial.com/articles/webb-ai-launches-root-cause-analysis-platform": "Webb.ai, the California-headquartered observability specialist, has launched an automated continuous root cause analysis platform which uses AI to analyse defects and changes to the IT environment. The platform employs generative AI, which utilises large language models to generate new and unique content based on patterns found in training data, to aggregate telemetry data and present it in natural language to DevOps teams.\r\n\r\nCommenting on the launch, Webb.ai CEO and founder Manish Gupta [pictured] said: \"AI is allowing us to write code ever faster. Software also makes infrastructure very dynamic. There is continued innovation in PaaS services. But Ops is struggling because they have to identify the change that caused the downtime.”\r\n\r\n“Webb.ai gives organisations an unprecedented visibility into the full stack, how subsystems interact, how one change causes another, and how it impacts a business metric. This creates transparency and trust across the organisation, reducing downtime and increasing the pace of feature delivery.\" \r\n\r\n[Image Source: Webb.ai]", "https://www.qa-financial.com/articles/bloomberg-media-headlines-at-qa-e-commerce-and-retailing-forum-nyc": "Pooja Malpani, CTO and Head of Engineering, joins our NYC event\r\n\r\nThe QA Financial E-commerce and Retailing Forum returns to New York City on October 19th, 2023. In our opening session, we'll be featuring a \"fireside chat\" interview with Pooja Malpani, a prominent media CTO with a deep background in software engineering garnered at Microsoft and HBO in addition to her current role at Bloomberg Media. Our conversation will cover the key technology challenges and opportunities Pooja is focused on right now, and how she balances her time between managing innovation and managing day-to-day resilience and performance issues. As always at our Forum events, we'll leave time for audience questions.\r\n\r\nPooja leads the engineering teams responsible for technology that powers consumer media and Bloomberg Connects. This includes supporting Bloomberg.com, consumer mobile applications, smart television apps, other connected devices, as well as the systems that deliver market-moving news, data, audio and video to consumers and syndication partners. Her group also manages Bloomberg’s arts and culture exploration app in partnership with Bloomberg Philanthropies.\r\n\r\nPrior to Bloomberg, Pooja was at HBO Digital Products, where she led the purchase and identity engineering teams for HBO Go and HBO Now.\r\n\r\n\r\nInterested in becoming a sponsor partner to the QA Financial E-commerce Forum NYC?\r\n\r\nContact matthew.crabbe@qa-financial.com.", "https://www.qa-financial.com/articles/honeycomb-adds-ai-query-assistant-": "Honeycomb, a San Francisco-headquartered software observability specialist, has announced the addition of a query assistant to its platform. The assistant utilises the ChatGPT technology of Microsoft’s artificial intelligence research lab Open AI to enable natural language querying.\r\n\r\nHoneycomb claims that its low-code approach will increase the accessibility of their observability platform for developers. CTO Charity Majors [pictured] said: “Observability shouldn’t require you to master complicated tools or languages that force you to constantly switch context and piece together clues to get answers to complex problems. The only thing observability tools should encourage you to focus on is your own curiosity about what’s happening in your system.”\r\n\r\n[Image Source: Honeycomb]", "https://www.qa-financial.com/articles/watch-the-qa-financial-digital-forum-on-demand": "Watch the QA Financial Digital Forum - On Demand", "https://www.qa-financial.com/articles/what-is-digital-product-management-and-why-do-i-need-it-": "While digital transformation is at risk of becoming a cliché, the principles that undergird it are anything but. At its core, digitalization or digital transformation are processes that enable businesses to serve their customers virtually - including businesses and industries that would never have given a second thought to a virtual presence in the past. If the global pandemic has done nothing else, it’s shown every business owner the importance of being able to digitally interact with their customers at any time.", "https://www.qa-financial.com/articles/challenges-and-solutions-for-2021": "Broadcom has been the sponsor partner for QA Financial's 2021 Vision seminar series", "https://www.qa-financial.com/articles/danske-bank-partners-with-infosys-for-transformation": "Copenhagen-based Danske Banks has signed a strategic agreement with Infosys, the India-based systems integrator to accelerate digital transformation at the Nordic bank.\r\n \r\nAs part of this collaboration, Infosys will also acquire Danske Bank’s IT centre in India, where over 1,400 staff are employed. Infosys said it will accelerate Danske Bank's digital agenda by significantly enhancing their IT operations and capabilities, powered by  Infosys Topaz, an AI-first set of services and platforms.\r\n \r\nCommenting on the agreement Frans Woelders, Chief Operating Officer at Danske Bank, said: “Our 'Forward ’28' strategy sets clear ambitions for Danske Bank to be a leading bank in a digital age. This is backed by significant investments in digitalisation and technology, including plans to further develop our customer-facing digital solutions, and modernising our technology infrastructure to enable even better customer experiences and drive operational efficiency.\" \r\n\r\n[Image Source: Danske Bank]", "https://www.qa-financial.com/articles/how-bankunited-benchmarks-its-agile-performance": "How BankUnited benchmarks its Agile performance", "https://www.qa-financial.com/articles/kasisto-s-large-language-model-for-banks": "Kasisto, the New York-headquartered banking software specialist, has launched KAI-GPT, a large language model which it claims is: “The world’s first banking industry-specific large language model”. The model will power the vendor’s, KAI Answers generative AI platform.\r\n\r\nLarge language models are the technology behind recent generative AI developments, including Microsoft-backed OpenAI’s ChatGPT tool. They are sophisticated artificial intelligence systems designed to understand and generate human-like text using advanced machine learning techniques and a vast amount of training data to provide coherent and contextually relevant responses to user queries or generate creative content.\r\n\r\nKasisto claims that the KAI-GPT large language model was specifically trained on financial data, and was designed around four key criteria for financial institutions:\r\n\r\nAccuracy: “Purpose-built exclusively for financial services, thus providing precise, reliable answers for banking use cases”.\r\nTransparency:  “Customers have full visibility and auditability of the training methodology and content used to build the LLM”.\r\nTrust: “Trusted by financial institutions for how their proprietary data is used, kept secure, how Personally Identifiable Information (PII) is protected, and how their brand is respected”.\r\nCustomisation: “Can be customised for any financial institution, using their unique data and content for their proprietary use”.\r\n\r\nKasisto CEO Zor Gorelov [pictured] said: “We created KAI-GPT because banks can realise tremendous growth and performance benefits from generative AI - but they need to do so with deep consideration for compliance, accuracy, safety and ethical responsibility. The only way to achieve this is through an LLM that is optimised for the banking industry.”\r\nThe platform is already attracting interest, including from Westpac - the Sydney-headquartered bank. Westpac Group CTO, David Walker said: “Despite all the discussions about the future implications of generative AI in banking, Kasisto has made it a reality today through its real-world banking application of generative AI. What’s unique about Kasisto is that KAI-GPT is a banking industry-specific LLM – which means it’s more accurate, safe and intuitive while delivering ChatGPT-like conversational experiences.”\r\n\r\n[Image Source: Westpac]", "https://www.qa-financial.com/articles/testing-trading-algorithms-at-morgan-stanley-new-standards-for-black-boxes": "In response to market supervisors' increased scrutiny of trading apps, Morgan Stanley has centralised testing for trading algorithms as part of its two-year ATIC project - Automated Test Tracking and Reporting.", "https://www.qa-financial.com/articles/the-changing-priorities-for-security-in-software-testing": "David Cafaro heads Capital One's security office for its card business, and was a speaker at the recent QA Financial Digital Forum USA.", "https://www.qa-financial.com/articles/a-standardised-test-management-toolset-as-the-foundation-for-automation-across-at-nordea": "A standardised test management toolset as the foundation for automation across at Nordea", "https://www.qa-financial.com/articles/accelerating-automation-at-insurer-cna-financial": "Accelerating Automation at insurer CNA Financial", "https://www.qa-financial.com/articles/copado-to-offer-testing-for-ncino-bank-platform": "Copado, the Chicago-headquartered low-code testing specialist, has announced a partnership with North Carolina-headquartered nCino, a provider of cloud-based bank operating systems to offer tools for the delivery and  automated testing and continuous integration of the nCino Cloud platform.\r\n\r\nCopado, which was founded in 2013, has previously worked with a number of financial firms including American AgCredit, Comerica, Citizens Bank and Northern Trust, to aid digital transformation. \r\n\r\nCommenting on the announcement, Copado vice president of alliances Christie March said: “Financial institutions are looking to deploy new technologies and deliver new services faster, and proven DevOps tools and processes are the keys to making that happen”\r\n\r\n “This partnership with nCino to help financial institutions accelerate their digital initiatives will lead to faster innovation and feature adoption, from commercial banking to portfolio analytics.”\r\n\r\n[Image Source: nCino]", "https://www.qa-financial.com/articles/how-visual-testing-works-and-the-low-code-future": "Watch our video interview with Gil Sever, founder and CEO of Applitools\r\n\r\nQA Financial's Matthew Crabbe met online with Gil Sever, co-founder and  CEO of Applitools, the California-based visual test automation specialist. \r\n\r\nWatch the interview here. \r\n\r\nBacked by the Thoma Bravo private equity firm, Applitool's AI-based platform uses data from millions of tests to compare and visually verify websites and mobile apps.\r\n\r\nIn the interview, Gil Sever explains how visual testing works in practice, and how it can accelerate software delivery times by a factor of 3x. He also discusses the pressure points in testing that Applitools financial services customers are facing, and how they are using visual testing to improve customer UX and also meet the growing compliance requirements faced by retail financial services firms.\r\n\r\nFinally, Gil discusses why he believes autonomous, low-code, testing will be a focus for firms over the coming 12 months.", "https://www.qa-financial.com/articles/accessibility-and-quality-ux-design-setting-new-standards-at-us-bank": "QA Financial | News and research on financial software quality assurance and risk management", "https://www.qa-financial.com/articles/broadcom-secures-eu-approval-for-vmware-acquisition": "Broadcom, the California-headquartered technology giant, has secured approval from EU antitrust regulators for its acquisition of California-based cloud computing specialist, VMware, thus overcoming the first major barrier to its takeover. The deal, which is valued at $61 billion, has been on hold since the agreement was announced in May 2022 due to competition concerns from regulators.\r\n\r\nCommenting on the news, Broadcom said: \"We continue to make progress with our various regulatory filings around the world, having received legal merger clearance in Australia, Brazil, Canada, the European Union, South Africa, and Taiwan, and foreign investment control clearance in all necessary jurisdictions.\"\r\n\r\nChinese, US and UK regulators are still investigating the potential impacts of the proposed takeover. The UK’s Competition and Markets Authority (CMA), said that the merger is likely to  result in a “realistic prospect” of weakened competition and “less innovation” which may: “Drive up the cost of computer parts and software.” The CMA’s investigation is due to report its findings by mid-September.\r\n\r\n[Image Source: Broadcom]", "https://www.qa-financial.com/articles/esprow-tests-fix-for-genesis-global": "Esprow, the automated testing specialist, has announced a deal with London-based financial app development platform Genesis Global to test FIX connectivity and message processing.\r\n\r\nGenesis required testing for a project that revolved around multiple Financial Information eXchange (FIX) payments sessions, demanding highly scalable testing for simulating millions of high-velocity messages.\r\n\r\nJames Harrison, the CTO and co-founder of Genesis Global, said: “With our solution needing to process many hundreds of thousands of FIX messages per second, we wanted to independently validate our performance in processing these flows accurately and predictably.  We chose Esprow to help in simulating replayable, real-life workflows and their service helped us deliver the project on time and on budget.”\r\n\r\nFounded in 2015, the Genesis Global low-code platform is built for financial markets, containing more than 25 customisable components for fast and flexible development. The platform is able to integrate with a range of legacy order management systems, post-trade systems, and to support the development of new platforms.\r\n\r\nDesigned for automating testing for financial applications, the Esprow ETP platform supports a range of tools for FIX, such as ETP Studio and S-box for API design, management, and testing, ETP C-Box for client onboarding, and the ETP Markets exchange-simulation service. ETP supports well known protocols such as FIX and Swift, while ETP Studio can be used for multi-protocol testing.", "https://www.qa-financial.com/articles/how-do-i-start-a-digital-product-management-journey--1311": "How Do I Start A Digital Product Management Journey?", "https://www.qa-financial.com/articles/mabl-completes-40m-series-c-funding": "mabl completes $40m series C funding", "https://www.qa-financial.com/articles/northern-trust-s-global-head-of-quality-engineering-to-keynote-qa-financial-digital-forum-usa": "QA Financial.com has opened registration for its next major online event: The QA Financial Digital Forum USA, which will run in US working hours over two days on September 23rd and 24th. The agenda focus in on AI and automation for software quality assurance, and you can see the full agenda - and register to attend - at www.qa-financial.com", "https://www.qa-financial.com/articles/perfecto-launches-virtual-device-testing": "Perfecto launches virtual device testing", "https://www.qa-financial.com/articles/uk-parliament-to-debate-rules-on-third-party-resilience": "The Bank of England, Financial Conduct Authority (FCA) , and the Prudential Regulation Authority (PRA) - the key UK financial markets supervisors - have set out proposals for ensuring the resilience of critical third parties (CTPs) to the British financial industry, following four years of discussion papers and consultation.\r\n\r\nTheir proposals are contained in the government’s Financial Services and Markets Bill which was put before the UK Parliament on the 20th of July - and they appear to follow the lead set by the European Union’s draft Digital Operational Resilience Act in which supervisors are setting out to develop powers to limit the systematic risk posed by third parties, through a series of frameworks and standards, alongside formal powers for enforcement.\r\n\r\nDiscussing the Bill and it’s related PRA discussion paper, Sam Woods, Deputy Governor of Prudential Regulation and the CEO of the PRA said: “It is vital that the firms we regulate can rely on services provided to them by third parties, particularly where those third parties have become critical parts of the system. Today's paper sets out our thinking on how we can ensure the right levels of resilience for those services.”\r\n\r\nThe proposed new powers include:\r\n\r\nA framework for identifying CTPs to the government Treasury. Essentially CTPs will be defined by the likelihood that their failure or the disruption of their services to financial firms could threaten the stability of the greater UK financial system. \r\nMinimum standards for resilience of services to the financial industry, with information gathered directly from the CTPs in the form of self-assessments alongside organised exercises and tests.\r\nA framework for testing the resilience of the services provided by CTPs through scenario testing; participation in sector-wide exercises (the Quantum Dawn series organised by financial trade association SIFMA and last run in November 2021, for example), cyber resilience testing, and “skilled persons reviews” of CTPs\r\n\r\n\r\nJon Cunliffe, Deputy Governor for Financial Stability at the Bank of England said: “Financial market infrastructure firms are becoming increasingly dependent on third-party technology providers for services that could impact the financial stability of the UK if they were to fail or experience disruption. The potential measures examined in this [discussion paper] provide an initial, but important step … to manage these systemic risks.”\r\n\r\n\r\nThe supervisory authorities note the need to avoid international regulatory fragmentation, and instead outline cross-sectoral and global coordination, making specific reference to the EU’s Digital Operational Resilience Act (DORA), which reached the stage of a provisional agreement in May. \r\n\r\nWhile the UK framework targets the systemic risk from the services rendered by CTPs, the paper describes that it does not replace financial services firms’ and financial market infrastructure firms‘ responsibilities to manage risks from third parties.\r\n\r\nSubject to the outcome of Parliamentary debate on the Financial Services and Market Bill, and responses to the discussion paper, the supervisory authorities plan to consult on their proposed requirements in 2023.", "https://www.qa-financial.com/articles/validating-synthetic-data-is-key-challenge-says-fca": "The Financial Conduct Authority (FCA), the UK financial regulator, has published insights derived from its roundtable on synthetic data validation, which it hosted in collaboration with the UK’s Information Commissioner’s Office and The Alan Turing institute. The event, which took place in March involved participants from financial institutions, synthetic data vendors, regulatory agencies, and academic institutions.\r\n\r\nSynthetic data is generated artificially, and aims to mimic real-world data without containing personally identifiable information. It is commonly used in situations where access to real data is limited or restricted, allowing for model development and information sharing without compromising privacy.\r\n\r\nKey insights highlighted by the FCA are:\r\n\r\n“The challenge of validating synthetic data from utility, fidelity and privacy perspectives remains a critical barrier to synthetic data adoption.”\r\n\r\n“Understanding the requirements of a specific use case is paramount when assessing both utility and privacy.”\r\n\r\n“Model generalisability may be one method to increase the utility of synthetic data generators across multiple use cases, however this can lead to challenges with model drift and re-identification.”\r\n\r\n“Mathematical methods that validate the model that generated the synthetic dataset (the synthetic data generator) need to be supplemented with post-generation validation of the synthetic dataset.”\r\n\r\n“To drive adoption, the industry could shift to a risk-based model for privacy validation that accepts some level of inherent risk in generating and sharing synthetic data.”\r\n\r\n“Beyond validation, there are several ways to advance synthetic data adoption including use case documentation, standards and frameworks for adoption, and regulatory guidance.”\r\n\r\nThe FCA claims that it intends to “further explore these themes through the FCA’s recently established Synthetic Data Expert Group, which comprises 22 members across financial services firms, academia, synthetic data vendors, public sector organisations and others”. Further information on the Synthetic Data Expert Group can be found here.\r\n\r\nFull FCA comments on the roundtable are available here.\r\n\r\n[Image Source: Financial Conduct Authority]", "https://www.qa-financial.com/articles/bank-of-england-agrees-software-benchmarking-deal-with-qa-media": "The Bank of England has agreed to partner QA Media, the London-based information business that operates www.qa-financial.com.", "https://www.qa-financial.com/articles/delivering-quality-across-the-entire-workflow": "Delivering quality across the entire workflow\r\n\r\nAlmost all firms have a combination of core established systems and newer, often more Agile applications. Most run disconnected quality processes and testing across each. Problems slip through the cracks.\r\n\r\n\r\nThis research examines, therefore, the following challenges: \r\n\r\n\r\n• QA strategy and priorities: how to develop a holistic strategy for development and link it to effective quality management; \r\n\r\n• Delivery architecture: how to implement high-quality software in evolving architectures and with increased frequency of releases; and \r\n\r\n• Benchmarking: how to track and measure return on investment and delivery of quality.\r\n\r\n\r\nIn conducting this research, the QA Vector® team spoke to 33 technology leaders during February and March 2020 at major banks, asset managers and insurers, predominantly in Europe and North America.\r\n\r\n\r\n\r\nDownload the full report. ", "https://www.qa-financial.com/articles/hong-kong-authority-see-green-opportunity-in-digitalisation": "The Hong Kong Institute for Monetary and Financial Research (HKIMR), the research arm of the Hong Kong Monetary Authority, the central banking organisation of Hong Kong, has published a research report on “The Digitalisation of Financial Services in Hong Kong”. The report describes how the Institute views digitalisation across the Hong Kong financial sector, and highlights the regulatory approaches used to support this, as well as the potential to utilise digitalisation to help achieve sustainability objectives.\r\n\r\nThe three key themes of the report are:\r\n\r\nIndustry overview: The digitalisation of Hong Kong's financial services industry has been accelerated by several market factors such as: “High IT penetration rate, advancement of the FinTech ecosystem, and underlying technologies”. Policy initiatives have also been implemented to foster a conducive environment for digital transformation, including promoting FinTech adoption, nurturing the FinTech ecosystem and enhancing data infrastructure.\r\n\r\nEnvironmental Sustainability: The report claims that the digitalisation of financial services offers an: “Opportunity to foster environmental sustainability”. It references advancements in Cloud-based solutions, which have facilitated greener operation of the financial services industry by reducing the necessity for travel and paper-based transactions. Many financial institutions have leveraged digital channels to provide eco-friendly products, the report claims.\r\n\r\nPolicy implementations: The report outlines measures implemented both within Hong Kong and internationally to mitigate potential digital risks and enhance operational resilience. It also outlines guidelines for third-party vendor management, data protection, governance and technology adoption.\r\n\r\nFull report available here.\r\n\r\n[Image Source: Hong Kong Academy of Finance]", "https://www.qa-financial.com/articles/open-source-test-automation-best-practices-with-appium": "QA Financial | News and research on financial software quality assurance and risk management", "https://www.qa-financial.com/articles/servicenow-launches-observability-platform": "ServiceNow, the California-headquartered software company, has announced the launch of ServiceNow Cloud Observability, which will run on its software-as-a-service platform. The new offering is in turn based on the platform of observability specialist Lightstep, which ServiceNow acquired in 2021. \r\n\r\nServiceNow says the offering will utilise open source OpenTelemetry software to collect logs and metrics, in addition to a log management system that it acquired with its 2022 purchase of observability and log management specialists Era Software.\r\n\r\nPablo Stern, senior vice president and general manager for technology workflows products at ServiceNow, said: “The goal is to make it simpler to investigate IT issues involving applications and workflows that have multiple dependencies. That makes it possible to quickly diagnose an issue, determine the root cause and then dispatch the right site reliability engineering team to troubleshoot it.”\r\n\r\n[Image Source: ServiceNow]", "https://www.qa-financial.com/articles/why-you-should-focus-on-testing-not-automation-": "Why you should focus on testing, not automation", "https://www.qa-financial.com/articles/benchmarking-benefits-of-virtualization": "Research by QA Vector® Analytics, QA Financial's benchmarking platform, has identified test service virtualization as a key technology for accelerating app delivery - and quantified the benefits to financial firms.\r\n\r\n\r\n\r\nThe research, sponsored by Parasoft, a leading provider of virtualization technology via its Parasoft Virtualize platform, draws on QA Vector®  Analytics data provided by more than 20 financial institutions and in particular the experiences of ING and Bank of America.\r\n\r\n\r\n\r\nDownload your copy of the research whitepaper here.\r\n\r\n\r\n\r\nYou can also watch a video recording of an online seminar produced by QA Financial, featuring Raymond Smit, QA lead for ING's core mortgage system, and Istiak Ahmed, senior vice president for quality assurance at Bank of America, discussing the the quality challenges they face as they transition to continuous integration and deployment (CI/CD) and why they looked to service virtualization and Parasoft to accelerate that transformation.\r\n\r\n\r\n\r\nWatch the video here.", "https://www.qa-financial.com/articles/continuous-testing-with-quality-at-amdocs": "Can banks and brokerages pursue continuous testing without sacrificing quality? The answer is \"yes\" - but  meeting customers' ever-rising expectations for their user experience requires non-stop quality assurance.\r\n\r\n\r\n\r\nJoin QA Financial's online seminar on March 10th - the first in our 2022 Future of Software Quality Assurance series - to hear how Amdocs Quality Engineering (AQE), a leading services provider, has helped hundreds of organizations accelerate digital transformation. Also joining us will be our sponsor partner Quali, a global leader in infrastructure automation solutions.\r\n\r\n\r\nOur guest speakers will be Shay Cohen, CTO of Amdocs Quality Engineering and Amir Rozenberg, VP of Product at Quali.\r\n\r\n\r\n\r\nIt's now a widely-accepted tenet of DevOps that testing has to combine both  “shift left” and “shift right” methodologies. The traditional approach, where testing was a distinct phase late in the development lifecycle, is a thing of the past.\r\n\r\n\r\n\r\nIn the seminar, our expert speakers will explain how you can:  \r\n\r\nAccelerate modernization  by adopting a comprehensive DevSecOps approach \r\nDefine best practice to enhance your QA processes from ideation through execution \r\nUp-skill and train your team \r\nUnlock revenue generating opportunities with AI- and machine learning-based prediction models, performance testing, and network testing \r\nOur seminar is free to attend, so sign up now simply by clicking below:", "https://www.qa-financial.com/articles/esma-announces-eu-data-strategy": "The European Securities and Markets Authority (ESMA), the EU financial markets regulator, has announced a five-year data strategy designed to facilitate the use of new data-related technologies, reduce reporting compliance costs and make data more broadly available. \r\n\r\nThe key ESMA strategy objectives are:\r\n\r\nBecome an enhanced data hub: “Bolster ESMA as EU securities markets data hub, focusing on improved data and information accessibility, interoperability and usability, and achieving synergies and economies of scale”.\r\n\r\nEnsure access to data of public interest: “Contribute to providing easily accessible and usable information to the market participants, including to retail investors, in machine readable formats and via user-friendly search and analytical interfaces”.\r\n\r\nPromote data-driven supervision: “Enable cutting-edge, smart and effective data-driven supervision by joint developments and use of novel technologies”.\r\n\r\nIncrease data collaboration: “Achieve better data standardisation, quality and reusability, and to promote the adoption of innovative technologies”.\r\n\r\nIncrease the efficiency of data policy: “Reduce the compliance burden for reporting entities by reducing duplicative and inconsistent requirements, optimising reporting flows, effective and efficient data sharing, and exploiting emerging technologies”.\r\n\r\nFacilitate data use: “Establish processes, methodologies and tools enabling systematic use of data for evidence-based policy development, supervision and risk assessment”.\r\n\r\nCommenting on the announcement, Verena Ross, ESMA executive director, said: “I am pleased to present our new Data Strategy through which ESMA will strengthen its role both as a supervisor and as a data and information hub in the EU’’. “We want to contribute to reducing the compliance burden for companies and facilitate data reporting by means of increased standardisation and the use of modern IT solutions across the reporting process and the entire data lifecycle.’’\r\n\r\n[Image Source: European Security and Markets Authority]", "https://www.qa-financial.com/articles/github-leads-new-wave-of-coding-assistants": "In what is seen as a significant shift towards the wider adoption of low-code software development tools, GitHub, the software development and version control platform, has recently released Copilot, its AI-based coding assistant, to all developers.\r\n\r\nLow-code solutions have become more prominent as the reliability of artificial intelligence has continued to improve. The concept of ‘Software 2.0’, where code is written and abstracted by neural networks, has raised fears that programmers will become obsolete. However, coding assistants and no-code solutions have existed since at least 2013 and they have not taken over coding yet.\r\n\r\nCoding assistants seek to improve developer productivity by completing lines of code, or even predicting whole functions, based on the context and syntax of their environment. The idea is that less time is spent reading documentation when using unfamiliar frameworks or languages.\r\n\r\nKite and TabNine led the first generation of coding assistants. Their early predictions solely focused on completing lines of code. With constant evolution since their releases in 2014 and 2017, these older assistants have grown to support many languages and integrated development environments, using more elaborate models to predict complex code. There are now more than a dozen AI coding assistants generally available.\r\n\r\nGitHub released Copilot, its next-generation coding assistant, based on the neural networking model OpenAI Codex, a descendant of GPT-3, at the end of June. Copilot is trained on a range of source code, including public GitHub repositories. GitHub says Copilot allows developers to skip over writing boilerplate code, using prior context or plain English comments to determine the required functionality.\r\n\r\nShortly after Copilot was made available to individual developers, Amazon launched the preview round of its competitor, CodeWhisperer. Utilising its inherent links to the AWS Cloud, CodeWhisperer is able to determine which cloud services and public libraries are best suited to the code. Building on Amazon’s CodeGuru and DevOpsGuru, CodeWhisperer is set to introduce security scans into the process.\r\n\r\nGitHub admits that Copilot is not yet perfect. While able to autocomplete lines of code, functions, and their supporting tests, Copilot suggestions are only accepted by users around 26% of the time, according to GitHub’s own metrics. \r\n\r\nResearch by a team at the NYU Centre for Cybersecurity completed in 2021 found 40% of the code generated by Copilot contained security vulnerabilities resulting from bugs inherent in training from open-source repositories.\r\n\r\nOther concerns have been raised by Software Freedom Conservancy, a technology ethics nonprofit, around the risk of low-code platforms such as Copilot reusing code from open-source projects. CodeWhisperer is set to include information on how closely snippets match training data to let users avoid this.\r\n\r\nBut competition in the marketplace for low-code development tools will continue to grow. Another launch on the horizon is AlphaCode, designed by Alphabet-backed DeepMind. AlphaCode is claimed by its creators to perform better than the OpenAI Codex, the basis for Copilot. Unveiled in February for competitive programming, AlphaCode does not have a release date as a coding assistant, however.", "https://www.qa-financial.com/articles/hong-kong-regulator-urges-better-testing-for-payments-": "A letter to financial firms from Raymond Chan, Executive Director of Banking Supervision at the Hong Kong Monetary Authority, has laid out a series of practices for improving operational resilience following “a few payment-related operational incidents” reported over the past year.\r\n\r\nThe incidents were most often caused by IT system malfunctions and led to the failures at firms to process payments within regulated cut-off times, the letter said.\r\n\r\n“The HKMA would like to remind [authorised institutions] of the importance of maintaining high operational resilience with respect to their payment operations,” Chan said. Prevention measures should be improved with thorough testing of payments platforms, alongside closer monitoring of business operations and better incident reporting.\r\n\r\nThe circular highlights the need for thorough testing of payments services both before roll-out and in event of upgrades and also ensuring the same level of rigour is used in subsequent testing. \r\n\r\nThe HKMA also said that it expects continuity plans  to be robust, covering a range of scenarios (system outages and degraded services, for example) and should include risk assessments accounting for the time required to act on known disruption.\r\n\r\n\r\nAuthorised institutions are expected to review their current practices, with the HKMA set to increase its surveillance of payments systems.\r\n\r\n“In view of the increased number of payment-related operational incidents, the HKMA will step up its surveillance of AIs’ payment operations, including undertaking examinations\r\nfocused on payment operations,” the letter concluded.", "https://www.qa-financial.com/articles/how-jpmorgan-chase-is-re-inventing-it-risk-management": "How JPMorgan Chase is Re-inventing IT Risk Management", "https://www.qa-financial.com/articles/watch-on-demand-how-bankunited-benchmarks-its-agile-performance": "How BankUnited benchmarks Agile", "https://www.qa-financial.com/articles/ai-for-devops-becomes-established-gitlab-report-": "The use of AI in the development and testing process is becoming more commonplace, according to the findings of an annual survey conducted by GitLab, the software management platform.\r\n\r\nAccording to this year’s report - just released - 65% of developers are saying that they use AI and machine learning practices in testing, or will be within the next three years, compared to 51% last year. Meanwhile 53% of respondents said they claimed to use bots in their testing process, up from 39% in 2022.\r\n\r\nGitLab’s “Global DevSecOps Report” is based on more than 5,000 survey responses from developers across a range of industries and disciplines.\r\n\r\nThe report also found that use of DevOps and DevSecOps software methodologies are gaining popularity with 56% of respondents reporting their use in 2023 vs 47% in 2022. This trend was paired with  a decrease in the use of all other surveyed methodologies, including agile/scrum, kanban and waterfall.\r\n\r\nOverall, the developer toolkit is becoming more streamlined as companies consolidate the number of tools they use to develop and test software. Most respondents say they now use between two and five different development tools compared to 6 to 10, which was the most  common response in 2022.\r\n\r\nThe full report is available here.\r\n\r\n[Image Source: San Francisco Chronicle]", "https://www.qa-financial.com/articles/capital-markets-software-risk-based-testing-challenges": "CAPITAL MARKETS SOFTWARE: Risk-based testing challenges", "https://www.qa-financial.com/articles/flowe-experiences-and-considerations-from-year-zero": "Part of The QA Financial Digital Forum Italy:\r\n\r\nFlowe, l’ultima digital bank ad affacciarsi sul panorama italiano, è stata lanciata a giugno 2020. In che modo si è organizzata dal punto di organizzazione del lavoro, tecnologico, DevOps un’organizzazione che è partita da zero?\r\n\r\nSpeaker: Marco Segato, Augmented Intelligence Practitioner - Flowe", "https://www.qa-financial.com/articles/full-stack-quality-engineers-driving-enterprise-digital-transformation-1208": "Sri Atluri was QA Financial's keynote speaker at our June Digital Forum, and his presentation focused on his vision of how quality engineers can drive change at financial firms at the enterprise level. Prior to joining Bank of New York Mellon, Sri Atluri headed Quality Engineering (QE) at the NYSE, had previously worked as a Chief Quality Officer for JP Morgan Chase and as Global Head of Quality at Bank Of America, Verizon, Morgan Stanley, and BNP Paribas. ", "https://www.qa-financial.com/articles/mas-releases-ai-toolkit-for-financial-firms": "The Monetary Authority of Singapore (MAS) has released an open-source toolkit, which it claims will enable the responsible use of AI across the financial industry. The toolkit, which it has named The Veritas Toolkit version 2.0, was developed by an MAS-led consortium of 31 technology and financial firms, including the Bank of China, BNY Mellon, IBM and Microsoft. \r\n\r\nThe Veritas Toolkit version 2.0 succeeds version 1.0, released in February 2022, and introduces an updated fairness assessment methodology, as well as additional methodologies for accountability, transparency and ethics.\r\n\r\nMAS claims that the toolkit will help financial institutions to “carry out the assessment methodologies for the Fairness, Ethics, Accountability and Transparency (FEAT) principles”. The FEAT principles, introduced by MAS in 2018, provides guidance on the responsible use of AI and data analytics and strengthening internal governance around data management and use. \r\n\r\nCommenting on the release, MAS chief fintech officer, Sopnendu Mohanty [pictured] said: “Given the rapid pace of developments in AI, it is critical that financial institutions have in place robust frameworks for the responsible use of AI”.\r\n\r\n“Version 2.0 will enable financial institutions and fintech firms to effectively assess their AI use cases for FEAT principles, and this will help promote a responsible AI ecosystem.”\r\n\r\nFull press release available here.\r\n\r\n[Image Source: Twitter]", "https://www.qa-financial.com/articles/mas-to-launch-digital-esg-credentials": "The Monetary Authority of Singapore (MAS) has announced that it will embark on an initiative to develop digital environmental, social and governance (ESG) credentials for enterprises worldwide, which it claims will: “Help simplify the ESG reporting process”. The initiative, known as Project Savannah, was announced in collaboration with the United Nations Development Programme (UNDP) and the Global Legal Entity Identifier Foundation (GLEIF). \r\n\r\nMAS claims that the project will establish a common framework of ESG metrics for micro, small and medium-sized enterprises (MSMEs) to generate sustainability credentials. The initiative will focus on the following areas, MAS said:\r\n\r\nCapacity building: Review and enhancement of existing initiatives to increase the capacity of current initiatives to aid the reporting of ESG data.\r\nSimplified reporting: Simplify and streamline the reporting process of MSME’s via the adoption of a new digital reporting tool and the pre-population of metrics using verified data where possible.\r\nAccessible data: The ESG credentials will be accessible to any authorised third party, to foster observability and trust.\r\n\r\nCommenting on the announcement UNDP global lead of digital finance, Aiaze Mitha said that the project: “Will harness the potential offered by digital innovations to automate sustainability reporting for even the smallest SMEs, by overcoming existing barriers such as access to relevant data, cost, complexity, and capacity and knowledge gaps. This will play a significant role in ensuring that MSMEs are not locked out of sustainable finance and in supporting their green transition.”\r\n\r\n[Image Source: Twitter]", "https://www.qa-financial.com/articles/micro-focus-readies-rpa-and-ai-visual-testing-tools": "The UK-based testing giant is planning to launch new RPA and AI testing tools that will “revolutionise” functional testing, says Raffi Margaliot, head of application delivery (pictured).", "https://www.qa-financial.com/articles/new-ceo-for-applause": "New CEO for Applause", "https://www.qa-financial.com/articles/pandemic-driven-testing-best-practices-for-the-next-normal": "Pandemic-Driven Testing: Best practices for the next normal", "https://www.qa-financial.com/articles/the-link-between-governance-and-digitalisation-": "A working paper published by the European Central Bank suggests a relationship between the spread of digital technologies and the quality of oversight by central institutions and a range of regulatory governance factors. \r\n\r\nAs a proxy for wider technology adoption, the paper analyses adoption rates of internet and broadband subscriptions in 101 different countries over a 24-year period, and then seeks toto describe their evolution with an algorithm weighted by a series of governance and institutional factors.\r\n\r\n“The quality of institutions and governance affect how easy or how hard it is to use digital technology, for example to get access to the internet, or to use search engines, mobile phones, or robots,” say the paper’s authors, Claudio Baccianti (Project Manager, EU Sustainable Finance at Agora Energiewende), Vincent Labhard (Principal Economist at ECB), Jonne Lehtimäki (Consultant for ECB). \r\n\r\nGovernance factors included regulatory quality - defined by the ability to implement sound regulation that promotes private sector development - and “score” for rates of corruption, using the Worldwide Governance Indicators (WGIs) published by the World Bank. Institutional indicators, meanwhile, cover political stability and the effectiveness of government in different countries.\r\n\r\nWhen determining the significance of institutional and governance measures, the paper accounted for other key factors, including national economy, human capital, and level of development, increasing the statistical significance of relationships noted. \r\n\r\nThe researchers found that European and OECD countries generally performed similarly well in terms of digital adoption, with a clear link to their high scores for governance. \r\n\r\nOutside of these countries, where the governance and institutional scores were lower, rates of progress were slower, and more geared to real GDP.\r\n\r\nWhile generally showing a positive relationship between strong governance and digital adoption rates, the results also showed that high governance can occasionally lead to slower digitalisation. In EU countries, for example, it was also found that broadband subscriptions were hindered by governance; a likely sign of “excessive” regulation. \r\n\r\nThere is little data that can be used to draw similar conclusions about emerging technologies such as artificial intelligence, the internet of things, ‘digital twins’, and quantum computing, the authors point out. They suggest that regulators encourage the development of this information by traditional data sources while ‘big data’ sources could be found to supplement further research", "https://www.qa-financial.com/articles/accelerate-digital-transformation-through-automated-testing": "Accelerate Digital Transformation Through Automated Testing", "https://www.qa-financial.com/articles/applause-unifies-automation-and-crowd-testing-on-new-platform": "Applause, the Berlin-based testing services specialist, has launched what it has called its Product Excellence Platform", "https://www.qa-financial.com/articles/augment-your-app-security-framework-by-developing-a-devsecops-approach": "What is best practice in embedding security and penetration testing in the SDLC?  How do you take advantage of the agile deployment and testing that the Cloud provides without making security a lost feature or a road block to delivery?  This session will focus not just on where tools can integrate into your SDLC, but how education and awareness on security and the benefits of early integration can help make testing a greater value add to your feature release. Join David Cafaro, Director, Information Security Office from Capital One in a discussion on these topics.", "https://www.qa-financial.com/articles/automating-accessibility-is-easier-than-you-think": "Automating accessibility is easier than you think", "https://www.qa-financial.com/articles/automation-and-accessibility-shift-left-roi": "One in five Americans has a disability. Website UX also has to take account of an ageing population.", "https://www.qa-financial.com/articles/digital-accessibility-legal-update-how-to-prevent-potential-risk": "Digital Accessibility Legal Update: How to Prevent Potential Risk", "https://www.qa-financial.com/articles/is-automated-data-the-future-of-testing-": "Is Automated Data the Future of Testing?", "https://www.qa-financial.com/articles/leadership-insight-michael-palotas-ceo-and-co-founder-element34-solutions": "QA Financial | News and research on financial software quality assurance and risk management", "https://www.qa-financial.com/articles/managing-the-transformation-to-a-data-driven-bank-the-dnb-case-study": "Managing the transformation to a data-driven bank - the DNB case study", "https://www.qa-financial.com/articles/parasoft-partner-content-best-practices-for-implementing-continuous-testing": "Download this whitepaper from Parasoft to identify the best practices for implementing continuous testing as part of a DevOps toolchain.", "https://www.qa-financial.com/articles/perfecto-plans-for-ai-leadership-1": "QA Financial | News and research on financial software quality assurance and risk management", "https://www.qa-financial.com/articles/retail-banking-and-financial-services-defining-software-quality-for-the-robo-generation": "RETAIL BANKING AND FINANCIAL SERVICES: Defining software quality for the robo generation", "https://www.qa-financial.com/articles/speeding-up-you-digital-transformation-with-ai-enabled-test-authoring": "Speeding Up You Digital Transformation with AI-enabled Test Authoring", "https://www.qa-financial.com/articles/the-rising-stars-of-qa-six-new-vendors-to-watch-in-2019": "QA Financial | News and research on financial software quality assurance and risk management", "https://www.qa-financial.com/articles/ubs-centralises-qa-and-raises-expectations-of-vendors": "QA Financial | News and research on financial software quality assurance and risk management", "https://www.qa-financial.com/articles/video-global-payments-on-testing-for-google-cloud": "Video: Global Payments on testing for Google Cloud", "https://www.qa-financial.com/articles/what-is-value-based-devops-": "QA Financial | News and research on financial software quality assurance and risk management", "https://www.qa-financial.com/articles/software-risk-and-compliance-round-up-july": "Here’s QA Financial’s monthly review of new developments and initiatives in compliance and regulation that affect the management of software at financial firms.\r\n\r\nBasel Committee proposes new guidelines for digital resilience\r\n\r\nThe Basel Committee on Banking Supervision - the supervisory arm of the BIS, the central bank for central banks - has issued a public consultation on proposed revisions to its core principles for effective banking supervision.\r\n\r\n\r\nPerhaps the most substantial change proposed by Basel is the broadening of its guidelines on operational risk management, or number 25 of its core principles. The Basel Committee is proposing a widening of principle 25 to include digital resilience alongside operational risk and adds a proposed new requirement that banks should assess: “Tolerance for disruption to their critical operations” to the existing listed operational risks.\r\n\r\n\r\nFull article available here.\r\nEuropean Banking Authority stresses the importance of proactive fintech regulation\r\n\r\nIn a recent speech given at the Central Bank of Cyprus, European Banking Authority chairperson José Manuel Campa [pictured] highlighted the growing role of fintech in the financial sector. He went on to stress the importance of proactive fintech regulation, saying: “Industry, supervisors and regulators need to be proactive in identifying, monitoring and mitigating risks that are often multi-faceted and inter-related.”\r\n\r\nFull speech available here.\r\n\r\n\r\n\r\nLeading US companies pledge AI risk management \r\nThe US government has secured voluntary commitments from seven leading AI-focussed companies - Amazon, Anthropic, Google, Inflection, Meta, Microsoft, and OpenAI - to manage the risks posed by AI. The commitments underscore safety, security, and trust, marking a step towards responsible AI. The companies have committed to safety testing of AI systems before release, sharing information on managing AI risks, investing in cybersecurity, reporting AI systems' capabilities and limitations, and prioritising research on societal risks posed by AI.\r\nFurther information available here.\r\n\r\nFintech cloud standards project launched\r\n\r\nThe Fintech Open Source Foundation (FINOS), an independent organisation focussed on supporting the use of open source software in financial services, is launching a project which will attempt to establish consistent controls for compliant public cloud deployments in the financial services sector. The project, based on an approach developed by Citi, aims to create a unified set of cybersecurity, operational resiliency, and compliance controls for common services across major cloud service providers. The initiative seeks to mitigate the systemic risk of cloud concentration and simplify access for all institutions to operate on the public cloud. Other FINOS members, including the Bank of Montreal, Goldman Sachs, Morgan Stanley, and Google Cloud, are also participating.\r\n\r\nFurther information available here.\r\n\r\nFCA comments on AI and Big Tech regulation\r\n\r\nChief Executive of the Financial Conduct Authority (FCA), Nikhil Rathi [pictured], has outlined the UK's emerging regulatory approach to Big Tech and Artificial Intelligence at an industry conference .\"We welcome the government’s call for the UK to be the global hub of AI regulation and will open our AI sandbox to firms wanting to test the latest innovations,\" Rathi said.\r\n\r\nThe FCA is also planning to regulate firms designated as critical third parties, Rathi explained: \"Together with the Bank of England and PRA (Prudential Regulation Authority), we will therefore be regulating these critical third parties - setting standards for their services – including AI services - to the UK financial sector. That also means making sure they meet those standards and ensuring resilience.\"\r\n\r\nFull article available here.\r\n\r\nFCA launches Digital Sandbox\r\n\r\nThe Financial Conduct Authority (FCA), the UK financial regulator, has announced the formal launch of its Digital Sandbox software testing environment. The sandbox, which has been available for two previous pilot schemes, will be made permanently available to businesses from 1st August 2023. \r\n\r\nThe Digital Sandbox is a virtual environment where companies can experiment with new ideas without the risk of regulatory penalties or operational disruptions. It provides a space for innovators to test their concepts using synthetic data, APIs, and other digital tools. The platform will also “enable regulators to observe in-flight testing” and may inform future policy decisions, the FCA said.\r\n\r\n[Image Source: European Banking Authority]"}